{
	"_meta": {
		"sources": [
			{
				"json": "Aarakocra",
				"abbreviation": "WMR",
				"full": "Aarakocra",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/"
			}
		],
		"dateAdded": 1586943396,
		"dateLastModified": 1586943396
	},
	"race": [
		{
			"name": "Aarakocra",
			"source": "Aarakocra",
			"size": [
				"M"
			],
			"speed": {
				"walk": 25,
				"fly": 40
			},
			"ability": [
				{
					"con": 2,
					"choose": {
						"from": [
						"str",
						"dex",
						"int",
						"wis",
						"cha"
						],
						"count": 2
					}
				}	
		
			],
			"traitTags": [
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"primordial": true,
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Aarakockra tend to grow up very fast, reaching adulthood at the age of 14 and living up to 70 years."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Aarakocra are about 5 feet tall. They have thin, lightweight bodies that weigh between 80 and 100 pounds. Your size is Medium."
					]
				},
				{
					"name": "Attuned Flight",
					"entries": [
						"You have a flying speed of 40 feet. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item."
					],
					"type": "entries"
				},
				{
					"name": "Updraft",
					"entries": [
						"Your powerful legs come segmented into two separate sections, which shift together tightly to produce a large amount of force that puts horses to shame.As a bonus action, you can launch yourself 10-feet into the air in a single movement. This movement does not provoke opportunity attacks, and you immediately begin flying with your Attuned Flight or similar feature. If you do not have a fly speed, you maintain your elevation for a few seconds, falling back to the ground at the end of your turn. Once you use this ability, you cannot do so again until you finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Peak Dwellers",
					"entries": [
						"You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to strong wind and cold environments, as described in chapter 5 of the Dungeon Master's Guide, and have resistance to cold damage."
					],
					"type": "entries"
				},
				{
					"name": "Talons",
					"entries": [
						"You have proficiency with your claws, which are a finesse weapon that deal 1d6 slashing damage."
					],
					"type": "entries"
				},
				{
					"name": "Shining Wings",
					"entries": [
						"Your wings have been sheened with a divine blessing from the Elemental Plane of Air, which you can use to reestablish your connection to your forlorn home. As a bonus action, you regain 2d4+4 hit points. Once you use this ability, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common, Aarakocra, and Auran."
					],
					"type": "entries"
				}
			]
		}
	]
}