{
	"_meta": {
		"sources": [
			{
				"json": "WMBanneret",
				"abbreviation": "WMBF",
				"full": "Banneret",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1537874753,
		"dateLastModified": 1537874753
	},
	"subclass": [
		{
			"name": "Banneret",
			"subclassFeatures": [
				"Banneret|Fighter||Banneret|WMBanneret|3",
				"Royal Envoy|Fighter||Banneret|WMBanneret|7",
				"Inspiring Surge|Fighter||Banneret|WMBanneret|10",
				"Bulwark|Fighter||Banneret|WMBanneret|15",
				"Knight's Vow|Fighter||Banneret|WMBanneret|18"
			],
			"source": "WMBanneret",
			"shortName": "Banneret",
			"className": "Fighter",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "Banneret",
			"source": "WMBanneret",
			"page": 70,
			"className": "Fighter",
			"classSource": "PHB",
			"subclassShortName": "Banneret",
			"subclassSource": "WMBanneret",
			"level": 3,
			"entries": [
				"Purple Dragon knights are warriors who hail from the kingdom of Cormyr. Pledged to protect the crown, they take the fight against evil beyond their kingdom's borders. They are tasked with wandering the land as knights errant, relying on their judgment, bravery, and fidelity to the code of chivalry to guide them in defeating evildoers.",
				"A Purple Dragon knight inspires greatness in others by committing brave deeds in battle. The mere presence of a knight in a hamlet is enough to cause some ores and bandits to seek easier prey. A lone knight is a skilled warrior, but a knight leading a band of allies can transform even the most poorly equipped militia into a ferocious war band.",
				"A knight prefers to lead through deeds, not words. As a knight spearheads an attack, the knight's actions can awaken reserves of courage and conviction in allies that they never suspected they had. - Sword Coast Adventurer's Guide.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Rallying Cry|Fighter||Banneret|WMBanneret|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "Rallying Cry",
			"entries": [
				"When you choose this archetype at 3rd level, you learn how to inspire your allies to fight on past their injuries.",
				"When you use your Second Wind feature, you can choose a number of allied creatures up to 1 plus your Charisma modifier (minimum of one) within 60 feet of you. Each one regains hit points equal to your Charisma modifier plus your fighter level (minimum of 1), provided that the creature can see or hear you."
			],
			"source": "WMBanneret",
			"page": 70,
			"className": "Fighter",
			"classSource": "PHB",
			"subclassShortName": "Banneret",
			"subclassSource": "WMBanneret",
			"level": 3,
			"header": 1
		},
		{
			"name": "Royal Envoy",
			"source": "WMBanneret",
			"page": 70,
			"className": "Fighter",
			"classSource": "PHB",
			"subclassShortName": "Banneret",
			"subclassSource": "WMBanneret",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level, you can give yourself a bonus to your initiative rolls equal to your Charisma modifier.",
				"You also gain proficiency in the Persuasion skill. If you are already proficient in it, you gain proficiency in one of the following skills of your choice: Animal Handling, Insight, Intimidation, or Performance.",
				"Your proficiency bonus is doubled for any ability check you make that uses Persuasion. You receive this benefit regardless of the skill proficiency you gain from this feature."
			]
		},
		{
			"name": "Inspiring Surge",
			"source": "WMBanneret",
			"page": 70,
			"className": "Fighter",
			"classSource": "PHB",
			"subclassShortName": "Banneret",
			"subclassSource": "WMBanneret",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, when you use your Action Surge feature, you can choose a number of allies equal to 1 plus half your Charisma modifier (rounded down) within 60 feet of you. The creatures you choose can make one melee or ranged weapon attack with its reaction, provided that it can see or hear you. If your allies attack a creature you have attacked this round, their attack has advantage.",
				"Starting at 18th level, the number of allies you can choose is equal 1 plus your Charisma modifier."
			]
		},
		{
			"name": "Bulwark",
			"source": "WMBanneret",
			"page": 70,
			"className": "Fighter",
			"classSource": "PHB",
			"subclassShortName": "Banneret",
			"subclassSource": "WMBanneret",
			"level": 15,
			"header": 2,
			"entries": [
				"Beginning at 15th level, you can extend the benefit of your Indomitable feature to an ally. When you decide to use Indomitable to reroll a saving throw and you aren't incapacitated, you can choose one ally within 60 feet of you that also failed its saving throw against the same effect. If that creature can see or hear you, it can reroll its saving throw and must use the new roll."
			]
		},
		{
			"name": "Knight's Vow",
			"source": "WMBanneret",
			"page": 70,
			"className": "Fighter",
			"classSource": "PHB",
			"subclassShortName": "Banneret",
			"subclassSource": "WMBanneret",
			"level": 18,
			"header": 2,
			"entries": [
				"Starting at 18th level, you can spend an action rallying the resolve of your allies. When you do so, you and a number of other friendly creatures you choose up to your Charisma modifier (minimum of one) within 60 feet of you that can see or hear you and can understand you can't be charmed or frightened. If a target is already charmed or frightened, that condition is suppressed for as long as this feature is active.",
				"These benefits last for one hour or until you fall unconscious.",
				"You can use this feature two times, and you regain all expended uses of it when you finish a long rest."
			]
		}
	]
}