{
  "_meta": {
    "sources": [
      {
        "json": "WME",
        "abbreviation": "WME",
        "full": "West March Exclusive",
        "authors": ["Wyth"],
        "convertedBy": ["Wyth#8882"],
        "version": "1.0",
        "url": "kagrea.github.io/SRP/",
        "targetSchema": "1.0.0"
      },
      {
        "json": "WMHBI",
        "abbreviation": "WMHBI",
        "full": "West March Homebrew Items",
        "authors": ["Wyth"],
        "version": "1.0.0",
        "url": "kagrea.github.io/SRP/",
        "convertedBy": ["Wyth#8882"],
        "targetSchema": "1.0.0"
      },
      {
        "json": "WMUMI",
        "abbreviation": "WMUMI",
        "full": "West March Unique Magic Items",
        "authors": ["Gebri", "Kusal"],
        "version": "1.0.0",
        "url": "kagrea.github.io/SRP/",
        "convertedBy": ["Gebri#6820"],
        "targetSchema": "1.0.0"
      },
      {
        "json": "WMAI",
        "abbreviation": "WMAI",
        "full": "West March Arisen Items",
        "authors": ["Wyth"],
        "convertedBy": ["Wyth#8882"],
        "version": "1.0.0",
        "url": "kagrea.github.io/SRP/",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 0,
    "dateLastModified": 1954236505
  },
  "itemProperty": [
    {
      "abbreviation": "AM",
      "source": "WMHBI",
      "entries": [
        {
          "type": "entries",
          "name": "Ammo+",
          "entries": [
            "This weapon requires advanced ammunition to fire, usually gunpowder, bullets, or magazines."
          ]
        }
      ]
    },
    {
      "abbreviation": "AR",
      "source": "WMAI",
      "entries": [
        {
          "type": "entries",
          "name": "Arisen Weapon",
          "entries": [
            "So long as you remain bound to your Arisen, you are considered proficient in this weapon. If you ever are to become unbound to your Arisen, the weapon vanishes, and so do any benefits it gives.",
            "No creature other than the bonded target may use or hold this weapon—the action becomes physically impossible whenever attempted. In addition, you gain the ability to summon this weapon as a bonus action on your turn, causing it to instantly appear equipped onto your form and become attuned (if you have a free attunement slot)."
          ]
        }
      ]
    },
    {
      "abbreviation": "EX",
      "source": "WMHBI",
      "entries": [
        {
          "type": "entries",
          "name": "Explosive",
          "entries": [
            "On a hit, every creature within 5 feet of the target much make a Dexterity saving throw (DC equal to 8 + your proficiency bonus + your Dexterity modifier) or suffer {@dice 1d8} fire damage. If the weapon misses, the ammunition fails to detonate, or bounces away harmlessly before doing so. Explosive weapons will also damage terrain (if applicable)."
          ]
        }
      ]
    },
    {
      "abbreviation": "RET",
      "source": "WMHBI",
      "entries": [
        {
          "type": "entries",
          "name": "Returning",
          "entries": [
            "When a thrown weapon also carrying the returning property is thrown as part of an attack, it returns to its wielder immediately after the attack. When throwing a returning weapon, you can choose to not have it return in order to add 5 feet to its short range and 10 feet to its long range."
          ]
        }
      ]
    },
    {
      "abbreviation": "OF",
      "source": "WMHBI",
      "entries": [
        {
          "type": "entries",
          "name": "Overwhelming Force",
          "entries": [
            "On a critical hit, the target is knocked prone if you attacked from within normal range of the shotgun."
          ]
        }
      ]
    },
    {
      "abbreviation": "VAR",
      "source": "WMAI",
      "entries": [
        {
          "type": "entries",
          "name": "Variable",
          "entries": ["The properties of this item varies."]
        }
      ]
    }
  ],
  "itemType": [
    {
      "abbreviation": "TI",
      "source": "WMHBI",
      "name": "Technological Item",
      "entries": [
        {
          "type": "entries",
          "name": "Technological",
          "entries": [
            "As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
          ]
        }
      ]
    },
    {
      "abbreviation": "HCI",
      "source": "WME",
      "name": "Homebrew Custom Item",
      "entries": []
    },
    {
      "abbreviation": "HCW",
      "source": "WME",
      "name": "Homebrew Custom Weapon",
      "entries": []
    },
    {
      "abbreviation": "CONS",
      "source": "WME",
      "name": "Consumable",
      "entries": [
        {
          "type": "entries",
          "name": "Consumable",
          "entries": ["This item is consumed on use."]
        }
      ]
    },
    {
      "abbreviation": "VA",
      "source": "WMAI",
      "name": "Variable Weapon",
      "entries": [
        {
          "type": "entries",
          "name": "Variable Weapon",
          "entries": ["The type of this weapon varies."]
        }
      ]
    }
  ],
  "item": [
    {
      "name": "Headphones",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 0.1,
      "type": "TI",
      "value": 10000,
      "entries": [
        "Headphones are a pair of earphones joined by a band placed over the head, for listening to audio signals such as music or speech. They can be connected using an audio jack attached to a wire (or ocassionally, through a wireless pairing mechanism known as bluetooth) in order to receive audio files from an output device (usually a smartphone, music player, or equivalent).",
        "The volume of the output device can generally be adjusted in order to change the decibels at which the audio is played. Maximizing or near-maximizing the volume will result in the user being put under the {@condition deafened} condition, as they are unable to hear anything other than the audio pouring out from the internal speakers.",
        "Headphones can be reskinned as earphones. If done so, their weight reduced by a considerable margin (generally anywhere from 0.01 lbs to 0.05 lbs). In addition, headphones that utilize bluetooth connectively require time to charge, similar to that of smartphones."
      ]
    },
    {
      "name": "Smartphone",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 0.2,
      "type": "TI",
      "value": 50000,
      "entries": [
        "A mobile phone that performs many of the functions of a computer, typically having a touchscreen interface, Internet access, and an operating system capable of running downloaded applications.",
        "There are many things a smartphone has access to, which includes but are not limited to:",
        "{@bold Communication.} Conversations using smartphones can be made across long distances, similar to that of sending stones. However, the difference lies in the ability to have full-length conversations back-and-forth through the digital wire. In addition, two smartphones do not need to be linked, and any smartphone in the world can be called by simply dialing another smartphone's number.",
        "{@bold Networking.} Various applications can be accessed utilizing a smartphone, such as news apps that grant numerous amounts of up-to-date information about the world. This information, without a smartphone, would normally be gathered via bulletin or through use of a television screen.",
        "{@bold Gaming.} Games can be played on smartphones, granting the user something to do when passing a large amount of time, such as when the party decides to take a short rest. Boredom on long trips is a real issue, you know.",
        "{@bold Limited Use.} The main issue with smartphones are their limited uses outside of nations with proper wire networking such as Slecrotor and Zyraitix—without any cellphone communication towers, communication and networking is left as an impossibility (although games can still be played on smartphones without a connection). Smartphones will refuse to dial outside of their designated service range, usually a few miles away from a cellphone tower or equivalent.",
        "{@bold Charging.} Majority of all smartphones are charged using a wired USB device that plugs into a wall socket or power outlet. In most cases, it is also possible to charge smartphones using a wireless charging device powered via spellstone known as a {@italic mana dynamo}. Many inns which serve out-of-state guests, specifically around populated epicenters for carousing and trade, will have these devices."
      ]
    },
    {
      "name": "Flashlight",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 2,
      "type": "TI",
      "value": 30000,
      "entries": [
        "Flashlights come in a wide variety of sizes and quality levels. Those covered here are professional, heavy-duty models, rugged enough to withstand the rigors of modern adventuring.",
        "{@bold Penlight.} This small flashlight can be carried on a key ring. It projects bright light in a 10 foot cone, and dim light for an additional 10 feet.",
        "{@bold Standard.} This heavy metal flashlight projects bright light in a 30 foot cone, and dim light for an additional 30 feet.",
        "{@bold Battery Flood.} Practically a handheld spotlight, this item projects bright light in a 100 foot cone, and dim light for an additional 100 feet.",
        "{@italic In addition, flashlights have multiple properties which make them unique:}",
        "{@bold Battery Powered.} The majority of flashlights must be powered using batteries. A full set of batteries in a flashlight will allow it to last for ten minutes, after which the batteries must be replaced. You can purchase new batteries in any store that offers them, usually in technologically-adept nations such as Slecrotor and Zyraitix. Notably, battery flood flashlights require advanced batteries."
      ]
    },
    {
      "name": "Standard Batteries",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 0.01,
      "type": "TI",
      "value": 2500,
      "entries": [
        "These batteries can be used to power most items that state they require them. Any device that uses batteries comes with them. Different items require varying amount of batteries, shown by the following list:",
        "{@bold Flashlights.} Penlight and Standard flashlights can be powered by inserting three standard batteries into their core, which last for ten minutes."
      ]
    },
    {
      "name": "Advanced Batteries",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 0.01,
      "type": "TI",
      "value": 7500,
      "entries": [
        "These batteries can be used to power most items that state they require them. Any device that uses batteries comes with them. Different items require varying amount of batteries, shown by the following list:",
        "{@bold Flashlights.} Battery Flood flashlights can be powered by inserting two advanced batteries into their core, which last for ten minutes."
      ]
    },
    {
      "name": "Chemical Light Stick",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 1,
      "type": "TI",
      "value": 1500,
      "entries": [
        "This disposable plastic stick, when activated, uses a chemical reaction to create light for 6 hours. It illuminates an area only 5 feet in radius. Once activated, it can’t be turned off or reused."
      ]
    },
    {
      "name": "Gas Mask",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 5,
      "type": "TI",
      "value": 10000,
      "entries": [
        "This apparatus covers the face and connects to a chemical air filter canister to protect the lungs and eyes from toxic gases. It provides total protection from eye and lung irritants. The filter canister lasts for 12 hours of use. Changing a filter is an action. The value for one extra filter canister is 6 gold."
      ]
    },
    {
      "name": "Spike Strip",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 22,
      "type": "TI",
      "value": 5000,
      "entries": [
        "This device is designed to help the police end car chases. The strip comes rolled in a spool about the size of a small suitcase. It can be deployed as an action by rolling it across a roadway, where it lies like a flat, segmented belt (at maximum it extends 15 by 5 feet). Until the strip is activated, the spikes do not protrude, and cars can pass safely over it. You can activate it as a reaction via a control device attached to the end of the strip by a 10-foot-long cord, causing the spikes to extend.",
        "Any creature that enters the area must succeed on a DC 15 Dexterity saving throw or stop moving and take 1 piercing damage. Until the creature regains at least 1 hit point, its walking speed is reduced by 10 feet. A creature moving through the area at half speed doesn’t need to make the saving throw.",
        "Wheeled vehicles passing over an activated strip are automatically hit regardless at the speed they were travelling at, although vehicles equipped with puncture-resistant tires are not affected. When a vehicle is hit by an activated strip, their movement speed is restricted to phase 1 for 3 rounds, and after those 3 rounds elapse, their movement speed becomes 0 until their tires are repaired."
      ]
    },
    {
      "name": "Steel Handcuffs",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 1,
      "type": "TI",
      "value": 1000,
      "entries": [
        "Handcuffs are restraints designed to lock two limbs—normally the wrists—of a prisoner together. They fit any Medium-size or Small human or other creature that has an appropriate body structure. You can make an opposed Strength ({@skill Athletics}) check against a grappled creature to attach the handcuffs to the creature, putting them under the {@condition restrained} condition.",
        "These heavy-duty cuffs require a Strength ({@skill Athletics}) check with a DC of 25 to break, and require a Dexterity ({@skill Sleight of Hand}) check or Dexterity ({@skill Acrobatics}) check (DC 20) to remove without the key.",
        "Steel Handcuffs, upon purchasing, always come with a key, which can be used to unlock the handcuffs without a check."
      ]
    },
    {
      "name": "Zip-Tie",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 0.05,
      "type": "TI",
      "value": 500,
      "entries": [
        "Handcuffs are restraints designed to lock two limbs—normally the wrists—of a prisoner together. They fit any Medium-size or Small human or other creature that has an appropriate body structure. You can make an opposed Strength ({@skill Athletics}) check against a grappled creature to attach the handcuffs to the creature, putting them under the {@condition restrained} condition.",
        "These are single-use disposable handcuffs, much like heavy-duty cable ties. They require a Strength ({@skill Athletics}) check with a DC of 20 to break, and require a Dexterity ({@skill Sleight of Hand}) check or Dexterity ({@skill Acrobatics}) check (DC 15) to remove. They can only be removed by cutting them off."
      ]
    },
    {
      "name": "Recorder",
      "source": "WMHBI",
      "rarity": "none",
      "weight": 0.5,
      "type": "TI",
      "value": 35000,
      "entries": [
        "This small metal device fits in your hand like a charm, and is loosely equipped with a few functions, the primary of which allow its user to record the vocal utterances of another creature.",
        "This device can record up to five minutes of audio without stopping, and while you cannot record more than five minutes, you can delete your previous recordings in order to free-up space. Whenever you finish recording a creature, ask your DM how much time elapsed to determine how much space you have left in your recorder."
      ]
    },
	{
      "name": "Light Pistol",
      "source": "WMHBI",
      "type": "R",
      "rarity": "none",
      "weight": 2,
      "value": 4000,
      "weaponCategory": "firearm",
      "property": ["A", "AM", "L", "LD"],
      "dmg1": "1d6",
      "range": "30/90",
      "ammo": "3 gp for 10",
      "dmgType": "P",
      "firearm": true,
	  "weapon": true,
      "entries": []
    },
    {
      "name": "Pistol",
      "source": "WMHBI",
      "type": "R",
      "rarity": "none",
      "weight": 3,
      "value": 5000,
      "weaponCategory": "firearm",
      "property": ["A", "AM", "LD"],
      "dmg1": "1d8",
      "range": "60/120",
      "ammo": "3 gp for 10",
      "dmgType": "P",
      "firearm": true,
      "weapon": true,
      "entries": []
    },
    {
      "name": "Shotgun",
      "source": "WMHBI",
      "type": "R",
      "rarity": "none",
      "weight": 8,
      "value": 6000,
      "weaponCategory": "firearm",
      "property": ["OF", "A", "AM", "LD"],
      "dmg1": "1d10",
      "range": "30/60",
      "ammo": "3 gp for 10",
      "dmgType": "P",
      "firearm": true,
      "weapon": true,
      "entries": []
    },
    {
      "name": "Rifle",
      "source": "WMHBI",
      "type": "R",
      "rarity": "none",
      "weight": 8,
      "value": 10000,
      "weaponCategory": "firearm",
      "property": ["2H", "LD", "A", "AM"],
      "dmg1": "1d12",
      "range": "80/240",
      "ammo": "3 gp for 10",
      "dmgType": "P",
      "firearm": true,
      "weapon": true,
      "entries": []
    },
    {
      "name": "The Beginner's Blade",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": true,
      "weight": 3,
      "type": "HCI",
      "entries": [
        "This decorated longsword appears to be a simple showpiece and not meant for battle. When sheathed at the hip of the wearer the hilt of the blade gives off a bright blue and gold shine.",
        "While attuned to this sword the wearer is able to cast the following spells:",
        {
          "type": "list",
          "items": [
            "{@spell Mending} — {@bold 0th Level} — At will",
            "{@spell Spiritual Weapon} — {@bold 2nd Level} — 3/day"
          ]
        },
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Petal Dancer Ward",
      "source": "WMUMI",
      "rarity": "Uncommon",
      "tier": "minor",
      "reqAttune": true,
      "weight": 2,
      "type": "HCI",
      "entries": [
        "This cape is made of colorful, aromatic petals. As you walk, a dusting of petals drift behind you, disappearing before they touch the ground. You can change the color of the petals using a bonus action. While you wear and are attuned to this cape, you can cast the {@spell druidcraft} cantrip at will, and creatures with a sense of smell make attacks of opportunity against you with disadvantage.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Firecracker Crystals",
      "source": "WMUMI",
      "rarity": "Common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 1,
      "type": "HCI",
      "entries": [
        "These multicolored crystals are usually purchased in small bags at festivals and holiday events. As an action, you can throw one of these inch-long crystals against a solid surface to crack it apart. When broken in this way, a crystal releases the stored magic inside. The magic ends at the end of your turn and is entirely sensory.",
        "A bag of the small crystals comes with {@dice 1d4+8} (10) crystals inside. Roll a number of {@dice 1d8} equal to the number of crystals in the bag and record each number rolled. Use these numbers to determine the kinds of crystals found in the bag using the table below",
        {
          "type": "table",
          "colLables": ["d8", "Color", "Releases..."],
          "colStyles": ["col-1 text-center", "col-1", "col-10"],
          "rows": [
            ["d8", "Color", "Releases..."],
            ["1", "Red", "...a plume of harmless flame 5 feet tall."],
            [
              "2",
              "Orange",
              "...a small flash of bright light in a 5 foot radius and dim light for another 5 feet, followed by the smell of spices and citrus."
            ],
            [
              "3",
              "Yellow",
              "...small spiraling motes of energy that fizz and fly about in a 5-foot radius"
            ],
            [
              "4",
              "Green",
              "...a cloud of colorful verdant smoke that fills a 5-foot sphere that smells both foul and sweet at once."
            ],
            [
              "5",
              "Blue",
              "...a series of comically large bubbles that float outward from the point of impact in a 5-foot radius."
            ],
            [
              "6",
              "White",
              "...a dazzling display of sparkling glitter in a 5-foot radius from the point of impact."
            ],
            [
              "7",
              "Purple",
              "...the sound of music. The song is random, and plays only enough to make it recognizable as music."
            ],
            [
              "8",
              "Black",
              "...a mystery effect. Roll on the table again when using this crystal to determine its effect. If you roll an 8, roll again."
            ]
          ]
        },
        "{@italic Item submitted by @Nevermore#9950.}"
      ]
    },
    {
      "name": "Catnip Amulet",
      "source": "WMUMI",
      "rarity": "Common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 1,
      "type": "HCI",
      "entries": [
        "This gold and jade amulet seems to draw domestic cats to it. While wearing the necklace, you have advantage on ability checks made to find or call Tiny domestic cats (if there are any) and on Wisdom (Animal Handling checks you make to interact with them.",
        "{@italic Item submitted by @Nevermore#9950.}"
      ]
    },
    {
      "name": "Aci Feather",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.01,
      "type": "HCI",
      "entries": [
        "While this feather is equipped on your person, you can use a bonus action to make your hair dramatically blow in a nonexistent breeze.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Doom Box",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.35,
      "type": "HCI",
      "entries": [
        "This simple wooden box, seemingly crafted with shoddy materials, creates {@dice 1d4} harmless spiders every week.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Zingaro, the 10-Copper Mug",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.5,
      "type": "HCI",
      "entries": [
        "This mug has a slot on its side, just large enough to fit a coin. Slotting in 10 copper coins will produce a mild-flavored ale or beer (accompanied by an arcade-style ding for each coin slotted in).",
        "The coins vanish upon being inserted. In addition, the nearest establishment that sells beverages of the alcoholic variety will receive the money in the till or lockbox of their business.",
        "The side of the mug has a simple logo: {@bold Zingaro}. Meanwhile, the bottom has been engraved with small, runic letters: {@italic &quot;Zingaro, the beer for your generation&quot;.}",
        "{@italic Item designed by @Mr.Philanthropic#0001.}"
      ]
    },
    {
      "name": "Doom & Gloom",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": true,
      "weight": 9,
      "type": "M",
      "weaponCategory": "exotic",
      "property": ["S", "R", "2H", "F"],
      "dmg1": "2d4",
      "dmgType": "S",
      "sword": true,
      "weapon": true,
      "entries": [
        {
          "type": "entries",
          "entries": [
            "The pole of this sickly scythe is marred with scorch marks in crass patterns. The curved blade is an immaculate onyx with a soft purple orb glowing in it's center. Small arcs of violet plasmic energy crackle around the weapon."
          ]
        },
        {
          "type": "entries",
          "entries": [
            "You gain a +2 bonus to attack and damage rolls made with this weapon. It has the following additional properties:"
          ]
        },
        {
          "type": "entries",
          "entries": [
            "{@italic {@bold Doom}}. When you roll a 20 with this weapon, the target gains one level of {@condition exhaustion}. This does not work on constructs, undead, or other creatures immune to exhaustion. This exhaustion lasts until the charges are expended, the target takes a long rest, or the target dies."
          ]
        },
        {
          "type": "entries",
          "entries": [
            "{@italic {@bold Gloom}}. This weapon gains one charge for each successful activation of Doom up to a total of 6 charges. These charges last until your next long rest."
          ]
        },
        {
          "type": "entries",
          "entries": [
            "It takes one bonus action to activate charges 1-3 and a full action to activate 4-6."
          ]
        },
        {
          "type": "entries",
          "name": "",
          "entries": [
            {
              "type": "table",
              "colLabels": ["Charges", "Effect"],
              "colStyles": ["col-2 text-center", "col-10"],
              "rows": [
                [
                  "{@bold 1 Charge}",
                  "You gain advantage on ability checks for the next minute."
                ],
                [
                  "{@bold 2 Charges}",
                  "You gain double your movement speed for the next minute."
                ],
                [
                  "{@bold 3 Charges}",
                  "You gain advantage on attack rolls and saving throws for the next minute and are concentrating on this effect."
                ],
                [
                  "{@bold 4 Charges}",
                  "You gain temporary hit points equal to half your maximum HP total."
                ],
                [
                  "{@bold 5 Charges}",
                  "You cast the haste spell targetting only your self and are concentrating on it for the next minute."
                ],
                [
                  "{@bold 6 Charges}",
                  "For the next minute, the next attack that hits instantly kills the target. This does not affect constructs, creatures without a soul,  creatures immune to exhaustion, or creatures with legendary actions. Such creatures takes an extra {@dice 6d8} necrotic damage from the hit."
                ]
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": ["{@italic Item designed by @Aizea La Win#5106.}"]
        },
        {
          "type": "entries",
          "name": "Special",
          "entries": [
            "When you make an attack against a medium or large creature, you also attack any enemies directly to its left or right. On a hit, those creatures take {@dice 1d4} slashing damage."
          ]
        }
      ]
    },
    {
      "name": "Returning Weapon",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": false,
      "type": "HCW",
      "entries": [
        "When this weapon is thrown as part of an attack, it returns to its wielder immediately after the attack.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@italic {@bold Base items}}. This item variant can be applied to the following base items:",
        {
          "type": "list",
          "items": [
            "Dagger (Returning Dagger)",
            "Dart (Returning Dart)",
            "Handaxe (Returning Handaxe)",
            "Javelin (Returning Javelin)",
            "Light Hammer (Returning Light Hammer)",
            "Spear (Returning Spear)",
            "Trident (Returning Trident)"
          ]
        }
      ]
    },
    {
      "name": "Cap of the Cartographer",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCW",
      "entries": [
        "{@italic Do you suck at reading maps? At telling which way is north, south, east, weast?! Fear no more! The Cap of the Cartographer is just what you need!}",
        "While wearing this dark blue flat cap, you can see where you are on any map you are holding that contains your current location.",
        "{@italic Item designed by @Gebri#6969.}"
      ]
    },
    {
      "name": "Doodle Ring",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "This magic wooden ring is always covered in splotches of charcoal, ink, or paint, regardless of how well or often it's cleaned. While wearing the ring on a finger, you can touch that finger to a solid surface and begin to draw. The drawing uses your finger to make marks as if it were a piece of charcoal, ink quill, or paintbrush (your choice). The marks you make can be in any color. Any drawing made by the ring can be easily smudged away without leaving any marks behind. The ring can have up to 5 square feet covered with drawings in this way at any time. Drawing more than that begins to erase the previous marks, and any mark left after 24 hours of being made is magically erased.",
        "{@italic Item submitted by Nevermore#9950.}"
      ]
    },
    {
      "name": "Candy Xorn",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "Candy xorn is a round, waxy candy that typically comes in small bags of 2d6+3 pieces. Each piece is traditionally either orange or yellow, but always has a narrow, reptilian pupil drawn at its center. Eating a candy xorn causes your eyes to turn orange or yellow (your choice), and your pupils to match the ones found on the piece of candy. After 1 minute, the effect ends and your eyes return to normal.",
        "In addition, each piece of candy xorn has a 5 percent chance to not be candy at all, but actually a gemstone covered in the sugar coating. When you find a gemstone in this way, it can be either eye agate (40%, 10gp), tiger's eye (40%, 10gp), or amber (20%, 100gp)",
        "{@italic Item submitted by Nevermore#9950.}"
      ]
    },
    {
      "name": "Hat Trick",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "This gaudy purple hat allows the wearer to perform some minor magical feats. The hat has 3 charges and regains 1 expended charge daily at dawn. While holding the hat, you can expend 1 charge as an action to cast the {@spell find familiar} spell from it, pulling the familiar from the hat. The summoned familiar must take the form of either a rabbit or a dove, using the statistics for a weasel or owl, respectively. The familiar remains for up to 1 minute instead of its normal duration and cannot be used to deliver spells.",
        "In addition, while wearing the hat,  you can use an action to cast the {@spell prestidigitation} spell from it. When cast in this way, the spell can only be used to create harmless, illusory effects.",
        "{@italic Item submitted by @Nevermore#9950.}"
      ]
    },
    {
      "name": "Returning Weapon +1",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": false,
      "type": "HCW",
      "entries": [
        "You have a +1 bonus to attack and damage rolls made with this magic weapon.",
        "When this weapon is thrown as part of an attack, it returns to its wielder immediately after the attack.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@italic {@bold Base items}}. This item variant can be applied to the following base items:",
        {
          "type": "list",
          "items": [
            "Dagger (Returning Dagger)",
            "Dart (Returning Dart)",
            "Handaxe (Returning Handaxe)",
            "Javelin (Returning Javelin)",
            "Light Hammer (Returning Light Hammer)",
            "Spear (Returning Spear)",
            "Trident (Returning Trident)"
          ]
        }
      ]
    },
    {
      "name": "Returning Weapon +2",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": false,
      "type": "HCW",
      "entries": [
        "You have a +2 bonus to attack and damage rolls made with this magic weapon.",
        "When this weapon is thrown as part of an attack, it returns to its wielder immediately after the attack.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@italic {@bold Base items}}. This item variant can be applied to the following base items:",
        {
          "type": "list",
          "items": [
            "Dagger (Returning Dagger)",
            "Dart (Returning Dart)",
            "Handaxe (Returning Handaxe)",
            "Javelin (Returning Javelin)",
            "Light Hammer (Returning Light Hammer)",
            "Spear (Returning Spear)",
            "Trident (Returning Trident)"
          ]
        }
      ]
    },
    {
      "name": "Arvhim Pear Phone",
      "baseItem": "smartphone|srp",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "{@italic Avel Caelora doesn't have phones? Not for much longer! We here at Arvhim Technology are spreading the wondrous technology the Pear Phone&trade; to the masses!}",
        "As an action, the user may dismiss or summon the Pear Phone&trade; to their hand or away into a pocket space. Upon resummoning, the user may decide to change the color of the Pear Phone&trade;.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Solar Surfer",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": true,
      "type": "HCI",
      "entries": [
        "This custom-built machine (designed to be used by Solar Sailors in the Skywatcher Grand Prix) is designed to be small enough to be carried and even used for fast transport when travelling. Their quick-activation and portability make them a smart option for those in Accord who wish to get around quickly and faster than the required effort to retrieve a crew and pilot an airship.",
        "The surfboard itself weighs 10 pounds and remains folded until the user speaks the command word, which can be customized for each solar surfer. While extended, the solar surfer requires direct sunlight to function. If achieved, it has a flying speed of 100 feet and can carry up to 400 pounds, but its flying speed becomes halved feet while carrying over 200 pounds.",
        "A pilot can angle the sail to change direction, and the surfboard hovers in the air until they choose to land. A solar surfer requires a least one free hand to pilot, although a solar surfer can remain in the air with no hands on the controls (making it possible for a pilot to use a two-handed weapon while in the air).",
        "In addition, a pilot can reflect the light of the sun through the sails at an enemy. That creature must make a DC 15 Constitution saving throw or take {@dice 3d8+1d4} radiant damage, or half as much on a successful save. A sail's delicate living-fibers can only channel the sun's radiance 5 times before needing to be repaired, which the living-fibers does at a rate of 1 charge each dawn.",
        "A pilot can attempt to fire an additional charge from their solar surfer beyond the fifth, but doing so will fry the internal components of the sail, and the solar surfer will immediately plummet to the ground, having become unusable and unrepairable.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Lightning Lashed",
      "source": "WME",
      "type": "HCW",
      "tier": "major",
      "rarity": "rare",
      "reqAttune": true,
      "entries": [
        "You can use a bonus action to speak this magic weapon's command word, causing lightning to arc over the blade or head. This lightning sheds dim light in a 10-foot radius.",
        "While the lightning persists, it deals an extra {@dice 2d6} lightning damage to any target it hits. The lightning lasts until you use a bonus action to speak the command word again or until you drop or sheathe the weapon.",
        "{@italic Item designed by @DIO#6259.}",
        "{@italic {@bold Base items}}. This item variant can be applied to the following base items:",
        {
          "type": "list",
          "items": [
            "Double-Bladed Scimitar (Lightning Lashed Double-Bladed Scimitar)",
            "Greatsword (Lightning Lashed Greatsword)",
            "Longsword (Lightning Lashed Longsword)",
            "Rapier (Lightning Lashed Rapier)",
            "Scimitar (Lightning Lashed Scimitar)",
            "Shortsword (Lightning Lashed Shortsword)"
          ]
        }
      ]
    },
    {
      "name": "Black Inches",
      "baseItem": "whip|phb",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": false,
      "type": "M",
      "entries": [
        "A long, pitch black, whip with metal tips which is said to have caused more than a few red cheeks.",
        "You have a +2 to hit and damage rolls with this magic weapon.",
        "This weapon deals an additional {@dice 1d4} piercing damage on a hit.",
        "{@bold Red Cheeks}. When you hit on an attack roll, you cause the target to Bleed if it has blood. A Bleeding creature captures your attention, giving you advantage on Wisdom (Perception) checks to track down Bleeding targets. A creature continues to Bleed until they take a short or long rest or a successful Wisdom (Medicine) check (DC 14) is made to stop the bleeding.",
        "{@bold Bloody Hell}. For every Bleeding target within 30 feet of you, you gain a stacking buff up to a max of 5.",
        "For each stack of {@italic Bloody Hell} that you have, you gain 5 walking speed when moving towards a Bleeding creature.",
        "{@bold Bloodlust}. When you hit maximum stacks of {@italic Bloody Hell}, you enter a crazed bloodlust for the next ten minutes or until every Bleeding creature dies. During this Bloodlust, you lose 2 Wisdom, but whenever you deal damage with this whip to a Bleeding target, double the weapon's damage die.",
        "{@italic Item designed by @DIO#6259.}"
      ]
    },
    {
      "name": "Quick Picks",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": "by a bard",
      "type": "HCI",
      "entries": [
        "These colorful picks attach to your fingers and allow for vibrant strumming. You can click your picks together in order to manifest a small sound that travels no further than 30 feet, so long as that sound is percussive in nature. Each pick is inscribed with a singular glyph from a runic alphabet. Translation is currently impossible—although really, nobody wants to know what they say anyway.",
        "{@bold Instantaneous Instrument}. While attuned to these picks, you can use a bonus action to manifest a stringed musical instrument in your empty hand. You choose the form that this instrument takes each time you create it.",
        "Your {@italic Instantaneous Instrument} disappears if it is more than 5 feet away from you for more than a minute. It also disappears if you use this feature again, you dismiss the instrument as a free action, or you die.",
        "You can choose to transform a stringed instrument of your choice into your {@italic Instantaneous Instrument} by performing a special ritual. The ritual is known as the &quot;Seance of Sick Guitar Riffs&quot;, and takes place over the course of one hour. After the ritual is complete, you dismiss the instrument, shunting it into an extradimensional space.",
        "Whenever you use your {@italic Instantaneous Instrument} from that point on, you summon the instrument you saved as part of your ritual. It retains the same appearance and statistics as it did when you completed the ritual. You cannot affect an artifact or a sentient instrument in this way. The instrument ceases to be your {@italic Instantaneous Instrument} if you die, perform the ritual on a different instrument, or play a sick guitar riff and say &quot;My instrument no longer&quot; in a deep voice.",
        "Regardless of how you break your bond, when it occurs, the instrument previously saved into your extradimensional space crash lands onto a nearby balcony alongside the departure of a murder of ravens.",
        "{@italic While attuned to these picks, you also gain the following benefits:}",
        "{@bold Swing String}. You gain a bonus to your Initiative equal to your Charisma modifier.",
        "{@bold Your Music Sucks Too Asshole}! When a creature that you can see within 60 feet of you makes an attack roll, ability check, or a saving throw, you can use your reaction to impose disadvantage on the roll. You can use this feature a number of times equal to your Charisma modifier (minimum of once), and regain all expended charges on a long rest. You can choose to use this feature after the creature rolls the d20, but before the DM tells you the result of the roll.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Cold Spaulder",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "This metal shoulder guard is always chilly to the touch.  While worn, willfully ignoring another humanoid's attempt to converse with you causes them to experience a sensation of chills running down their spine.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Blinkback Belt",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": true,
      "type": "HCI",
      "entries": [
        "A set of clips are attached to this segmented belt constructed of metallic links. Up to two melee weapons or up to four light melee weapons can be hung from the belt in straps or sheaths. These weapons must not have the two-handed or double-bladed property. ",
        "When the wearer draws a weapon attached to this belt and throws it before the end of their next turn, the weapon teleports back to its strap or sheath immediately after the attack is resolved. If the weapon drops to the ground or if the wearer is disarmed of their weapon, they immediately teleport back to their belt at the start of their turn. ",
        "Removing or switching weapons requires the user to end their attunement or to attune to belt once more.",
        "{@italic Item designed by @MiriamRose#2345.}"
      ]
    },
    {
      "name": "Conversing Mirrors",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "This item comes in a box-set of two near-indestructible mirrors that can withstand a direct collision with a semi. They are connected through a planar wire that spans the entire Multiverse.",
        "As an action, you can &quot;ring&quot; the other mirror, appearing as a request for communication on the adjacent mirror. Accepting the call will broadcast whatever the mirror is reflecting to the other mirror's screen, as well as voice. Either party can disconnect the mirror's connection at will, as well as turn off the reflection-sharing properties or temporarily mute the audio.",
        "These mirrors can be used to speak long distances, commune with commanding officers, or even just keep in touch with loved ones on an arduous journey. And unlike cellphones, they can be used interplanar and in areas without cellphone towers.",
        "However, due to their expensive production, quantity is rare, and the price is astronomical. Because of this, these mirrors aren't used often by the Association, militaristic organizations, or the aforementioned couple-in-love, as only nobles and wealthy Adventurers are able to afford them.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Manastone Bracelets",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "{@italic &quot;Allow me to take off my training bracelets.&quot;}",
        "{@italic &quot;This isn't even my final form!&quot;}",
        "{@italic &quot;I have trapped my power in these bracelets for thousands of years. Now, you will see my true power!&quot;}",
        "Two linked bracelets created through a divine union of manastone and witchwood. These bracelets attach to each adjacent wrist, and limit the user's power through an infraction of space-time.",
        "While wearing these bracelets, you can purposely weaken yourself to any level below your current. In order to reduce a creature's power, the creature wearing these bracelets must willingly accept their influence, making them useless as magical handcuffs.",
        "Once you willingly accept the bracelets influence and select a level to be reduced to, the bracelets lock shut around your wrists, and you must speak their command word in order to release them. Releasing the bracelets restores you to your full power. You cannot incrementally increase or decrease your power any further once you accept the bracelet's influence.",
        "You cannot use these bracelets to attend lower-tiered quests, nor can you force a creature through magic or mind control to accept their influence. These bracelets cannot be deactivated through any effects such as an antimagic field once they are bound to a creature.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Gloves of Flaming Fury",
      "source": "WME",
      "rarity": "rare",
      "reqAttune": true,
      "tier": "major",
      "type": "HCI",
      "entries": [
        "While you wear both of these leather gloves, any non-magical weapon you grasp with either glove is treated as a magic weapon.",
        "As a bonus action, you can use the gloves to cause magical flames to envelop one or two melee weapons in your grasp. Each flaming weapon deals an extra {@dice 1d6} fire damage on a hit. The flames last until you sheath or let go of either weapon. Once used, this property can't be used again until the next dawn."
      ]
    },
    {
      "name": "Lifewell Tattoo",
      "source": "WME",
      "rarity": "rare",
      "reqAttune": true,
      "type": "HCI",
      "tier": "major",
      "tattoo": true,
      "entries": [
        "This tattoo comprises symbols of life and rebirth. While this tattoo is on your skin, you have resistance to necrotic damage.",
        {
          "type": "entries",
          "name": "Death Ward",
          "entries": [
            "When you would be reduced to 0 hit points, you drop to 1 hit point instead. Once used, this benefit can't be used again until the next dawn."
          ]
        },
        {
          "type": "entries",
          "name": "Tattoo Attunement",
          "entries": [
            "To attune to this item, you hold the needle to your skin where you want the tattoo to appear, pressing the needle there throughout the attunement process. When the attunement is complete, the needle turns into the ink that becomes the tattoo, which appears on the skin.",
            "If your attunement to the tattoo ends, the tattoo vanishes, and the needle reappears in the closest unoccupied space to you."
          ]
        }
      ]
    },
    {
      "name": "Weapon of Resurgence",
      "source": "WME",
      "type": "HCW",
      "tier": "major",
      "rarity": "rare",
      "reqAttune": "by a paladin",
      "entries": [
        "This weapon emanates a soft green aura while in the hands of a paladin and grants a +1 to attack and damage rolls.",
        "If you hit a creature while attuned to this weapon, you regain one point of your lay on hands. You can only gain this benefit once per turn.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@italic {@bold Base items}}. This item variant can be applied to the following base items:",
        {
          "type": "list",
          "items": [
            "Double-Bladed Scimitar (Double-Bladed Scimitar of Resurgence)",
            "Greatsword (Greatsword of Resurgence)",
            "Longsword (Longsword of Resurgence)",
            "Rapier (Rapier of Resurgence)",
            "Scimitar (Scimitar of Resurgence)",
            "Shortsword (Shortsword of Resurgence)"
          ]
        }
      ]
    },
    {
      "name": "Dress of Many Pockets",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.05,
      "type": "HCI",
      "entries": [
        "This dress has many pockets. When someone compliments this dress, you can use your reaction to reply with &quot;Thanks! It has pockets!&quot; When you do, you can stick your hand into any pocket of the dress and pull out any mundane, non-magical, and non-consumable item of your choice. You can only pull out an item once per day per person that compliments the dress. Items pulled out from the dress disappear after 10 minutes.",
        "{@italic &quot;Nice dress, lil' missy,&quot; the old grizzled dwarf captain said, nodding to the halfling girl in a vibrant yellow sundress.}",
        "{@italic &quot;Thanks! It has pockets!&quot; replied the little halfling girl, perhaps a bit too enthusiastically, as she pulls out a greataxe from her dress to demonstrate.}",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Circlet of Mispronounciation",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.02,
      "type": "HCI",
      "entries": [
        "While wearing this circlet, despite their best attempts, creatures in your vicinity will incessantly mispronounce your name. The mispronunciations will generally rhyme with your name, with each's phonetic spelling only being slightly different",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Whistle of Duck Calling",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.01,
      "type": "HCI",
      "entries": [
        "When you blow this whistle, a duck appears behind you. Once you blown on it, you must wait 5 minutes before using it again. Once used, any previous ducks summoned by this whistle disappears, and is replaced by the new duck.",
        "{@italic Item designed by @Mr.Philanthropic#0001.}"
      ]
    },
    {
      "name": "Wand of Magic Chickens",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": false,
      "weight": 1,
      "type": "HCI",
      "entries": [
        "This wand has 7 charges. While holding it, you can use an action to expend 1 or more of its charges to cast the magic missile spell from it. For 1 charge, you cast the 1st-level version of the spell. You can increase the spell slot level by one for each additional charge you expend.",
        "Whenever this wand is used, the caster most roll a Wisdom saving throw (DC 10). On a failed save, the caster must shout &quot;BACAWK!&quot; at the top of their lungs and squawk like a chicken. This effect lasts for only a few seconds, and the caster is aware of their actions the entire time.",
        "The wand regains {@dice 1d6+1} expended charges daily at dawn. If you expend the wand's last charge, roll a {@dice d20}. On a 1, the wand crumbles into ashes and is destroyed.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Cloak of Cherry Blossoms",
      "source": "WME",
      "rarity": "common",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.01,
      "type": "HCI",
      "entries": [
        "While wearing this cloak, you can use a bonus action to cause a small storm of harmless cherry blossoms to flutter around you.",
        "{@italic Item designed by @DIO#6259.}"
      ]
    },
    {
      "name": "Cosmic Car Keys",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "A set of car keys on a silver ring, with a little black box with a small red button on it.",
        "These car keys can be paired with any technological vehicle after a ten minute linking process. Afterwards, the vehicle in question is shunted into its own personal pocket dimension. The car keys can only be linked to one vehicle at a time and, as such, this pocket dimension can hold one vehicle as well.",
        "As a bonus action, you can press the button on the car keys, opening a portal to the pocket dimension and dispensing the linked vehicle within five feet of the user. Pressing the button again will shunt the vehicle back into the pocket dimension, immediately expelling any creatures inside or on the vehicle.",
        "{@italic Item designed by @DIO#6259.}"
      ]
    },
    {
      "name": "Ghost Captain's Coat",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": true,
      "type": "HCI",
      "entries": [
        "This coat is nice and crisp. Black leather runs down the entire frame of your body, like a trenchcoat, and your fancy pauldrons are made fancy with the thin tuffs of fur protruding from their edges. It truly makes you look the part of a captain.",
        "While attuned to this coat, you gain proficiency with vehicles (water) if you do not already have it.",
        "This coat has 3 charges. Once per day, you can cast the {@spell suggestion} spell (save DC 15) from it by expending 1 charge. You regain all expended charges each dawn.",
        "In addition, the ghostly-fabric of the coat's make allows you to temporarily transcend boundaries. You can move through other creatures and objects other than physical barriers (such as walls, floors, or ceilings) as if they were difficult terrain. On your turn, you can pass through up to 10 feet of physical barriers (treating them as difficult terrain) as a part of your movement. If you end your turn inside an object or barrier, you take {@dice 1d10} force damage and are immediately ejected to the closest available space.",
        "Once you move through a creature or object this way, you cannot do so again until next dawn.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Rod of Big Spheres",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "This rod has 3 charges. While holding the rod, you can use an action to expend one of the rod's charges and create a sphere of force that hovers 3 feet off the ground.",
        "This sphere can hold up to 200 pounds, and follow you around at a distance you determine for up to 2 hours. The sphere is destroyed if it takes any damage, but any objects inside float to the ground as if affected by the 𝘧𝘦𝘢𝘵𝘩𝘦𝘳 𝘧𝘢𝘭𝘭 spell.",
        "You can create up to 3 spheres per day, and the rod regains 3 charges daily at dawn.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Staff of the Geomancer",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": "by a bard, cleric, druid, sorcerer, or wizard",
      "type": "HCI",
      "entries": [
        "This staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability modifier: {@spell stone shape} (1 charge), {@spell meld into stone} (2 charges), {@spell move earth} (4 charges), or {@spell wall of stone} (4 charges).",
        "The staff regains {@dice 1d6 + 4} expended charges daily at dawn. If you expend the last charge, roll a {@dice d20}. On a 1, the staff blackens, crumbles into cinders, and is destroyed.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Emblem of 1,000 Arms",
      "source": "WME",
      "rarity": "rare",
      "tier": "minor",
      "reqAttune": "by a monk",
      "type": "HCI",
      "entries": [
        "This emblem attaches to a piece of clothing or armor via a pin on the backside. The emblem itself shows a golden fist in flight, multiplying to infinity as its afterimages clash alongside it. The backing is made of high-quality silver and steel.",
        "While you are attuned to this emblem, whenever you use your Flurry of Blows feature, you can spend 2 ki points to make two additional unarmed strikes. You can only gain this effect once per turn.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Brute's Tattoo",
      "source": "WME",
      "rarity": "rare",
      "tier": "minor",
      "reqAttune": "by a rogue",
      "type": "HCI",
      "tattoo": true,
      "entries": [
        "This tattoo incorporates a light of a dagger in flight. Its swipe is detailed using arcs of ink, which effortlessly slot into larger designs like it was meant to be there.",
        {
          "type": "entries",
          "name": "Rougish Vitality",
          "entries": [
            "After you use a bonus action granted by your Cunning Action feature, you gain a number of temporary hit points equal to 1 + your Constitution modifier. These temporary hit points last for one minute. In addition, if you use your bonus action to {@action Dash} using your Cunning Action feature and step within reach of a hostile creature, you can make a single attack as a free action. You can only use the second effect of Rougish Vitality once per turn."
          ]
        },
        {
          "type": "entries",
          "name": "Tattoo Attunement",
          "entries": [
            "To attune to this item, you hold the needle to your skin where you want the tattoo to appear, pressing the needle there throughout the attunement process. When the attunement is complete, the needle turns into the ink that becomes the tattoo, which appears on the skin.",
            "If your attunement to the tattoo ends, the tattoo vanishes, and the needle reappears in the closest unoccupied space to you."
          ]
        },
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Gloves of the Viper",
      "source": "WME",
      "rarity": "rare",
      "tier": "minor",
      "reqAttune": "by a fighter",
      "type": "HCI",
      "entries": [
        "These gloves slide over your hands like a thin veil of silk, although they feel coarse and rough. Black in color with spots of green, they make an interesting fashion statement. Thankfully though, fashion isn't the primary reason for donning these gloves.",
        "After you regain hit points using your Second Wind feature, the next ranged or melee weapon attack you successfully hit with this turn deals an additional {@dice 1d10} + half your Fighter level poison damage.",
        "In addition, a creature hit by the attack must make a Constitution saving throw with a DC equal to 8 + your proficiency bonus + your Strength or Dexterity modifier. On a failed save, that creature is poisoned until the end of their next turn.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Wand of Sudden Transposition",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": "by a spellcaster",
      "type": "HCI",
      "entries": [
        "This wand has 7 charges. While holding it, you can use an action to expend 1 charge and suddenly transpose two creatures of your choice.",
        "Choose two Small or Medium creatures that you can see within 120 feet. The creatures you select must either standing on the same surface or standing on surfaces which are physically connected by solid ground or structures.",
        "A creature which is unwilling to be transposed must make a Charisma saving throw equal to your spell save DC. If neither creature makes a successful saving throw, both creatures are teleported, with each reappearing in the space previously occupied by the other.",
        "This wand requires a verbal component to activate.",
        "The wand regains {@dice 1d6 + 1} expended charges daily at dawn. If you expend the wand's last charge, roll a {@dice d20}. On a 1, the wand crumbles into ashes and is destroyed.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Magnetic Weapon Holder Strips",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "These small yet powerful magnets are placed on the legs, waist, or back, and are used to hold any equipment with a magnetic property (i.e., metallic objects). Typically, these strips mainly used to holster weapons when not in use, and can be integrated in armor. However, it has been adapted to also be worn without armor using straps. These magnetic strips allows the user to carry weapons with ease up to a maximum of four (up to two weapons with the heavy property). However, this system does not alleviate weight.",
        "While wearing this system, the user can switch between one holstered weapon to another as a single item interaction.",
        "{@bold Technological.} As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle.",
        "{@italic Item designed by @MiriamRose#2345.}"
      ]
    },
    {
      "name": "Handkerchief of Length",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "This item appears to be a normal silk handkerchief. However, when you place it in your pocket and speak the command word, you can then pull from your pocket a 50-foot long line of multi-colored handkerchiefs tied to each other. This functions exactly like a regular piece of rope.",
        "When you stuff the handkerchiefs back in your pocket, they revert to the original handkerchief.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Through the Fire and the Flames",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": true,
      "baseItem": "gauntlet|srp",
      "type": "HCW",
      "entries": [
        "These pair of gauntlets are shaped in the likeness of a dragon's mouth. You can cast the spell {@spell burning hands} once from each fist, for a total of two times, with a DC of 13. Once you use each fist this way, you cannot do so again until next dawn.",
        "In addition, you gain a +1 bonus to attack and damage rolls using unarmed strikes with this weapon.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Elemental Fang, Fire",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "baseItem": "lance|phb",
      "reqAttune": true,
      "type": "HCW",
      "entries": [
        "You gain a +1 to attack and damage rolls with this item.",
        "You can cast the {@spell scorching ray} spell from the lance (+5 attack bonus). This spell cannot be cast again from the lance again until next dawn.",
        "Additionally, you can empower one of your strikes with elemental energy, increasing its strength by {@dice 1d10} fire damage. You must move 20 feet in a straight line and declare this effect before the attack is made. Using this effect expends a charge, of which you have 3. You regain all expended charges each dawn.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Elemental Fang, Cold",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "baseItem": "lance|phb",
      "reqAttune": true,
      "type": "HCW",
      "entries": [
        "You gain a +1 to attack and damage rolls with this item.",
        "You can cast the {@spell snilloc's snowball swarm} spell from the lance (DC 13). This spell cannot be cast again from the lance again until next dawn.",
        "Additionally, you can empower one of your strikes with elemental energy, increasing its strength by {@dice 1d10} cold damage. You must move 20 feet in a straight line and declare this effect before the attack is made. Using this effect expends a charge, of which you have 3. You regain all expended charges each dawn.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Elemental Fang, Acid",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "baseItem": "lance|phb",
      "reqAttune": true,
      "type": "HCW",
      "entries": [
        "You gain a +1 to attack and damage rolls with this item.",
        "You can cast the {@spell melf's acid arrow} spell from the lance (+5 attack bonus). This spell cannot be cast again from the lance again until next dawn.",
        "Additionally, you can empower one of your strikes with elemental energy, increasing its strength by {@dice 1d10} acid damage. You must move 20 feet in a straight line and declare this effect before the attack is made. Using this effect expends a charge, of which you have 3. You regain all expended charges each dawn.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Elemental Fang, Lightning",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "baseItem": "lance|phb",
      "reqAttune": true,
      "type": "HCW",
      "entries": [
        "You gain a +1 to attack and damage rolls with this item.",
        "You can cast the {@spell shatter} spell from the lance (DC 13). This spell cannot be cast again from the lance again until next dawn.",
        "Additionally, you can empower one of your strikes with elemental energy, increasing its strength by {@dice 1d10} lightning damage. You must move 20 feet in a straight line and declare this effect before the attack is made. Using this effect expends a charge, of which you have 3. You regain all expended charges each dawn.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Stormcaller",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "baseItem": "longbow|phb",
      "reqAttune": true,
      "type": "HCW",
      "entries": [
        "You gain a +2 bonus to attack and damage rolls made with this magic weapon.",
        "You can speak the command word of this bow as a bonus action. After doing so, for the next minute, the bow and all ammunition fired from it are charged with magical lightning.",
        "While Stormcaller is charged, you can point a finger to the sky and shout, &quot;Strike!&quot; as a bonus action to cause lightning bolts to strike down at any piece of charged ammunition.",
        "All creatures sharing the same space as a piece of charged ammunition in the ground must make a Dexterity saving throw (DC: 8 + your proficiency bonus + your Charisma modifier) or take {@dice 1d10} lightning damage (or half as much on a successful save). Any creature with a piece of charged ammunition lodged in its body or armor automatically fail this saving throw.",
        "Once a piece of charged ammunition is struck by lightning, it loses its charge. You can’t use this property again until you finish a long rest.",
        "{@italic Item designed by @Aizea La Win#5106.}"
      ]
    },
    {
      "name": "Sigil of the Claw +1",
      "source": "WMHBI",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": false,
      "type": "OTH",
      "wondrous": true,
      "entries": [
        "While wearing this sigil, you gain a +1 bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. Such attacks are considered to be magical."
      ]
    },
    {
      "name": "Sigil of the Claw +2",
      "source": "WMHBI",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": false,
      "type": "OTH",
      "wondrous": true,
      "entries": [
        "While wearing this sigil, you gain a +2 bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. Such attacks are considered to be magical. It does not provide this bonus when wielding unarmed weapons."
      ]
    },
    {
      "name": "Sigil of the Claw +3",
      "source": "WMHBI",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": false,
      "type": "OTH",
      "wondrous": true,
      "entries": [
        "While wearing this sigil, you gain a +3 bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. Such attacks are considered to be magical. It does not provide this bonus when wielding unarmed weapons."
      ]
    },
    {
      "name": "Bracer of Flying Daggers",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "weight": 0.2,
      "reqAttune": true,
      "type": "HCI",
      "entries": [
        "This armband appears to have thin {@item dagger|phb|daggers} strapped to it. As an action, you can pull up to two magic daggers from the bracer and immediately hurl them, making a ranged attack with each dagger. A dagger vanishes if you don't hurl it right away, and the daggers disappear right after they hit or miss. The bracer never runs out of daggers.",
        "As a bonus action, the thrower can call back two of the illusory daggers, forcing all creatures in a line from where the daggers were launched to make a Dexterity saving throw (DC 8 + your proficiency bonus + your Dexterity modifier). On a failed save, those creatures take {@dice 2d4} piercing damage.",
        "Additionally, the user can slot one dagger into the bracer as an item interaction. Doing this causes all future thrown daggers take on the attributes of the slotted dagger. You can only slot one dagger in these bracers at a time.",
        "{@italic Item edited by @Aizea La Win#5106 and @Amarulence#5357.}"
      ]
    },
	{
      "name": "+1 Shield",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "weight": 6,
	  "ac": 2,
	  "bonusAc": "+1",
      "type": "S",
      "entries": [
		"While holding this shield, you have a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC.",
        "A shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time."
      ]
    },
    {
      "name": "Bag of Bounty",
      "source": "WME",
      "rarity": "uncommon",
      "type": "HCI",
      "entries": [
        "This is a sturdy leather sack with tiny Siberys shards embedded into the lining. You can use an action to cast create food and water, drawing a feast from within the bag. You shape this meal with your thoughts. You can create the standard bland fare without requiring any sort of check, but you can attempt to create finer food by making a Charisma check; if you're proficient with cook's utensils, add your bonus to this check. A failed check results in a sour and squalid meal.",
        {
          "type": "table",
          "colLabels": ["Food Quality", "Difficulty"],
          "colStyles": ["col-6", "col-6"],
          "rows": [
            ["Poor", "No roll required"],
            ["Modest", 10],
            ["Comfortable", 13],
            ["Wealthy", 15],
            ["Aristocratic", 18]
          ]
        },
        "A bag of bounty can be used up to three times over the course of a day. After that, the bag can't be used again until the next dawn.",
        "{@italic Item suggested by @Ｂ Ａ Ｄ Ｃ Ｉ Ｖ Ｉ Ｌ Ｉ Ｚ Ａ Ｔ Ｉ Ｏ Ｎ#5740.}"
      ]
    },
    {
      "name": "Pen-Accelerator Mk. V",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": true,
      "type": "HCI",
      "entries": [
        {
          "type": "entries",
          "entries": [
            "These five orbital nanolasers revolve in an arc around your back—the set of oscillating crystals at their cores reflecting light back in a sheen of colors representative of their elemental properties. A small computer attaches to your waist underneath your clothes, hooked up to wires connected to sensing pads on your body which can translate the firing of synapses in your mind."
          ]
        },
        {
          "type": "entries",
          "entries": [
            "As a bonus action on your turn, you can fire one of the five lasers at an ally or hostile creature. Each laser has a range of 90 feet, and an attack roll equal to your proficiency bonus + your Intelligence modifier (if required)."
          ]
        },
        {
          "type": "entries",
          "name": "",
          "entries": [
            {
              "type": "table",
              "colLabels": ["Crystal", "Effect"],
              "colStyles": ["col-2 text-center", "col-10"],
              "rows": [
                ["{@bold Blue}", "On a hit, deals {@dice 1d4+2} cold damage."],
                [
                  "{@bold Purple}",
                  "On a hit, deals {@dice 1d4+2} lightning damage."
                ],
                ["{@bold Red}", "On a hit, deals {@dice 1d4+2} fire damage."],
                [
                  "{@bold Yellow}",
                  "Gives a creature {@dice 1d4+2} temporary hit points."
                ],
                [
                  "{@bold Green}",
                  "Heals a creature for {@dice 1d4} hit points."
                ]
              ]
            }
          ]
        },
        "Your Pen-Accelerator has 10 charges, and firing any laser expends one charge. You regain all expended charges on a long rest.",
        "{@italic Item designed by @Amarulence#5357.}",
        "{@bold Technological.} As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
      ]
    },
    {
      "name": "Tri-Accelerator Mk. III",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": true,
      "type": "HCI",
      "entries": [
        {
          "type": "entries",
          "entries": [
            "These three orbital nanolasers revolve in an arc around your back—the set of oscillating crystals at their cores reflecting light back as shimmering daylight. A small computer attaches to your waist underneath your clothes, hooked up to wires connected to sensing pads on your body which can translate the firing of synapses in your mind."
          ]
        },
        {
          "type": "entries",
          "entries": [
            "As a bonus action on your turn, you can expend up to 3 charges to induce an effect based on how many charges you expend."
          ]
        },
        {
          "type": "entries",
          "name": "",
          "entries": [
            {
              "type": "table",
              "colLabels": ["Charges Expended", "Effect"],
              "colStyles": ["col-2 text-center", "col-10"],
              "rows": [
                [
                  "{@bold 1 Charge}",
                  "Your movement speed increases by 20 for 3 turns."
                ],
                [
                  "{@bold 2 Charges}",
                  "Your movement speed increases by 40 for 2 turns."
                ],
                [
                  "{@bold 3 Charges}",
                  "Your movement speed increases by 80 for 1 turn."
                ]
              ]
            }
          ]
        },
        "This bonus movement speed applies {@italic after} any other effects that would modify your movement speed, including the Dash action. The Tri-Accelerator has 3 charges, and regains all expended charges on a long rest.",
        "{@italic Item designed by @Amarulence#5357.}",
        "{@bold Technological.} As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
      ]
    },
    {
      "name": "Hadar's Abominable Elixir",
      "source": "WME",
      "rarity": "very rare",
      "tier": "major",
      "reqAttune": false,
      "type": "HCI",
      "entries": [
        "Upon consuming this crystal-infused black elixir, your arms begin to bulge and pulsate, transforming into long, slimy tentacles.",
        "You attack with your tentacles in place of your normal unarmed strikes, which deal {@dice 2d6} acid damage on a hit. In addition, your unarmed strikes gain a reach of 10 feet.",
        "While under the effects of this elixir, you lose the ability to perform dexterous tasks, such as wielding weapons, carrying shields for defense, or performing careful procedures such as surgery. You are not considered unarmed or wielding monk weapons for the purposes of the monk's Martial Arts feature.",
        "This effects of this elixir last for one hour. At the conclusion of the hour, roll a {@dice d20}. On a roll of 1, the effects become permanent.",
        "{@italic Item designed by @Amarulence#5357.}"
      ]
    },
    {
      "name": "Strom Headphones",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "major",
      "reqAttune": false,
      "weight": 10,
      "type": "HCI",
      "entries": [
        "These, as the young kids call it, hip headphones are some of the most mainstream and popular brand around. They are a sleek black and come in over the ear and bud form. The younger generation of Zyratix considers these a must have when listening to music. ",
        "While wearing both halves of the headphones you are under the {@condition deafened} condition and listen to some cool jams. While deafened by these headphones you are immune to charm effects that require you to hear. You are still able to wear one and not be deafened.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@bold Technological}. As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
      ]
    },
    {
      "name": "Nairek Boombox Mk. II",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "weight": 3,
      "type": "HCI",
      "entries": [
        "This large contraption has a variety of knobs, dials, and sliders, with a certain instrument designed onto the back. It is often compared to it's smaller alternative, the remixer.",
        "While holding this device, a creature can use its action to have Nayrek Remixer start listening. If anything within 30 feet of the device is performing with sound, whether using an instrument, singing, or something else, the ring can store the sounds of it provided it listens for at least five minutes. The Nayrek Remixer can hold up to 100 different &quot;songs&quot; on it.",
        "As an item interaction the user may have a song playback. This music can be heard up to 100 feet away but can also be channeled through a pair of headphones and privately listened.",
        "The user may also spend an additional item interaction to crank up the volume to max. While at max volume the distance the device can be heard extends 100 feet and any creature that can hear within 30 feet of the boombox makes concentration checks at disadvantage.",
        "If in Zyratix, the user may upload songs from a central database rather than record them live.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@bold Technological}. As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
      ]
    },
    {
      "name": "Nairek Remixer",
      "source": "WME",
      "rarity": "uncommon",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.1,
      "type": "HCI",
      "entries": [
        "This simple metal box is about the size of a match lighter with a small display on its face, with a certain instrument designed onto the back. Often an item used by younger audiences to listen to music,",
        "While holding this device, a creature can use its action to have Nayrek Remixer start listening. If anything within 30 feet of the device is performing with sound, whether using an instrument, singing, or something else, the ring can store the sounds of it provided it listens for at least five minutes. The Nayrek Remixer can hold up to 60 different &quot;songs&quot; on it.",
        "As an item interaction the user may have a song playback. This music can be heard up to 60 feet away but can also be channeled through a pair of headphones and privately listened. ",
        "If in Zyratix, the user may upload songs from a central database rather than record them live.",
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@bold Technological}. As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
      ]
    },
    {
      "name": "Akalizer Baton",
      "source": "WME",
      "rarity": "rare",
      "tier": "major",
      "reqAttune": false,
      "weight": 0.2,
      "type": "HCI",
      "entries": [
        "This fluorescent baton has an accented glow of a variety of colors ranging from blue, orange, purple, green, and white. It is one foot long but extends to roughly 3 feet.",
        "While holding this baton the user may spend an action extending and constructing a motorcycle from the device. This has the normal statistics of a motorcycle with these adjustments:",
        {
          "type": "list",
          "items": [
            "It has an AC of 17.",
            "It has a damage threshold of 10.",
            "It sheds bright light out 15-feet."
          ]
        },
        "{@italic Item designed by @Aizea La Win#5106.}",
        "{@bold Technological}. As a pure technological item, nothing as to how this item functions is a result of magic, and as such, it is unaffected by spells such as dispel magic and antimagic circle."
      ]
    },
    {
      "name": "Kindermore's Tincture of Disfigurement",
      "source": "WME",
      "rarity": "rare",
      "tier": "minor",
      "reqAttune": false,
      "weight": 0.5,
      "type": "HCI",
      "entries": [
        "This vial of thick liquid of swirling greens and pinks holds one use of Kindermore's Tincture of Disfigurement. If applied to an area of the body, the tincture causes severe and painful acid burns that last for {@dice 1d4} hours. After 1 minute of severe pain, the wound begins to heal and the pain subsides. A disfigured skin scarification is in place of the skin that the tincture was applied to. The scars fully heal after {@dice 1d4} hours and the creature's appearance is returned to normal.",
        "The tincture causes the target to take {@dice 3d8} acid damage. It's hit point maximum is also reduced by an amount equal to the damage taken. The effect cannot cause the target's Max HP to drop to 0. If it would drop to 0, the target instead is reduced to a Max HP of 1, falls unconscious, and must begin making death saving throws.  At the end of the duration, the effects on Max HP is removed and the target regains the lost HP.",
        "The healing effect at the end of the duration does not occur if the creature dies. The healing effect of the tincture has no effect on constructs, undead, or inanimate objects.",
        "The acid can be applied to the face in an attempt to disguise a creatures identity. A successful DC20 Intelligence check  is necessary to discern the true identity. The effect does not end for the entire duration except by a {@spell Regenerate} Spell or {@spell Wish}.",
        "{@italic Item designed by Aizea La Win#5106.}"
      ]
    }
  ]
}
