{
	"_meta": {
		"sources": [
			{
				"json": "Demihuman",
				"abbreviation": "WMR",
				"full": "Demihuman",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/"
			}
		],
		"dateAdded": 1586943396,
		"dateLastModified": 1586943396
	},
	"race": [
		{
			"name": "Demihuman",
			"source": "Demihuman",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"count": 1
					}
				}
			],
			"traitTags": [],
			"languageProficiencies": [
				{
					"common": true,
					"beastspeech": true
				}
			],
		"entries": [
		{
			"type": "entries",
			"name": "Age",
			"entries": [
				"Demihumans reach adulthood in their late teens and live less than a century."
			]
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Demiumans tend toward no particular alignment. The best and the worst are found among them."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Demihumans vary widely in height and build, from barely 4 feet to well over 7 feet tall. Regardless of your position in that range, your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demihuman could speak with sheep."
			]
		},
		{
			"type": "entries",
			"name": "Birth From Creation",
			"entries": [
				"All Demihumans are radically different from one another, depending on the changes than manifested within them from birth. You can select one bestial enhancement now, a second bestial enhancement at 5th level, and a third bestial enhancement at 9th level.",
				"At 1st level, choose one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Born From Waves",
							"entry": "You can breathe air and water, and you have a swimming speed equal to your walking speed."
						},
						{
							"type": "item",
							"name": "Adept Climber",
							"entry": "You have a climbing speed equal to your walking speed."
						},
						{
							"type": "item",
							"name": "Darkvision",
							"entry": "Accustomed to life underground or the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
						}
					]
				},
				"At 5th level, your body evolves further, developing new characteristics. Choose one of the options you didn't take at 1st level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Natural Armor",
							"entry": "When you aren’t wearing armor, your AC equals 12 + your Constitution or Dexterity modifier (your choice)."
						},
						{
							"type": "item",
							"name": "Echolocation",
							"entry": "As a bonus action on your turn you can emit a shriek inaudible to creatures without this trait. Until the end of your next turn you have blindsight up to 30 feet away while you are not deafened. You have a number of uses equal to your proficiency bonus, and you regain all uses of it when you finish a short or long rest. "
						},
						{
							"type": "item",
							"name": "Chameleon",
							"entry": "You have advantage on Dexterity (Stealth) checks if you have not used your movement during the current turn. In addition, you can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
						}
					]
				},
				"At 9th level, your body has reached the pinnacle of its evolution, developing a final characteristic. Choose one of the options you didn't take at 1st or 5th level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Attuned Flight",
							"entry": "You have a flying speed of 30 feet. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item."
						},
						{
							"type": "item",
							"name": "Relentless",
							"entry": "When you are left with 0 hit points but not killed outright, you can use a reaction to be left with 1 hit point instead. Once you use this ability, you cannot use it again until you finish a long rest."
						},
						{
							"type": "item",
							"name": "Grappling Appendages",
							"entry": "You have two special appendages growing alongside your arms. As an action, you can use one of them to try to grapple a creature. Each one is also a natural weapon, which you can use to make an unarmed strike. If you hit with it, the target takes bludgeoning damage equal to {@dice 1d6} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. Immediately after hitting, you can try to grapple the target as a bonus action. These appendages can't precisely manipulate anything and can't wield weapons, magic items, or other specialized equipment."
						}
					]
				}
			]
		}
	]
}
]
}