{
	"_meta": {
		"sources": [
			{
				"json": "WMDSS",
				"abbreviation": "WMDSS",
				"full": "Desert Soul Sorcerer",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"name": "Desert Soul Sorcerer",
			"source": "WMDSS",
			"page": 1,
			"shortName": "Desert Soul",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassFeatures": [
				"Desert Soul|Sorcerer||Desert Soul|WMDSS|1",
				"Mirage|Sorcerer||Desert Soul|WMDSS|6",
				"Desert Nomad|Sorcerer||Desert Soul|WMDSS|14",
				"Sand Form|Sorcerer||Desert Soul|WMDSS|18"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Desert Soul",
			"source": "WMDSS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDSS",
			"subclassShortName": "Desert Soul",
			"page": 1,
			"level": 1,
			"entries": [
				"Some mages draw on their their magic like a fountain from within. This wellspring of power can come from a unique origin, mysterious birthright, or simple chance of fate. Whatever your story may be, you are steeped in magic, and it is yours to control.",
				"Your power comes from the relentless and punishing magic that lies at the heart of the world’s most unforgiving deserts. Most sorcerers with this power were born to nomads or traveling pilgrims in the H’rethi desert, but perhaps yours came to you in the chaos of a raging sandstorm or the springs of a magical oasis. Regardless of its origin, this blistering magic spirals around inside of you in an ever-present storm that can reduce even the sturdiest enemies to rubble.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Dune Treader|Sorcerer||Desert Soul|WMDSS|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Sandstorm|Sorcerer||Desert Soul|WMDSS|1"
				}
			]
		},
		{
			"name": "Dune Treader",
			"source": "WMDSS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDSS",
			"subclassShortName": "Desert Soul",
			"page": 1,
			"level": 1,
			"header": 1,
			"entries": [
				"Starting when you choose this origin at 1st level, you ignore difficult terrain created by sand, and you can tolerate temperatures as high as 150 degrees Fahrenheit without any additional protection."
			]
		},
		{
			"name": "Sandstorm",
			"source": "WMDSS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDSS",
			"subclassShortName": "Desert Soul",
			"page": 1,
			"level": 1,
			"header": 1,
			"entries": [
				"Starting at 1st level, you can cause the magical sandstorm within you to manifest as a nearby twister. When you cast a spell of 1st level or higher on your turn, you can use a bonus action to create this storm in a 5-foot cube in a space you can see within 30 feet of you. Any Medium or smaller creature in the area must succeed on a Strength saving throw against your sorcerer spell save DC or be pushed up to 10 feet in a direction of your choice.",
				"When you reach 6th level in this class, a creature that fails this saving throw also takes either {@dice 1d8} bludgeoning damage or {@dice 1d8} fire damage (your choice). The damage increases when you reach certain levels in this class, increasing to {@dice 2d8} at 14th level, and {@dice 3d8} at 18th level."
			]
		},
		{
			"name": "Mirage",
			"source": "WMDSS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDSS",
			"subclassShortName": "Desert Soul",
			"page": 1,
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, you gain resistance to fire damage. In addition, you learn the mirror image spell. If you already know this spell, you learn a different sorcerer spell of your choice. The spell doesn’t count against your number of spells known. You can cast it by spending 2 sorcery points or by expending a spell slot. If you cast it with sorcery points, any creature within 10 feet of you that destroys one of the spell’s illusions takes fire damage equal to half your sorcerer level, as the illusion bursts into a wave of scalding air and sand."
			]
		},
		{
			"name": "Desert Nomad",
			"source": "WMDSS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDSS",
			"subclassShortName": "Desert Soul",
			"page": 2,
			"level": 14,
			"header": 2,
			"entries": [
				"Beginning at 14th level, you have the ability to step into the heart of the twisters you create. Immediately after a creature is pushed by your Sandstorm feature, you can spend 1 sorcery point to teleport to the storm’s space. You can also teleport in this way if you create the storm in a space that is unoccupied. When you teleport in this way, you and any equipment you are wearing or carrying are invisible until the end of your turn."
			]
		},
		{
			"name": "Sand Form",
			"source": "WMDSS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDSS",
			"subclassShortName": "Desert Soul",
			"page": 2,
			"level": 18,
			"header": 2,
			"entries": [
				"At 18th level, you can become as intangible as sand. You can spend 5 sorcery points as a bonus action to magically transform yourself into a sand-like form. In this form, you have the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on Strength (Athletics) and Dexterity (Acrobatics) checks you make to escape a grapple.",
						"You and any equipment you are wearing or carrying can move through a space as narrow as 1 inch without squeezing.",
						"You can move through the space of any creature, regardless of its size, and difficult terrain doesn’t cost you extra  movement."
					]
				},
				"In addition, when an attacker that you can see hits you with an attack, you can use your reaction to turn to sand. Until the end of that turn, you have resistance to all damage, including against the triggering attack.",
				"You remain in this form for 1 minute. It ends early if you are incapacitated, if you die, or if you dismiss it as a bonus action."
			]
		}
	]
}