{
	"_meta": {
		"sources": [
			{
				"json": "WMDSM",
				"abbreviation": "WMDSM",
				"full": "Way of the Divine Stance",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"name": "Way of the Divine Stance",
			"source": "WMDSM",
			"className": "Monk",
			"classSource": "PHB",
			"shortName": "Divine Stance",
			"subclassFeatures": [
				"Way of the Divine Stances|Monk||Divine Stance|WMDSM|3",
				"Earthly Divine Stances|Monk||Divine Stance|WMDSM|3",
				"Tatakai|Monk||Divine Stance|WMDSM|6",
				"Tengoku|Monk||Divine Stance|WMDSM|11",
				"The Divine|Monk||Divine Stance|WMDSM|17"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Way of the Divine Stances",
			"source": "WMDSM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Divine Stance",
			"subclassSource": "WMDSM",
			"level": 3,
			"entries": [
				"The Way of the Divine Stances teaches those who wish to follow footsteps and forms that flow like water, in a dance with life itself as they push and pull on their own ki and the flow of energy of the world around them to better themselves. Some say that this is simply a method of self realization and betterment while others believe it is a way to forge yourself anew; becoming as close to Divine as possible."
			]
		},
		{
			"name": "Earthly Divine Stances",
			"source": "WMDSM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Divine Stance",
			"subclassSource": "WMDSM",
			"level": 3,
			"header": 1,
			"entries": [
				"At 3rd level, you gain access to the Earthly Divine Stances: The Stance of Peace, Wrath, and Majesty. As a bonus action, you can spend 1 ki point and enter one of these stances at the end of your turn. Each stance lasts for a minute, until you are incapacitated, or until you spend ki to enter another stance. Doing so ends the current stance and the new stance takes effect. When a stance ends in order to enter a different stance you activate the original stances Flow step.",
				{
					"type": "entries",
					"name": "Peace",
					"entries": [
						"The Calm stance is a soft and quiet one and, to most, is considered the default stance of life that one should abide by. It is characterized as a soft, gentle breeze in the mid afternoon.",
						"While Peace is active, you gain the following bonuses:",
						{
							"type": "list",
							"items": [
								"Your movement speed increases by 10 feet.",
								"Attacks of opportunity made against you while you move are made at disadvantage.",
								"Whenever you move at least 5 feet on your turn, you can fly up to 15 feet, but you must end your movement on a solid surface. You can make this special movement only once per turn."
							]
						},
						"{@b Flow Step:} Taking a deep, slow breath you step into your next stance and heal for one roll of your Martial Arts die plus half of your Wisdom modifier (rounded down)."
					]
				},
				{
					"type": "entries",
					"name": "Wrath",
					"entries": [
						"The Wrath is a brutal and angry one, characterized by earthquakes and the erupting anger of volcanos.",
						"While the Wrath is active, you gain the following bonuses:",
						{
							"type": "list",
							"items": [
								"You have advantage on your first two attacks each turn.",
								"When you use your Flurry of Blows feature, you can make one extra attack with the bonus action."
							]
						},
						"{@b Flow Step:} With a roar, you quench your rage and steel your resolve. On your next turn, your unarmed attacks or attacks made with monk weapons gain a +2 bonus to the damage roll."
					]
				},
				{
					"type": "entries",
					"name": "Majesty",
					"entries": [
						"The Majesty stance is steady and focused on precise movement learned from the complex balance of nature.",
						"While Majesty is active, you gain the following bonuses:",
						{
							"type": "list",
							"items": [
								"Your enemies have disadvantage on the next attack they make against you.",
								"When you make an attack with an unarmed strike or monk weapon, you gain a +2 to the attack roll."
							]
						},
						"{@b Flow Step:} You release the tension of this stance and prepare for the next. You regain one Ki point."
					]
				}
			]
		},
		{
			"name": "Tatakai",
			"source": "WMDSM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Divine Stance",
			"subclassSource": "WMDSM",
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, you are beginning to master the material plane and have attuned to the rhythms of the world. You now have advantage on Initiative rolls. You learn the Stance of Breath which you can only enter as a reaction before your first turn.",
				{
					"type": "entries",
					"name": "Stance of Breath",
					"entries": [
						"This stance is the embodiment of the moment before a strike, like a lions pounce or lightning strike. Entering this stance requires no ki and it ends at the end of your first turn. When you enter this stance you gain the following:",
						{
							"type": "list",
							"items": [
								"You gain temporary hit points equal to one roll of your Martial Arts die plus your Wisdom modifier.",
								"Your movement speed increases by 20 feet.",
								"Your first successful attack deals additional damage equal to one roll of your Martial Arts die plus your Wisdom modifier."
							]
						},
						"{@b Flow Step:} You release the breath of the moment and ease into your next stance. Your next primary stance costs no Ki."
					]
				}
			]
		},
		{
			"name": "Tengoku",
			"source": "WMDSM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Divine Stance",
			"subclassSource": "WMDSM",
			"level": 11,
			"header": 2,
			"entries": [
				"At 11th level, you learn the ascending stance. Stance of the Heavens, the stance of the skies above and the balance between everything above and the land below.",
				{
					"type": "entries",
					"name": "Stance of the Heavens",
					"entries": [
						"As the ascending stance, this stance may be activated as a bonus action and it costs 3 ki to enter this stance. It lasts for one minute it remains active while you use other stances. While this stance remains active, you gain the following benefits:",
						{
							"type": "list",
							"items": [
								"Having learned the ascending stance, your Flow Steps feel much more purposeful and powerful. Every third Flow Step takes effect twice before your next stance begins.",
								"You may use your reaction to move to a creature within 30 feet of you and you may make a single attack against them if they are within reach."
							]
						}
					]
				}
			]
		},
		{
			"name": "The Divine",
			"source": "WMDSM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Divine Stance",
			"subclassSource": "WMDSM",
			"level": 17,
			"header": 2,
			"entries": [
				"At 17th level, you reach the peak of your journey in attaining the Stance of the Divine. This is the gentle ray of sunshine on your face during a warm summer's day and the wrathful tempest that rips and destroys everything in its wake. This Stance suffuses your body with and channels the Divine, resulting in your eyes and hands radiating a soft white light.",
				{
					"type": "entries",
					"name": "The Stance of the Divine",
					"entries": [
						"This stance costs 2 ki points to enter and only lasts one turn. While active you gain the following benefits:",
						{
							"type": "list",
							"items": [
								"All unarmed and monk weapon attacks you make deal additional damage equal to your Wisdom modifier.",
								"You receive truesight out to 60 feet for one minute.",
								"All enemy attacks against you have disadvantage until the start of your next turn.",
								"Activating your next stance is a free action."
							]
						},
						"{@b Flow Step:} Maintaining balance between the Earthly and The Divine is key. You gain the effect of whatever Flow Step you used to enter the Stance of the Divine."
					]
				}
			]
		}
	]
}