{
	"_meta": {
		"sources": [
			{
				"json": "DK",
				"abbreviation": "DK",
				"full": "Dragon Knight",
				"authors": [
					"Rain-Junkie"
				],
				"version": "8.1",
				"convertedBy": [
					"Unknown",
					"Jafner",
					"NutritiousCookie"
				],
				"url": "https://www.gmbinder.com/share/-MRTYlUGm6iya7xMgUZR",
				"targetSchema": "1.5.0"
			}
		],
		"dateAdded": 1616886969,
		"dateLastModified": 1633018771
	},
	"class": [
		{
			"name": "Dragon Knight",
			"source": "DK",
			"hd": {
				"number": 1,
				"faces": 10
			},
			"proficiency": [
				"con",
				"cha"
			],
			"startingProficiencies": {
				"armor": [
					"light",
					"medium",
					"heavy",
					"{@item shield|phb|shields}"
				],
				"weapons": [
					"simple",
					"martial"
				],
				"skills": [
					{
						"choose": {
							"from": [
								"arcana",
								"athletics",
								"deception",
								"intimidation",
								"perception",
								"persuasion"
							],
							"count": 2
						}
					}
				]
			},
			"startingEquipment": {
				"additionalFromBackground": true,
				"default": [
					"(a) a {@filter martial weapon|items|type=martial weapon|source=phb} and a {@item shield|phb} or (b) two {@filter martial weapons|items|type=martial weapon|source=phb}",
					"(a) {@item chain mail|phb}, (b) {@item scale mail|phb} or (c) {@item leather armor|phb}",
					"(a) a {@item light crossbow|phb} and 20 bolts or (b) five {@item javelin|phb}s",
					"(a) a {@item dungeoneer's pack|phb} or (b) an {@item explorer's pack|phb}"
				],
				"goldAlternative": "{@dice 5d4×10|4d4 × 10|Starting Gold}",
				"defaultData": [
					{
						"a": [
							{
								"equipmentType": "weaponMartial"
							},
							"shield|phb"
						],
						"b": [
							{
								"equipmentType": "weaponMartial",
								"quantity": 2
							}
						]
					},
					{
						"a": [
							"chain mail|phb"
						],
						"b": [
							"scale mail|phb"
						],
						"c": [
							"leather armor|phb"
						]
					},
					{
						"a": [
							"light crossbow|phb"
						],
						"b": [
							{
								"item": "javelin|phb",
								"quantity": 5
							}
						]
					},
					{
						"a": [
							"dungeoneer's pack|phb"
						],
						"b": [
							"explorer's pack|phb"
						]
					}
				]
			},
			"multiclassing": {
				"requirements": {
							"cha": 13,
					"or": [
						{
							"str": 13,
							"dex": 13
						}
					]
				},
				"proficienciesGained": {
					"armor": [
						"light",
						"medium"
					],
					"weapons": [
						"simple",
						"martial"
					]
				}
			},
			"classFeatures": [
				"Dragon Covenant|Dragon Knight|DK|1",
				"Companion's Bond|Dragon Knight|DK|1",
				"Fighting Style|Dragon Knight|DK|2",
				"Dragon's Fury|Dragon Knight|DK|2",
				{
					"classFeature": "Dragon Knight Practice|Dragon Knight|DK|3",
					"gainSubclassFeature": true
				},
				"Eye For Detail|Dragon Knight|DK|3",
				"Ability Score Improvement|Dragon Knight|DK|4",
				"Extra Attack|Dragon Knight|DK|5",
				"Draconic Growth|Dragon Knight|DK|5",
				"Rending Strikes|Dragon Knight|DK|6",
				"Breath Weapon|Dragon Knight|DK|6",
				{
					"classFeature": "Dragon Knight Practice|Dragon Knight|DK|7",
					"gainSubclassFeature": true
				},
				"Ability Score Improvement|Dragon Knight|DK|8",
				"Draconic Advancement|Dragon Knight|DK|9",
				{
					"classFeature": "Dragon Knight Practice feature|Dragon Knight|DK|10",
					"gainSubclassFeature": true
				},
				"Draconic Nature|Dragon Knight|DK|11",
				"Ability Score Improvement|Dragon Knight|DK|12",
				"Titanic Roar|Dragon Knight|DK|13",
				"Legacy of the Dragon|Dragon Knight|DK|14",
				{
					"classFeature": "Dragon Knight Practice feature|Dragon Knight|DK|15",
					"gainSubclassFeature": true
				},
				"Ability Score Improvement|Dragon Knight|DK|16",
				"Ancient Resistance|Dragon Knight|DK|17",
				{
					"classFeature": "Dragon Knight Practice feature|Dragon Knight|DK|18",
					"gainSubclassFeature": true
				},
				"Ability Score Improvement|Dragon Knight|DK|19",
				"Essence of the Covenant|Dragon Knight|DK|20"
			],
			"subclassTitle": "Dragon Knight Practice",
			"fluff": [
				{
					"entries": [
						"A human clad in gleaming plate armour stares down a snarling owlbear, slowly reaching for the lance strapped across her back. The owlbear charges before she can reach her weapon, but a gout of fire from the sky stops the owlbear in its tracks. The gold dragon lands in front of the human, its eyes burning with a fiery vengeance as it snorts, causing flames to billow from its nostrils. Mounting her dragon, the human lets out a war cry as the dragon takes off into the air.",
						"Pulling the bowstring back, the elf whispers a few hushed words as an arcane fire erupts around the goblins below. Lightning sparks at the tip of his arrow, and he grins to himself as he fires at the goblin chief. The arrow finding its mark, the goblin chief can barely cry for help as lightning explodes from his body, arcing off to his nearby guards. In the trees, a nearby blue dragon chuckles to itself as it descends upon those left.",
						"The platinum dragon sniffs at some rubble before nudging it, looking back towards a halfling. She comes over and together they shift the rocks. Reaching her hand out, the halfling brushes the hair out of the eyes of the small boy who lies in the rubble. A shield of divine magic wraps around his small frame as the halfling pulls him into her arms, carrying him to safety.",
						"Scowling to himself, the half-orc looks around the darkened cave for his quarry. Letting out a short whistle, a dark dragon, onyx in colour, seems to appear from the shadows with a dead drow in its maw. Rolling his eyes, the half-orc makes a motion with his hands, and the dragon spits out the drow, a sheepish expression on its reptilian face as darkness begins to swirl around the pair, causing them to vanish.",
						"While different in personality and fighting styles, all of these heroes are dragon knights, a champion who fights alongside a dragon companion. Tough, relentless and unyielding, dragon knights and their dragons never give up, fighting to either heroic or devious ends.",
						{
							"type": "entries",
							"name": "An Unbreakable Bond",
							"entries": [
								"The bond between a knight and their dragon is nearly impossible to eclipse. Only powerful magic can even attempt to turn them against one another, and they nearly never fight each other against their own will. Despite this, a knight and their dragon are known to argue over strategy, tactics, or even miscellaneous things, as the dragon, despite its respect for its knight, is not quick to let go of its ego.",
								"As the knight and dragon grow together, this bond strengthens, granting both the knight and dragon impressive strength and unique powers. The dragon is typically the stronger of the pair as they develop, but will be weaker earlier on, while the knight still has to watch over them to ensure their bond can continue to flourish. Eventually, some knights might put down their weapons and live a simple life with their dragon, having forged a legendary friendship through the trials they faced.",
								"This connection has its drawbacks, however, and should the knight fall in battle, the dragon too will die, as the dragon's spirit can't live without the knight. Should the dragon fall in battle, the knight can restore its body with a costly ritual, but a few knights might instead choose to let their dragons rest, and go on to instead simply channel their dragon's power."
							]
						},
						{
							"type": "entries",
							"name": "Practice Makes Perfect",
							"entries": [
								"All dragon knights are divided by their practice, and much like the dragons they raise and fight with, the knights are known to be proud at their best, and egotistical at their worst. Two people of different practices are rarely able to get along, despite how similar they might be. Those of the Platinum Practice always regard themselves superior to those of the Shadow Practice, and members of the Elemental Practice consider the members of the Rider Practice to be brutish and dim-witted.",
								"Despite these rivalries, dragon knights are fiercely loyal, and will never betray another dragon knight, even if they come from a different practice. Dragon knights believe they only have each other to count on, as no one else understands the intense bond between the knight and the dragon."
							]
						},
						{
							"type": "entries",
							"name": "Creating A Dragon Knight",
							"entries": [
								"When creating your dragon knight, there's one question you should consider before all others; how did you get your dragon? Did you find an egg, and manage to form a bond with the hatchling? Was it a gift from an ancient dragon, looking for someone to protect its young? Did it declare you as its knight one day, much to your surprise?",
								"All dragon knights go through the bonding ceremony, which is where they form a close bond with their dragon, establishing each other as allies and protectors. Was your dragon willing in this ceremony, or was it raised to serve you? Or did your dragon actually perform the ceremony, and you had absolutely no clue as to what was going on?",
								"Something else you must consider is your character's martial abilities. All dragon knights are skilled in combat, and how your character is too is something that will need to be considered. Perhaps they where a student at a military academy, or a guard-in-training at their home village?",
								{
									"type": "entries",
									"name": "Quick Build",
									"entries": [
										"You can make a dragon knight quickly by following these suggestions. First, make either Strength or Dexterity your highest ability score, depending on the type of weapons you want to use. Your next highest ability score should be Constitution if you plan to focus on melee combat, or Charisma if you want to improve your overall subclass features. Second, choose the Folk Hero background."
									]
								},
								{
									"type": "entries",
									"name": "Covenant",
									"entries": [
										"Each dragon knight has a different story to tell when it comes to how they met their dragon. The way a dragon and knight first meet often set up how they interact for the rest of their lives, and a bad first impression can prove disastrous to their bond.",
										"When you consider the creation of this covenant, also consider the following: were you and your dragon both willing, and does your character ever regret the bond?",
										{
											"type": "table",
											"colLabels": [
												"d6",
												"Covenant"
											],
											"colStyles": [
												"col-1",
												"col-11"
											],
											"rows": [
												[
													"1",
													"Bonding with a dragon as you reach adulthood is all you've ever known, and is the way your ancestors have always lived."
												],
												[
													"2",
													"You stumbled across your dragon in a forest, cave, or on the beach. Since then, it hasn't stopped following you around."
												],
												[
													"3",
													"Your dragon has always been with you for as long as you remember, and you can't remember ever conducting a formal ritual."
												],
												[
													"4",
													"As a way of proving yourself, you went out into the wild to capture a dragon as proof of your strength and power."
												],
												[
													"5",
													"Forced to bond with your dragon, it acts as a guardian and a protector, despite how much you insist you don't need its help."
												],
												[
													"6",
													"Trading a large amount of treasure for a dragon's egg, you raised the dragon to serve as your mount and companion."
												]
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Relationship",
									"entries": [
										"The nature of the relationship between dragon and knight varies between each dragon knight, and changes the way each knight and dragon interact with each other, and those around them. This relationship is based on their covenant, ideals, flaws, and personality traits.",
										"While you decide on your relationship, consider how it will effect the way you and your dragon fight together.",
										{
											"type": "table",
											"colLabels": [
												"d6",
												"Relationship"
											],
											"colStyles": [
												"col-1",
												"col-11"
											],
											"rows": [
												[
													"1",
													"Best friends can't even begin to describe you and your dragon, and you do absolutely everything together."
												],
												[
													"2",
													"Your dragon is merely a tool to be used, and you like to frequently remind it of such."
												],
												[
													"3",
													"Despite your differences and arguments, you and your dragon have come to respect each other, but your relationship is still rocky."
												],
												[
													"4",
													"You and your dragon have both agreed to keep your relationship businesslike. All that matters is how you can help each other."
												],
												[
													"5",
													"Much to your distaste, you actually serve your dragon, and it acts as the leader in your relationship."
												],
												[
													"6",
													"You and your dragon bitterly hate each other, but are forced together because of the bond you share. You both understand seperation could prove disasterous."
												]
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Obstacles",
									"entries": [
										"Finally, having a draconic companion is not without its complications. Somewhere in your travels, your and your companion may have caused fear among travelers or gained the ire of a noble court. This obstacle might determine complications that arise in your adventures.",
										"Should you choose to roll or select from the following obstacles, or create your own, be sure to consider how it affects how you and your dragon interact with others.",
										{
											"type": "table",
											"colLabels": [
												"d6",
												"Obstacles"
											],
											"colStyles": [
												"col-1",
												"col-11"
											],
											"rows": [
												[
													"1",
													"The mother of your dragon companion is searching for its child, and you worry it might find you."
												],
												[
													"2",
													"Bounty hunters are looking for your dragon, as it scales and teeth could sell for quite a lot."
												],
												[
													"3",
													"A village believes that your dragon is the cause for all of their problems, and seeks retribution."
												],
												[
													"4",
													"Due to your bond, you have slightly draconic features that make you appear untrustworthy and intimidating."
												],
												[
													"5",
													"A religious order considers you a heretic for putting a dragon under your control, and wants to \"liberate\" it for their own purposes."
												],
												[
													"6",
													"You and your dragon used to be one whole dragon, and the sudden split is strange and uncomfortable."
												]
											]
										}
									]
								}
							]
						}
					],
					"name": "Dragon Knight",
					"source": "DK",
					"type": "section"
				}
			]
		}
	],
	"monster": [
		{
			"name": "Dragon Companion",
			"size": "M",
			"type": "dragon",
			"source": "DK",
			"alignment": [
				{
					"special": "alignment same as knight"
				}
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 8,
				"formula": "1d10 + 2"
			},
			"speed": {
				"walk": 20,
				"fly": 30,
				"swim": 20
			},
			"str": 14,
			"dex": 8,
			"con": 14,
			"int": 10,
			"wis": 12,
			"cha": 12,
			"save": {
				"special": "Same as knight"
			},
			"skill": {
				"perception": "+3",
				"stealth": "+1"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 15,
			"languages": [
				"Draconic"
			],
			"trait": [
				{
					"name": "Statblock Adjustments",
					"entries": [
						"Your dragon companion gains the following additional immunities speeds, and traits, depending on the colour dragon you choose.",
						{
							"type": "table",
							"colLabels": [
								"Dragon",
								"Immunity",
								"Speed",
								"Traits"
							],
							"colStyles": [
								"col-3",
								"col-4",
								"col-3",
								"col-6"
							],
							"rows": [
								[
									"Black",
									"Acid",
									"Swim",
									"Amphibious"
								],
								[
									"Blue",
									"Lightning",
									"Climb",
									"—"
								],
								[
									"Brass",
									"Fire",
									"Climb",
									"—"
								],
								[
									"Bronze",
									"Lightning",
									"Swim",
									"Amphibious"
								],
								[
									"Copper",
									"Acid",
									"Climb",
									"—"
								],
								[
									"Gold",
									"Fire",
									"Swim",
									"Amphibious"
								],
								[
									"Green",
									"Poison",
									"Swim",
									"Amphibious"
								],
								[
									"Red",
									"Fire",
									"Climb",
									"—"
								],
								[
									"Silver",
									"Cold",
									"Climb",
									"—"
								],
								[
									"White",
									"Cold",
									"Climb",
									"Ice Walk"
								]
							]
						},
						"The dragon gains immunity to the listed damage type. Green dragons also gain immunity to the poisoned condition.",
						"The dragon gains either a climbing or swimming speed equal to its walking speed.",
						"The dragon gains the benefits of any traits it has listed.",
						"{@b Amphibious.} The dragon can breathe air and water.",
						"{@b Ice Walk.} The dragon can move across across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost it extra movement."
					]
				}
			],
			"action": [
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit +4} to hit, reach 5 ft., one target. {@h}5 ({@damage 1d6 + 2}) slashing damage."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"DR"
			],
			"damageTags": [
				"S"
			],
			"miscTags": [
				"MW"
			]
		}
	],
	"classFeature": [
		{
			"name": "Dragon Covenant",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 1,
			"entries": [
				"At 1st level, you form a covenant with a type of {@creature Dragon Companion|DK}. The damage type associated with each dragon is used by features you gain later. You also gain the service of a dragon, who's statistics can be found at the end of the document. The dragon gains additional damage immunities and traits, depending on the type of dragon you chose for your Dragon Covenant.",
				{
					"type": "table",
					"caption": "Dragon Covenant",
					"colLabels": [
						"Dragon",
						"Damage Type",
						"Dragon",
						"Damage Type"
					],
					"colStyles": [
						"col-3 text-center",
						"col-2",
						"col-3 text-center",
						"col-9"
					],
					"rows": [
						[
							"Black",
							"Acid",
							"Gold",
							"Fire"
						],
						[
							"Blue",
							"Lightning",
							"Green",
							"Poison"
						],
						[
							"Brass",
							"Fire",
							"Red",
							"Fire"
						],
						[
							"Bronze",
							"Lightning",
							"Silver",
							"Cold"
						],
						[
							"Copper",
							"Acid",
							"White",
							"Cold"
						]
					]
				},
				"When you die, your dragon also dies after a number of hours equal to your dragon knight level. If your dragon companion is ever slain, the magical bond you share allows you to return it to life. With 8 hours of work and the expenditure of 25 gp worth of precious gems per your dragon knight level, you can call forth your companion's spirit and use your magic to create a new body for it. You can return a dragon companion to life in this manner even if you do not possess any part of its body.",
				"Returning your dragon to life is a gruelling process, and you must expend a number of hit dice equal to half your dragon knight level (rounded up) to perform this ritual.",
				"Finally, you can speak, read, and write Draconic due to the bond you and your dragon share."
			]
		},
		{
			"name": "Companion's Bond",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 1,
			"entries": [
				"Also at 1st level, your {@creature Dragon Companion|DK} gains a number of benefits because of the bond you have forged together.",
				"The dragon obeys your commands as best it can. Your dragon shares your initiative, and acts on your turn. You determine its actions, decisions, attitudes, and so on (no action required by you). If you are incapacitated, your dragon acts on its own. If you're absent, it rolls its own initiative.",
				"Your dragon can't take the Attack action. It has yet to master flying and falls if it ends its turn in the air. Additionally, it can't be used as a mount or can't fly with a creature it has grappled.",
				"Your dragon companion has abilities and game statistics determined in part by your level. Your dragon uses your proficiency bonus rather than its own. While not wearing barding, your dragon companion has a natural armour class of 11 + its Constitution modifier + your proficiency bonus.",
				"For each dragon knight level after 1st, your dragon companion gains hit points equal to 6 + its Constitution modifier, and it gains one additional hit die. The dragon's hit dice are d10s, regardless of its size. When the dragon is reduced to 0 hit points, it makes death saving throws as a player would.",
				"Your dragon companion also gains proficiency in two skills of your choice, and shares your saving throw proficiencies. Your dragon companion can't attune to or activate magical items.",
				"Your dragon companion's level is equal to your dragon knight level for the purpose of calculating spells like polymorph and true polymorph.",
				"You and your dragon always know the direction to one another, and can communicate with vague images, emotions, and feelings, regardless of distance to one another.",
				"Whenever you gain the Ability Score Improvement class feature, your dragon's abilities also improve. Your dragon can increase one ability score of your choice by 2, or it can increase two ability scores of your choice by 1. As normal, your dragon can't increase an ability score above 20 using this feature. Your dragon companion can't take feats.",
				"Your dragon shares your alignment, and has a personality trait and a flaw that you can roll for or select from the tables below. Your dragon shares your ideal, and its bond is always \"I will protect my knight; I will do the best I can for my knight; I will die for my knight.\"",
				{
					"type": "table",
					"colLabels": [
						"{@dice d4}",
						"Trait"
					],
					"colStyles": [
						"col-1",
						"col-11"
					],
					"rows": [
						[
							"1",
							"I love to collect gems and art pieces."
						],
						[
							"2",
							"If you threaten my friends, you threaten me."
						],
						[
							"3",
							"I stay on alert so others can rest."
						],
						[
							"4",
							"I love to explore, so that I can discover and learn about different cultures."
						]
					]
				},
				{
					"type": "table",
					"colLabels": [
						"{@dice d4}",
						"Flaw"
					],
					"colStyles": [
						"col-1",
						"col-11"
					],
					"rows": [
						[
							"1",
							"As a dragon, I'm naturally superior to others."
						],
						[
							"2",
							"I'm secretly terrified of other dragons."
						],
						[
							"3",
							"I hold permanent grudge against anyone who offends my knight."
						],
						[
							"4",
							"I get jealous when my knight spends time with people other than me."
						]
					]
				}
			]
		},
		{
			"name": "Fighting Style",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 2,
			"entries": [
				"You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take the same Fighting Style option more than once, even if you get to choose again.",
				{
					"type": "options",
					"count": 1,
					"entries": [
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Archery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Dueling"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Great Weapon Fighting"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Two-Weapon Fighting"
						}
					]
				}
			]
		},
		{
			"name": "Dragon's Fury",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 2,
			"entries": [
				"At 2nd level, your dragon companion is ready for battle, and can now take the Attack action in combat.",
				"Additionally, your dragon gains the following attack options, which it can use with the Attack action. Your dragon is proficient with them, and adds its Strength modifier to their attack and damage rolls. If an option causes a creature to make a saving throw, the save DC is equal to 8 + your proficiency bonus + the dragon's Strength modifier. Your dragon can use these attack options a number of times equal to its Strength modifier (minimum of once.) It regains any expended uses when it finishes a short or long rest.",
				{
					"type": "entries",
					"name": "Bite Attack",
					"entries": [
						"Your dragon makes a melee weapon attack against a creature within 5 feet of it. On a hit, the target takes 1d6 piercing damage, and an extra 1d6 damage. This extra damage increases to 2d6 at 6th level, 3d6 at 10th level, and 4d6 at 14th level. The additional damage is the same type as the one associated with your Draconic Covenant."
					]
				},
				{
					"type": "entries",
					"name": "Tail Attack",
					"entries": [
						"The dragon makes a melee weapon attack against a creature within 5 feet of it. On a hit, the target takes 1d6 bludgeoning damage, and must succeed on a Strength saving throw or be knocked prone. The reach of this attack increases to 10ft at 6th level, 15ft at 10th level, and 20ft at 14th level."
					]
				},
				{
					"type": "entries",
					"name": "Wing Attack",
					"entries": [
						"Rather than making an attack, your dragon can beat its wings. Creatures of your choice within 5 feet of your dragon must make a Strength saving throw. On a failed save, a creature is pushed 5 feet away from the dragon. The range of the push and distance a creature is pushed on a failed save increase by 5 feet at 6th level, 10th level, and 14th level. Immediately after making this special attack, your dragon can move up to half its flying speed."
					]
				}
			]
		},
		{
			"name": "Dragon Knight Practice",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 3,
			"entries": [
				"All dragon knights can call themselves members of the Rider Practice, Elemental Practice, Platinum Practice, or Shadow Practice. The Rider Practice focuses on working in sync with their dragon: both in and out of the heat of combat. The Elemental Practice heightens their battle skill with magic, unleashing destruction on their foes. The Platinum Practice uses the divine magic of Bahamut to support their allies, protecting them with their holy light. The Shadow Practice uses misdirection and guile to gain the upper hand in all situations.",
				"Your choice grants you features when you choose it at 3rd level and again at 7th, 10th, 15th, and 18th level."
			]
		},
		{
			"name": "Eye For Detail",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 3,
			"entries": [
				"Also at 3rd level, you can easily discern the value and rarity of gems, art pieces, and magical items. You can spend 1 minute studying a gem or art piece, after which you learn it's exact value. Additionally, if it is a gemstone, you learn what kind of gemstone it is. If it's an art piece, you learn how old it is.",
				"Furthermore, you can cast the {@spell identify} spell, but only as a ritual. You don't require material components for the spell when you cast it this way."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 4,
			"entries": [
				"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a feat."
			]
		},
		{
			"name": "Extra Attack",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 5,
			"entries": [
				"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
			]
		},
		{
			"name": "Draconic Growth",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 5,
			"entries": [
				"Also at 5th level, your dragon companion continues to grow, and gains the following benefits:",
				{
					"type": "list",
					"items": [
						"At 5th level your dragon companion's flying speed increases by 15 feet, it's other speeds increase by 10 feet, and it no longer falls to the ground if it ends its turn in the air. At 9th level it's flying speed and other speeds increase by a further 15 feet and 10 feet respectively."
					]
				}
			]
		},
		{
			"name": "Rending Strikes",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 6,
			"entries": [
				"Also at 6th level, your dragon companion's attacks count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
				"Additionally, at 11th level your dragon companion can make two claw attacks instead of one when they make the claw attack action."
			]
		},
		{
			"name": "Breath Weapon",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 6,
			"entries": [
				"Starting at 6th level, your dragon has developed the ability to unleash raw, destructive elements from its mouth. The damage of the breath weapon, as well as its area, is determined by the colour of your dragon.",
				{
					"type": "table",
					"colLabels": [
						"Dragon",
						"Breath Weapon",
						"Dragon",
						"Breath Weapon"
					],
					"colStyles": [
						"col-3 text-center",
						"col-2",
						"col-3 text-center",
						"col-9"
					],
					"rows": [
						[
							"Black",
							"5 by 30 ft. line (Dex. save)",
							"Gold",
							"15 ft. cone (Dex. save)"
						],
						[
							"Blue",
							"5 by 30 ft. line (Dex. save)",
							"Green",
							"15 ft. cone (Con. save)"
						],
						[
							"Brass",
							"5 by 30 ft. line (Dex. save)",
							"Red",
							"15 ft. cone (Dex. save)"
						],
						[
							"Bronze",
							"5 by 30 ft. line (Dex. save)",
							"Silver",
							"15 ft. cone (Con. save)"
						],
						[
							"Copper",
							"5 by 30 ft. line (Dex. save)",
							"White",
							"15 ft. cone (Con. save)"
						]
					]
				},
				"As an action on its turn, the dragon can exhale this destructive energy. Each creature in the area takes 4d8 damage on a failed save, or half as much on a successful one, with the saving throw calculated as follows:",
				{
					"type": "abilityDc",
					"name": "Breath",
					"attributes": [
						"con"
					]
				},
				"The area of the line and cone and the damage of the breath weapon increase as you gain levels in this class, as shown below.",
				"Once your dragon has used this ability, it cannot do so again until you finish a short or long rest.",
				{
					"type": "table",
					"colLabels": [
						"Level",
						"Damage",
						"Area"
					],
					"colStyles": [
						"col-3 text-center",
						"col-2",
						"col-3"
					],
					"rows": [
						[
							"6th",
							"4d8",
							"5 by 30 ft. line / 15 ft. cone"
						],
						[
							"9th",
							"6d8",
							"5 by 60 ft. line / 30 ft. cone"
						],
						[
							"14th",
							"8d8",
							"5 by 90 ft. line / 60 ft. cone"
						]
					]
				}
			]
		},
		{
			"name": "Dragon Knight Practice",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 7,
			"entries": [
				"At 7th level, you gain a feature granted by your Dragon Knight Practice."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 8,
			"entries": [
				"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a feat."
			]
		},
		{
			"name": "Draconic Advancement",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 9,
			"entries": [
				"At 9th level, your dragon companion matures, allowing you to fight together more fluidly. Your dragon companion's size is now large, it can be used as a mount, and it is able to fly with a creature it has grappled. Additionally, as long as your dragon companion can see you, it has advantage on all saving throws."
			]
		},
		{
			"name": "Dragon Knight Practice feature",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 10,
			"entries": [
				"At 10th level, you gain a feature granted by your Dragon Knight Practice."
			]
		},
		{
			"name": "Draconic Nature",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 11,
			"entries": [
				"At 11th level, you take on the physical aspects of a dragon. You gain resistance to the damage type associated with your Draconic Covenant, and you gain one of the following benefits:",
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"name": "Scales",
							"entries": [
								"Scales cover sections of your body, helping shield you from harm. While you aren't wearing armour, your AC equals 10 + your Dexterity modifier + your Charisma modifier. You can still wield a shield and get this benefit."
							]
						},
						{
							"type": "entries",
							"name": "Eyes",
							"entries": [
								"Your eyes become sharp and focused. You gain proficiency in the Perception and Investigation skills if you aren't already, and you have advantage on any (Wisdom) Perception or (Intelligence) Investigation checks based on sight."
							]
						},
						{
							"type": "entries",
							"name": "Tail",
							"entries": [
								"Your spine extends and you grow a scaled, muscular tail. When you take the Attack action on your turn, you can attempt to shove a creature within 10 feet of you as a bonus action."
							]
						}
					]
				}
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 12,
			"entries": [
				"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a feat."
			]
		},
		{
			"name": "Titanic Roar",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 13,
			"entries": [
				"Starting at 13th level, your dragon can let loose a vicious roar, filling nearby creatures with dread.",
				"As an action on its turn, your dragon can roar. Any number of creatures of your choice within 20 feet of the dragon must make a Wisdom saving throw against the dragon's breath weapon DC. On a failed save, creatures are frightened of the dragon for 1 minute. The creature can repeat the saving throw at the end each of their turns, ending the effect on a success.",
				"Once your dragon has used this ability, it can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Legacy of the Dragon",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 14,
			"entries": [
				"At 14th level, you have been blessed with a dragon's extended lifespan. You age only one year for every ten years that pass, and can't be aged magically."
			]
		},
		{
			"name": "Dragon Knight Practice feature",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 15,
			"entries": [
				"At 15th level, you gain a feature granted by your Dragon Knight Practice."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 16,
			"entries": [
				"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a feat."
			]
		},
		{
			"name": "Ancient Resistance",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 17,
			"entries": [
				"At 17th level, you can shrug off even the most dangerous effects. Whenever you or your dragon fail a saving throw, you can choose to turn that failure into a success.",
				"Once you use this feature, you can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Dragon Knight Practice feature",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 18,
			"entries": [
				"At 18th level, you gain a feature granted by your Dragon Knight Practice."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 19,
			"entries": [
				"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. You can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a feat."
			]
		},
		{
			"name": "Essence of the Covenant",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"level": 20,
			"entries": [
				"At 20th level, the bond between you and your dragon is so strong that you can suffer each other's blows. Whenever you or your dragon would take damage, if you are within 30 feet of each other, either of you can take the damage for the other, causing them not to take the damage. Instead, the one who used the ability takes the damage. This damage can’t be reduced or prevented in any way.",
				"Additionally, you automatically succeed on the ability check you make to restore your dragon to life."
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Rider Practice",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 3,
			"entries": [
				"The bond between a dragon knight and their dragon is strong, but those of the Rider Practice take that even further. They seek to live and to die beside their dragon, a sentiment shared by the dragon itself. While not all riders mount their dragons, those who don't are rare. Those of the Rider Practice fight in tandem with their dragon, and win in tandem with them.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Rider's Handling|Dragon Knight|DK|Rider|DK|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Fighting Style: Honed Claws|Dragon Knight|DK|Rider|DK|3"
				}
			]
		},
		{
			"name": "Rider's Handling",
			"entries": [
				"Starting at 3rd level, you’re able to better coordinate with your dragon. As a bonus action, you can command your dragon companion to move half of its movement speed without provoking opportunity attacks.",
				"Additionally, your dragon companion’s movement speed increases by 5 feet at level 6, 10, and 14."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Fighting Style: Honed Claws",
			"entries": [
				"At 3rd level, you and your dragon have adapted to each other’s maneuvers. Whenever it rolls a 1 on a damage die for an attack it makes, it can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The dragon must be adjacent to you for it to gain this benefit."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Reinvigor",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level, you may use a bonus action to heal and revitalize your dragon to carry on in battle. Your dragon heals {@dice 1d10} + half of your Dragon Knight level in hit points. You may increase the number of d10s by exhausting a hit die a number of times up to your Constitution modifier. You may use this feature a number of times equal to your proficiency bonus and regain expended uses after a long rest.",
				"Additionally, when stabilizing your dragon, you automatically succeed any Wisdom (Medicine) check required. You are also able to use the dragon as a mount if your size is medium or smaller."
			]
		},
		{
			"name": "Rider's Expertise",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you and your dragon rule the sky. Mounting and dismounting your dragon only costs 5 feet and you may do this as a reaction on the dragon’s turn."
			]
		},
		{
			"name": "Improved Dragon's Fury - Rider",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Additionally, you and your dragon have developed unique ways to handle combat. Your dragon may take the following actions in tandem with the original actions from Dragon’s Fury.",
				{
					"type": "list",
					"items": [
						"{@b Bite Attack.} When your dragon takes the bite action against a prone target the same size or smaller than it, it may choose to grapple the creature. Its movement speed is not impeded by this grapple.",
						"{@b Tail Attack.} The dragon may use the tail attack as a reaction.",
						"{@b Wing Attack.} If your dragon has moved 20 feet in a straight line this turn, it may now additionally deal {@dice 4d4} bludgeoning damage on a failed save and half as much on a success on creatures in range of the wing attack. Creatures are still pushed away on a failed save."
					]
				}
			]
		},
		{
			"name": "Comet Strike",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 15,
			"header": 2,
			"entries": [
				"Starting at 15th level, you and your dragon have perfected the art of using gravity to your advantage. As an action you may initiate a comet strike. You declare a melee weapon attack against a creature you see on the ground and leap off your dragon. As a part of this action, you dismount your dragon and roll your attack against the creature below you. In addition to the weapon attack, the target and any creatures within 10 feet must make a Constitution saving throw with a DC equal to 8 + your proficiency bonus + your Constitution modifier or take an extra d6 of damage equal to every 10 feet you’ve fallen. This damage is dealt regardless of if the attack hits.",
				"You may exhaust a hit die to reduce your fall damage by 40 feet. You may do this an amount of times equal to your Constitution modifier (minimum of one). You may not negate this damage further.",
				"Once you use this ability, you can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Dragon's Presence",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Rider",
			"subclassSource": "DK",
			"level": 18,
			"header": 2,
			"entries": [
				"Starting at 18th level, the range of Titanic Roar is increased to 120 feet, creatures that are frightened of your dragon have a speed of 0, and when you or your dragon hit a creature that is frightened of your dragon with a weapon attack, the attack is considered a critical hit.",
				"Once you use this ability, you can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Elemental Practice",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 3,
			"entries": [
				"Dragon knights of the Elemental Practice value the raw, destructive power of their dragons, as well as their inherent intellect, and strive to both emulate and empower this aspect of their dragons through magic.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Draconic Magicks - Heritage|Dragon Knight|DK|Elemental|DK|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Fighting Style: Draconic Casting|Dragon Knight|DK|Elemental|DK|3"
				}
			]
		},
		{
			"name": "Draconic Magicks - Heritage",
			"entries": [
				"Starting at 3rd level, you and your dragon begin to delve into the understanding of each draconic element present in the natural world.",
				"{@b Talents.} You learn two talents of your choice, which are listed under “Talents” below and learn the one based on your dragon’s original damage type. Each talent takes an action from your dragon to use.",
				"Your dragon can activate these talents a number of times equal to half your Dragon Knight level rounded down.",
				"This feature regains all uses until you finish a long rest.",
				"{@b Saving Throws.} Some talents require your target to make a saving throw to resist the talent’s effects. The saving throw DC is calculated as follows:",
				{
					"type": "abilityDc",
					"name": "Talent",
					"attributes": [
						"int"
					]
				},
				{
					"type": "list",
					"items": [
						"{@b Lightning.} The dragon rolls a ranged attack roll against a creature within 60 feet of it. On a success the target takes {@dice 2d8} lightning damage. If an 8 is rolled on either die the dragon may roll this attack against another target within 10 feet of the original. This feature only chains once. Additionally, a creature successfully hit can no longer take reactions until the beginning of its next turn.",
						"{@b Cold.} The dragon rolls a ranged attack roll against a creature within 30 feet of it. On a success, the creature takes {@dice 2d8} cold damage and the creature’s movement speed drops to half speed until the end of a creature's next turn.",
						"{@b Acid.} The dragon rolls a ranged attack roll against a creature within 60 feet of it. On a success, the creature takes {@dice 2d8} acid damage and reduces its AC by 2 until a creature spends an action to remove the acid.",
						"{@b Poison.} The dragon rolls a ranged attack roll against a creature within 60 feet of it. On a success the creature takes {@dice 2d8} poison damage and is considered poisoned until it succeeds a Constitution saving throw at the end of their turns.",
						"{@b Fire.} The dragon rolls a ranged attack roll against a creature within 30 feet of it. On a success, the creature takes {@dice 2d8} fire damage and is branded. You as the knight deal extra damage equal to your proficiency bonus on melee weapon attacks. The creature makes a Constitution saving throw at the end of each of its turns to end the effect."
					]
				}
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Fighting Style: Draconic Casting",
			"entries": [
				"At 3rd level, you and your dragon have learned ancient magic practiced by the original teacher. You learn two cantrips of your choice from the wizard spell list and Intelligence is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the Wizard spell list.",
				"Additionally, the point of origin for this cantrip can be from your dragon or yourself."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Transpose",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level, you may use a bonus action to use your tactician's intellect and improve the battlefield to be in your favor. You may magically teleport and swap places with your dragon within a range of 60 feet. You may use this feature a number of times equal to your proficiency bonus and regain expended uses after a long rest."
			]
		},
		{
			"name": "Elemental's Expertise",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you have honed your affinity to draconic magic. Whenever you take cold, fire, poison, acid, or lightning damage, you reduce the damage by your proficiency bonus."
			]
		},
		{
			"name": "Improved Dragon's Fury - Elemental",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Additionally, you and your dragon have developed unique ways to handle combat. Your dragon may take the following actions in tandem with the original actions from Dragon’s Fury.",
				{
					"type": "list",
					"items": [
						"{@b Bite Attack.} Your dragon may now instead conjure up its own spectral maw to restrain a target. Your dragon can cast {@spell Maximilian's Earthen Grasp|XGE} with the following changes:",
						{
						"type": "list",
						"items": [
						"The duration is until the end of your dragon’s next turn.",
						"It does not require concentration.",
						"This spell can be reactivated as a bonus action.",
						"The duration may be extended by exhausting a hit die a number of times equal to your Intelligence modifier (a minimum of once)."
							]
						},
						"{@b Tail Attack.} Your dragon may now instead shard off its scales to pierce a target. Your dragon may now cast {@spell magic missile} with the following changes:",
						{
						"type": "list",
						"items": [
						"It shoots an amount of darts equal to your proficiency bonus.",
						"The darts may be increased by exhausting a hit die a number of times equal to your intelligence modifier (a minimum of once)."
							]
						},
						"{@b Wing Attack.} Your dragon may now center its wing attack on a target it can see within 60 feet of it. The target grows illusory wings and gains a fly speed of 15 feet. They may then use their reaction to move up to its speed. You may increase the fly speed by 10 feet by exhausting a hit die a number of times equal to your intelligence modifier (a minimum of once)."
					]
				}
			]
		},
		{
			"name": "Heritage Improved",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 15,
			"header": 2,
			"entries": [
				"Starting at 15th level, you and your dragon have begun to master various powers of the ancient elements. You learn the two remaining original talents and improve your original damage type and one other talent to its peak potential.",
				{
					"type": "list",
					"items": [
						"{@b Lightning.} Your lightning strike will now always bounce to another target up to a max of three times and the damage increases to {@dice 4d8} lightning damage. It can not strike the same target twice.",
						"{@b Cold.} A creature affected by the ice is now slowed until the creature uses an action to make an Athletics (Strength) check against your Talent Save DC to escape.",
						"{@b Acid.} A creature affected by the acid now takes an additional {@dice 2d8} acid damage at the beginning of their turn and a creature must make a Survival (Dexterity) check against your Talent Save DC to remove the acid.",
						"{@b Poison.} A creature is now considered frightened until they pass the Constitution saving throw. If a creature is immune to poison it has advantage on this save, otherwise it is rolled at normal.",
						"{@b Fire.} The initial strike of this attack deals {@dice 4d8} fire damage instead and can no longer regain hit points or benefit from invisibility so long as the brand remains."
					]
				}
			]
		},
		{
			"name": "Spellblade",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 15,
			"header": 2,
			"entries": [
				"Additionally at 15th level, you have learned to empower your strikes in tandem with your dragon companion. Whenever your dragon uses a talent, your next weapon attack deals an extra {@dice 3d6} damage of the respective element."
			]
		},
		{
			"name": "Dragon's Presence",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Elemental",
			"subclassSource": "DK",
			"level": 18,
			"header": 2,
			"entries": [
				"At 18th level, when your dragon uses its Breath Weapon, you can empower it. Its area increases to a line 20 feet wide and 240 feet long if it's a line, or a 120-foot cone if it's a cone. Additionally, when you roll its damage, you can deal maximum damage instead of rolling. Finally, any damage your breath weapon deals ignores resistance to that damage.",
				"Once you use this feature, you can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Platinum Practice",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 3,
			"entries": [
				"A few dragon knights worship the Platinum Dragon, Bahamut. These few are members of the Platinum Practice, and are dedicated to preserving the lives of their allies and the innocent.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Draconic Radiance|Dragon Knight|DK|Platinum|DK|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Platinum Protector|Dragon Knight|DK|Platinum|DK|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Fighting Style: Brilliant Protection|Dragon Knight|DK|Platinum|DK|3"
				}
			]
		},
		{
			"name": "Draconic Radiance",
			"entries": [
				"At 3rd level, your draconic nature and that of your companion shifts to reflect the holy magic you now wield. The damage type associated with your Draconic Covenant becomes radiant, and any damage and condition immunities your dragon companion has are replaced with immunity to radiant damage.",
				"Your dragon also physically shifts to reflect this change, and its scales change color to look like the brightest platinum."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Platinum Protector",
			"entries": [
				"At 3rd level, as an action on your turn, you can choose yourself or your dragon to glow with divine power; you shed bright light in a 10 foot radius and dim light for an additional 10 feet for 1 minute.",
				"Whenever you or another creature takes damage while in an area of light you shed, you can use your reaction to reduce the damage by an amount equal to {@dice 1d10} + your proficiency bonus.",
				"You may use this feature up to your Charisma modifier (minimum of one) and it recharges on a long rest."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Fighting Style: Brilliant Protection",
			"entries": [
				"At 3rd level, your dragon has dedicated itself to protecting others. If your dragon is within 5 feet of an attack they may spend their reaction to have the attack target themselves instead."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Touch of Light",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level you’ve learned how to bestow blessings to your allies. As an action you can target a creature within 60 feet of you and give them {dice 2d6} temporary hit points that last for an hour. You may choose to target additional creatures by exhausting a hit die up to your Charisma modifier.",
				"While these temporary hit points are active on a creature, they deal an additional {@dice 1d4} radiant damage on any attack roll made.",
				"The temporary hit points granted by this feature increase to {@dice 3d6} at 10th and {@dice 4d6} at 14th."
			]
		},
		{
			"name": "Radiant's Expertise",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you are in touch with your radiant blessing and are now able to activate Platinum Protector as a bonus action. Its range also increases to a 10 foot radius of bright light and dim light for an additional 10 feet."
			]
		},
		{
			"name": "Improved Dragon's Fury - Radiant",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Additionally, you and your dragon have developed unique ways to handle combat. Your dragon may take the following actions in tandem with the original actions from Dragon’s Fury.",
				{
					"type": "list",
					"items": [
						"{@b Bite Attack.} When the dragon makes a bite attack they can command another creature within a 30 foot range to make a melee weapon attack on a creature. If the target has temporary hit points granted by you they make this attack at advantage.",
						"{@b Tail Attack.} Your dragon may instead target an ally within reach of the tail to heal them for 1d6 hit points.  You can exhaust hit dice to increase this healing by a d6 up to your Charisma modifier of times. Additionally this creature gains {@dice 2d6} temporary hit points at the start of their turn.",
						"{@b Wing Attack.} Your dragon can target a creature and grant it {@dice 2d8} temporary hit points. You can exhaust hit dice to increase these temporary hit points by a d8 up to your Charisma modifier of times. So long as a creature has this instance of temporary hit points they have a fly speed of 20 feet."
					]
				}
			]
		},
		{
			"name": "Aura of Benevolence",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 15,
			"header": 2,
			"entries": [
				"Starting at 15th level, you can call upon the mightiest of blessings to aid your allies and scorn your enemies. As an action you create an aura with a 20 foot radius centered on yourself. All creatures you choose with temporary hit points granted by you have resistance to all damage. All enemies within the initial radius must make a Constitution saving throw equal to 8 + your proficiency bonus + your Charisma modifier or be blinded until the end of their next turn."
			]
		},
		{
			"name": "Platinum Resonance",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Platinum",
			"subclassSource": "DK",
			"level": 18,
			"header": 2,
			"entries": [
				"At 18th level, you can create a lance of supreme justice or wash the battlefield with the graces of life. As an action, you can summon a Celestial Lance. Each creature you choose within a 10 foot radius, 100 foot high cylinder centered on a point must succeed on a Dexterity saving throw based on your Aura DC or take {@dice 10d10} radiant damage.",
				"Alternatively your dragon can use its breath weapon to heal creatures you choose the maximum amount of its damage dice. Using the breath weapon this way does no damage to hostile creatures.",
				"Once you use this ability, you can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Shadow Practice",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 3,
			"entries": [
				"Dragon knights who revere necromancy, or even strive for vengeance, make up members of the Shadow Practice. Dark and elusive, these dragon knights use misdirection and guile to gain the upper hand in battle.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Draconic Darkness|Dragon Knight|DK|Shadow|DK|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Shadow Cloak|Dragon Knight|DK|Shadow|DK|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Fighting Style: Stygian Stinger|Dragon Knight|DK|Shadow|DK|3"
				}
			]
		},
		{
			"name": "Draconic Darkness",
			"entries": [
				"At 3rd level, your draconic nature and that of your companion shifts to reflect the darkness you now wield. The damage type associated with your Draconic Covenant becomes necrotic, and any damage and condition immunities your dragon companion has are replaced with immunity to necrotic damage.",
				"Your dragon also physically shifts to reflect this change, and its scales change color to look like the darkest ebony."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Shadow Cloak",
			"entries": [
				"Starting at 3rd level, your connection with a shadow dragon has allowed it to live within your own shadow cloaking it in darkness. As a bonus action you may teleport your dragon within your shadow so long as your dragon is adjacent to you or is within 30 feet from you while lightly obscured.",
				"While in your shadow your dragon shares your space with the following traits, it is untargetable, others can see your dragon, takes half of the damage you take, and can make attacks as if they originated from your space. ",
				"Your dragon can spend 15 feet of movement to leave your shadow on its turn."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Fighting Style: Stygian Stinger",
			"entries": [
				"At 3rd level, you and your dragon have developed a fighting style using the darkness you carry. While your dragon is within your shadow, the first melee weapon attack you make deals {@dice 2d6} necrotic damage if not wearing heavy armor."
			],
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 3,
			"header": 1
		},
		{
			"name": "Creeping Shadows",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level, you're skilled at keeping to the shadows and are now able to hide as a bonus action and can do so while lightly obscured.",
				"Additionally, your dragon can use its action to create a lightly obscured area with a 5 foot radius of magical shadow for one minute or until knocked unconscious. While you or the dragon deals necrotic damage to a target while lightly obscured, the target must make a Charisma saving throw equal to 8 + your proficiency bonus + your Charisma modifier or be frightened for a minute.",
				"Whenever the creature loses sight of you or the dragon, it instead becomes frightened of all areas that are in complete darkness until it can see you again.",
				"If the creature ends its turn in bright light, it can repeat the saving throw, ending the effect on a success."
			]
		},
		{
			"name": "Shadow's Expertise",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you and your dragon have mastered attacking from the darkness. Your Stygian Stinger’s damage is increased to {@dice 3d6} damage and can trigger on every attack you make."
			]
		},
		{
			"name": "Improved Dragon's Fury - Shadow",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 10,
			"header": 2,
			"entries": [
				"Additionally, you and your dragon have developed unique ways to handle combat. Your dragon may take the following actions in tandem with the original actions from Dragon’s Fury.",
				{
					"type": "list",
					"items": [
						"{@b Bite Attack.} Necrotic damage dealt by your bite attack now heals your dragon for half the damage dealt. You may also exhaust hit dice to expend them and heal yourself as a reaction to a successful attack up to a max of your Charisma modifier. The maximum number of hit dice you can spend at once equals your Charisma modifier (minimum of one die).",
						"{@b Tail Attack.} When your dragon makes a tail attack it can instead cause a creature to make a Constitution save against your Frighten DC. On a failure the target deals half damage with weapon attacks that use Strength until they pass the save at the end of their next turns. You may also exhaust hit dice to deal additional d6 of necrotic damage up to a max of your Charisma modifier.",
						"{@b Wing Attack.} Your dragon may instead create a 15 foot radius sphere of magical darkness that you and your dragon can see through. This sphere lasts for one minute and you can additionally exhaust a hit die, up to a max of your Charisma modifier, to make other creatures you choose be able to see through the darkness."
					]
				}
			]
		},
		{
			"name": "Shifting Shadows",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 15,
			"header": 2,
			"entries": [
				"Starting at 15th level, you can manipulate darkness to slip away from your foes. When you activate your Shadow Cloak feature, you can choose to also become invisible and teleport up to 30 feet to an empty space you can see within range. You remain invisible until the end of your next turn or until you or your dragon attacks, deals damage, or forces a creature to make a saving throw. You can use this feature a number of times equal to your proficiency bonus recharging on long rests."
			]
		},
		{
			"name": "Umbra Pulse",
			"source": "DK",
			"className": "Dragon Knight",
			"classSource": "DK",
			"subclassShortName": "Shadow",
			"subclassSource": "DK",
			"level": 18,
			"header": 2,
			"entries": [
				"At 18th level, you can create a vortex of swirling darkness around yourself as an action on your turn. Any number of creatures you choose within 30 feet of you must make a Constitution saving throw, with the DC being equal to 8 + your proficiency bonus + your Charisma modifier. On a failed save, creatures take {@dice 10d10} necrotic damage and you can choose to have them either pulled up to 15 feet towards you or pushed up to 15 feet directly away from you. On a successful saving throw, creatures take half as much damage and aren't moved.",
				"Once you use this ability, you can't do so again until you finish a long rest."
			]
		}
	],
	"subclass": [
		{
			"name": "Rider Practice",
			"subclassFeatures": [
				"Rider Practice|Dragon Knight|DK|Rider|DK|3",
				"Reinvigor|Dragon Knight|DK|Rider|DK|7",
				"Rider's Expertise|Dragon Knight|DK|Rider|DK|10",
				"Improved Dragon's Fury - Rider|Dragon Knight|DK|Rider|DK|10",
				"Comet Strike|Dragon Knight|DK|Rider|DK|15",
				"Dragon's Presence|Dragon Knight|DK|Rider|DK|18"
			],
			"source": "DK",
			"shortName": "Rider",
			"className": "Dragon Knight",
			"classSource": "DK"
		},
		{
			"name": "Elemental Practice",
			"shortName": "Elemental",
			"source": "DK",
			"subclassFeatures": [
				"Elemental Practice|Dragon Knight|DK|Elemental|DK|3",
				"Transpose|Dragon Knight|DK|Elemental|DK|7",
				"Elemental's Expertise|Dragon Knight|DK|Elemental|DK|10",
				"Improved Dragon's Fury - Elemental|Dragon Knight|DK|Elemental|DK|10",
				"Heritage Improved|Dragon Knight|DK|Elemental|DK|15",
				"Spellblade|Dragon Knight|DK|Elemental|DK|15",
				"Dragon's Presence|Dragon Knight|DK|Elemental|DK|18"
			],
			"className": "Dragon Knight",
			"classSource": "DK"
		},
		{
			"name": "Platinum Practice",
			"subclassFeatures": [
				"Platinum Practice|Dragon Knight|DK|Platinum|DK|3",
				"Touch of Light|Dragon Knight|DK|Platinum|DK|7",
				"Radiant's Expertise|Dragon Knight|DK|Platinum|DK|10",
				"Improved Dragon's Fury - Radiant|Dragon Knight|DK|Platinum|DK|10",
				"Aura of Benevolence|Dragon Knight|DK|Platinum|DK|15",
				"Platinum Resonance|Dragon Knight|DK|Platinum|DK|18"
			],
			"source": "DK",
			"shortName": "Platinum",
			"className": "Dragon Knight",
			"classSource": "DK"
		},
		{
			"name": "Shadow Practice",
			"subclassFeatures": [
				"Shadow Practice|Dragon Knight|DK|Shadow|DK|3",
				"Creeping Shadows|Dragon Knight|DK|Shadow|DK|7",
				"Shadow's Expertise|Dragon Knight|DK|Shadow|DK|10",
				"Improved Dragon's Fury - Shadow|Dragon Knight|DK|Shadow|DK|10",
				"Shifting Shadows|Dragon Knight|DK|Shadow|DK|15",
				"Umbra Pulse|Dragon Knight|DK|Shadow|DK|18"
			],
			"source": "DK",
			"shortName": "Shadow",
			"className": "Dragon Knight",
			"classSource": "DK"
		}
	]
}