{
	"_meta": {
		"sources": [
			{
				"json": "WMDWS",
				"abbreviation": "WMDWS",
				"full": "Dreamworld Sorcerer",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"name": "Dreamworld Sorcerer",
			"source": "WMDWS",
			"page": 1,
			"shortName": "Dreamworld",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassFeatures": [
				"Dreamworld|Sorcerer||Dreamworld|WMDWS|1",
				"Mischief Maker|Sorcerer||Dreamworld|WMDWS|6",
				"Invoke Nightmare|Sorcerer||Dreamworld|WMDWS|14",
				"Dreamworld|Sorcerer||Dreamworld|WMDWS|18"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Dreamworld",
			"source": "WMDWS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDWS",
			"subclassShortName": "Dreamworld",
			"page": 1,
			"level": 1,
			"entries": [
				"The Dreamworld is a nebulous and unknowable place, ever-changing and ever-shifting. Sorcerers that draw their magic from the realm of dreams are only limited by their imagination. You may have been touched by a powerful entity from the dream realm, or perhaps been born from the dreams of another.",
				"The power of dreams can be used to shape reality. You can alter the dreams of others, and even realize your own dreams into the world around you. This power is tied to your imaginary friend: a powerful companion, guide, or perhaps demon from the Dreamworld.",
				"Often, these sorcerers aim to reshape the world to meet their own ends—taking inspiration from a world-shaking event which occurred in their past, or a steadfast principle which guides their sense of purpose. They may be perceived as being detached or spacey by those around them, and individuals who interact with them are oftentimes startled when the dreamworld sorcerer begins to talk to their imaginary friend.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Imaginary Friend|Sorcerer||Dreamworld|WMDWS|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Sleeping Sands|Sorcerer||Dreamworld|WMDWS|1"
				}
			]
		},
		{
			"name": "Imaginary Friend",
			"source": "WMDWS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDWS",
			"subclassShortName": "Dreamworld",
			"page": 1,
			"level": 1,
			"header": 1,
			"entries": [
				"Starting from when you choose this origin at 1st level, your connection to the Dreamworld forms in the shape of a friend: an imaginary friend. Your imaginary friend takes the form of a Small or Medium creature (your choice), and it always obeys your commands.",
				"Your imaginary friend cannot be seen, interacted with, or noticed by any creature in the physical world. Special sight such as truesight does not aid in viewing your imaginary friend. Likewise, it cannot interact with the physical world itself, nor move further than 100 feet away from you. This range increases to 150 feet at 6th level, 300 feet at 14th level, and 600 feet at 18th level.",
				"It can squeeze through spaces as small as 1-inch in diameter, although it oftentimes doesn’t need to, as it can pass through most barriers without issue. It is restricted, however, if the wall it is passing through is blocked by more than 1-foot of stone, 1-inch of common metal, a thin sheet of lead, or 3-feet of wood or dirt.",
				"While conducting a short or long rest, your imaginary friend watches over you from the realm of dreams, granting your mind safe passage as it voyages through the seas of the other world. You cannot be affected by the spell dream (unless you wish to be), nor any other ability or spell that seeks to affect your dreams. You can also not have nightmares unless you specifically order your imaginary friend not to guard you at night.",
				"In addition, your imaginary friend will keep watch over your unconscious body. If it detects danger, it will inform you via entering your dream and rousing you from your slumber.",
				"Your imaginary friend has a flying speed of 30 feet and can hover, and shares the same passive perception and vision as you do. It cannot be targeted for attacks or effects.",
				"Once per long rest, your imaginary friend can enter the dreams of a nearby sleeping creature. That creature must be within 5-feet of your imaginary friend, and likewise, you must be within range of your imaginary friend. While inside a creature’s dreams, your imaginary friend can choose to perform one of two actions: {@bold message} or {@bold spy}.",
				"While sending a message, your imaginary friend slows down the target’s perception of their time, granting you an audience with the creature they are inhabiting so long as they can dream. You can conduct a conversation with that creature as normal. However, your imaginary friend cannot physically affect anything within that dream (such as changing the dream’s scenery or summoning in objects). In addition, your imaginary friend can only establish a connection as long as one hour before needing to leave the dreamscape. This dream conversation counts as interacting socially with the creature, and as such, the opposing creature is free to make skill checks in order to perceive attempts at deception. If your imaginary friend is required to make a skill check while in the dreamscape, it instead uses your skill modifier.",
				"While attempting to spy, the opposing creature must roll an Intelligence saving throw with a DC equal to your spell save DC. On a failure, you select a topic related to the creature and delve into their mind, attempting to change the topic of their current dream to the topic you selected. Afterwards, your DM informs you of what transpires in the dream with the new topic. This information can pertain to your current mission, the personality and ideologies of the creature, or act as proof for the committing of a crime.",
				"If a creature is unable to dream, or immune to the effects of spells such as dream, then your imaginary friend cannot enter that creature’s dreams. You do not need to expend a use of this feature to gain that knowledge."
			]
		},
		{
			"name": "Sleeping Sands",
			"source": "WMDWS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDWS",
			"subclassShortName": "Dreamworld",
			"page": 1,
			"level": 1,
			"header": 1,
			"entries": [
				"Also starting at 1st level, your inherent connection to the Dreamworld makes it easier to call creatures into the land of slumber. You know the {@spell sleep} spell, which does not count against your number of sorcerer spells known. You can cast this spell by expending a spell slot or by expending 1 sorcery point per level of the spell.",
				"When expending sorcery points to cast {@spell sleep}, the amount of sorcery points you spend must be equal to or below the maximum level of spell you can cast. The die you roll to determine the results of the {@spell sleep} spell increases to d10s at 6th level, d12s at 14th level, and d20s at 18th level."
			]
		},
		{
			"name": "Mischief Maker",
			"source": "WMDWS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDWS",
			"subclassShortName": "Dreamworld",
			"page": 1,
			"level": 6,
			"header": 2,
			"entries": [
				"Starting at 6th level, when you cast the {@spell sleep} spell and a creature would not fall asleep due to immunity to being charmed, you may use your reaction to amplify the spell's effects and have it bypass the creature's immunity to being charmed. You may do this an amount of times equal to your proficiency bonus per long rest. In addition, when you put a creature to sleep as a result of one of your sorcerer spells, features, or another ability or item you possess (such as sleep dust), you can immediately expend 1 sorcerer point to send your imaginary friend into that creature’s dreams. Alternatively, you can expend 2 sorcerer points to target a creature who is already asleep.",
				"While in a creature’s dreams, your imaginary friend blankets their mind with a pleasant, everlasting dream, numbing the sensations and pain from the outside world and rendering their body inert. Loud sounds and other such noises do not wake the creature.",
				"Your imaginary friend can only affect one creature with Mischief Maker at a time. They will be forcefully ejected from that creature’s dream if the creature passes the saving throw, one minute passes, the creature wakes up, the creature dies, or you use a free action to recall your imaginary friend."
			]
		},
		{
			"name": "Invoke Nightmare",
			"source": "WMDWS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDWS",
			"subclassShortName": "Dreamworld",
			"page": 2,
			"level": 14,
			"header": 2,
			"entries": [
				"Starting at 14th level, your imaginary friend gains the ability to distract your foes by delving into the darker arts of the Dreamworld.",
				"When you are targeted for an attack, your imaginary friend can use a reaction to manifest themselves in your assailant’s mind and flash an image of fear and turmoil into their psyche (this does not expend your reaction—only the reaction of your imaginary friend). That creature must succeed on a Wisdom saving throw with a DC equal to your spell save DC. On a failed save, that attack misses you, regardless of the result of the roll. Furthermore, that creature takes an amount of psychic damage equal to half your sorcerer level.",
				"You can use this feature even while your imaginary friend is currently manifesting itself in the mind of a sleeping creature, and you can use it a number of times equal to your proficiency bonus. You regain all expended charges on a long rest."
			]
		},
		{
			"name": "Dreamworld",
			"source": "WMDWS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMDWS",
			"subclassShortName": "Dreamworld",
			"page": 2,
			"level": 18,
			"header": 2,
			"entries": [
				"Starting at 18th level, you are able to manifest the nature of the Dreamworld into the physical world, revoking concepts once thought to be part of common psychics and replacing it with the transcendent nature of your own dreamscape.",
				"You can cast the {@spell mirage arcane} spell at will with the following restriction: the area you can affect becomes 30-feet (as opposed to 1 mile), and you can only use it to manifest a small structure or living space, such as a cabin, a lounge, or a comfortable bed for sleeping. You can only have one 30-foot radius of terrain affected by this {@spell mirage arcane} at once, and it lasts until you dismiss it or recast it as an action.",
				"In addition, you can sanctify your connection to the Plane of Dreams, becoming an arbiter of your own dreamscape as you allow your imagination to flood directly into reality. As an action, you establish a radius to become part of your dreamscape, and for the next minute, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You modify the terrain out to 100-feet around you as though you were using the {@spell mirage arcane} spell. This effect moves with you.",
						"Creatures of your choice who start within this radius must make a Wisdom saving throw or be charmed or frightened by you until the end of their next turn (your choice) as you project an image of their grandeur or of their nightmares. Creatures who pass this save are immune to its effects for 24 hours.",
						"You gain a flying speed of 60 feet and can hover. Your imaginary friend also gains this benefit.",
						"Your imaginary friend can now be seen by other creatures, although it still cannot be targeted for attacks or effects.",
						"As a bonus action, you can swap places with your imaginary friend. If your imaginary friend is currently manifested inside a creature affected by Mischief Maker, you instead appear in an unoccupied space within 5-feet of that creature."
					]
				},
				"Once you use this feature, you cannot use it again until you finish a long rest."
			]
		}
	]
}