{
	"_meta": {
		"sources": [
			{
				"json": "WMFTS",
				"abbreviation": "WMFTS",
				"full": "Fey Touched Sorcerer",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"name": "Fey Touched Sorcerer",
			"source": "WMFTS",
			"page": 1,
			"shortName": "Fey Touched",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassFeatures": [
				"Fey Touched|Sorcerer||Fey Touched|WMFTS|1",
				"Illusory Movement|Sorcerer||Fey Touched|WMFTS|6",
				"Knowledge of the Courts|Sorcerer||Fey Touched|WMFTS|14",
				"Bridge to the Feywild|Sorcerer||Fey Touched|WMFTS|18",
				"Minor Bridge|Sorcerer||Fey Touched|WMFTS|18",
				"Major Bridge|Sorcerer||Fey Touched|WMFTS|18"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Fey Touched",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 1,
			"level": 1,
			"entries": [
				"The innate magic you possess comes from some mingling of Feywild magic into your bloodline. Your ancestors may have bargained with powerful fey, or spent too long living in the Feywild. A trickster fey may even have taken you as a child and placed a spell upon you. Whatever the case, you have been given a variety of faerie magic to wield as your own.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Faerie Court|Sorcerer||Fey Touched|WMFTS|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Court Magic|Sorcerer||Fey Touched|WMFTS|1"
				}
			]
		},
		{
			"name": "Faerie Court",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 1,
			"level": 1,
			"header": 1,
			"entries": [
				"Your magical abilities originate with one of the Feywild's faerie courts: Summer, Spring, Autumn, or Winter, each representing different personalities, philosophies, and appearances based on the state of the world during their respective seasons. At 1st level, you gain proficiency in the nature skill and you choose which court you are aligned with, gaining one of the following proficiencies depending upon your court:",
				{
					"type": "table",
					"colLabels": [
						"Court",
						"Proficiency"
					],
					"rows": [
						[
							"Summer",
							"Intimidation"
						],
						[
							"Spring",
							"Performance"
						],
						[
							"Autumn",
							"Persuasion"
						],
						[
							"Winter",
							"Deception"
						]
					]
				},
				"Regardless of your court, you also gain the ability to speak, read, and write Sylvan."
			]
		},
		{
			"name": "Court Magic",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 1,
			"level": 1,
			"header": 1,
			"entries": [
				"Your magic originates from your court, granting you knowledge of certain spells. At 1st level, you learn the minor illusion cantrip. This does not count against your total number of cantrips known. You also gain access to a number of special spells linked to that court, detailed in the tables on this page. These spells are added to your sorcerer spell list for you.",
				{
					"type": "table",
					"caption": "Summer Court Spell List",
					"colLabels": [
						"Sorcerer Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell hellish rebuke}, {@spell searing smite}"
						],
						[
							"3rd",
							"{@spell flame blade}, {@spell pyrotechnics|xge}"
						],
						[
							"5th",
							"{@spell beacon of hope}, {@spell crusader's mantle}"
						],
						[
							"7th",
							"{@spell fire shield}, {@spell freedom of movement}"
						],
						[
							"9th",
							"{@spell dawn|xge}, {@spell flame strike}"
						]
					]
				},
				{
					"type": "table",
					"caption": "Spring Court Spell List",
					"colLabels": [
						"Sorcerer Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell cause fear|xge}, {@spell faerie fire}"
						],
						[
							"3rd",
							"{@spell calm emotions}, {@spell enthrall}"
						],
						[
							"5th",
							"{@spell conjure animals}, {@spell phantom steed}"
						],
						[
							"7th",
							"{@spell compulsion}, {@spell hallucinatory terrain}"
						],
						[
							"9th",
							"{@spell modify memory}, {@spell mislead}"
						]
					]
				},
				{
					"type": "table",
					"caption": "Autumn Court Spell List",
					"colLabels": [
						"Sorcerer Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell goodberry}, {@spell purify food and drink}"
						],
						[
							"3rd",
							"{@spell healing spirit|xge}, {@spell lesser restoration}"
						],
						[
							"5th",
							"{@spell create food and water}, {@spell spirit guardians}"
						],
						[
							"7th",
							"{@spell aura of life}, {@spell aura of purity}"
						],
						[
							"9th",
							"{@spell awaken}, {@spell circle of power}"
						]
					]
				},
				{
					"type": "table",
					"caption": "Winter Court Spell List",
					"colLabels": [
						"Sorcerer Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell dissonant whispers}, {@spell hex}"
						],
						[
							"3rd",
							"{@spell moonbeam}, {@spell ray of enfeeblement}"
						],
						[
							"5th",
							"{@spell bestow curse}, {@spell hunger of hadar}"
						],
						[
							"7th",
							"{@spell elemental bane|xge}, {@spell mordenkainen's faithful hound}"
						],
						[
							"9th",
							"{@spell destructive wave}, {@spell negative energy flood|xge}"
						]
					]
				}
			]
		},
		{
			"name": "Illusory Movement",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 1,
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, your innate talent for illusion magic begins to blossom. If you cast a spell of 2nd level or higher on your turn, you can use your bonus action to become invisible until the beginning of your next turn.",
				"Once you use this feature, you can't use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Knowledge of the Courts",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 2,
			"level": 14,
			"header": 2,
			"entries": [
				"At 14th level, you undergo significant growth within your court, gaining knowledge of your own innate magic. You gain one of the following abilities depending upon your court.",
				{
					"type": "entries",
					"name": "Summer's Warmth.",
					"entries": [
						"You harbor a fierce spirit within you, and you can embolden it when the need arises. As a bonus action on your turn you can grant yourself the following benefits for up to 1 hour. Once you use this feature, you can’t use it again until you finish a long rest",
						{
							"type": "list",
							"items": [
								"You gain resistance to fire damage.",
								"Your speed increases by 10 feet.",
								"You shed bright light from your body in all directions for 30 feet and dim light for an additional 30 feet.",
								"Allied creatures visible to you within 30 feet are immune to the effects of extreme cold and gain advantage on saving throws made to resist charm effects."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Spring's Love.",
					"entries": [
						"When you charm a creature, you can choose to spend 3 sorcery points to empower that charm. A creature under an empowered charm follows your telepathic commands perfectly as long as it is within 120 feet of you. It believes it is taking all of its actions of its own free will. When an empowered charm ends, you can choose whether the target knows that it was charmed or not. An empowered charm does not change the duration or saving throws of the charm effect. Once you use this feature, you can’t use it again until you finish a long rest."
					]
				},
				{
					"type": "entries",
					"name": "Autumn's Bounty.",
					"entries": [
						"You can conjure a small feast of food and drink as an action on your turn. The magical feast appears as normal food and is enough for up to four small or medium creatures. When a creature that is not hostile to you consumes any of the food or drink, they must succeed on a Wisdom saving throw or become charmed by you for up to 1 hour. This effect ends if the creature is attacked by you or your allies. Once you use this feature, you can’t use it again until you finish a long rest."
					]
				},
				{
					"type": "entries",
					"name": "Winter's Grasp.",
					"entries": [
						"As an action on your turn you can spend 3 sorcery points to chill a creature you can see within 90 feet until the beginning of your next turn. A chilled creature has disadvantage on Dexterity saving throws and must succeed on a Constitution saving throw against your spell save DC or be forced to use all of its movement to seek warmth on its turn. If the creature is immersed in water or soaking wet as if they had recently been immersed in water, it instead becomes frozen on a failed save and is paralyzed until the beginning of your next turn. Once you use this feature, you can’t use it again until you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Bridge to the Feywild",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 2,
			"level": 18,
			"header": 2,
			"entries": [
				"By 18th level, your fey magic has manifested fully, and your powerful magic allows you to create bridges between the material plane and the Feywild."
			]
		},
		{
			"name": "Minor Bridge",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 2,
			"level": 18,
			"header": 2,
			"entries": [
				"As an action on your turn you can call fey creatures to your aid, summoning 1d4 pixies, 1d4 sprites, or 1d2 quicklings from a small planar portal within 15 feet of you. They understand Sylvan and will obey your first command to the best of their abilities. Any commands after the first will require a successful DC 14 Charisma (persuasion) check. On a failed check the fey will act of their own accord, returning to the Feywild, causing havoc on the material, or continuing to listen to you as they see fit. The fey will inevitably get bored and begin to defy you after 10 minutes and will attempt to escape your company, even after they have been given a command.",
				"Once you use this feature you must finish a long rest before you can use it again."
			]
		},
		{
			"name": "Major Bridge",
			"source": "WMFTS",
			"className": "Sorcerer",
			"classSource": "PHB",
			"subclassSource": "WMFTS",
			"subclassShortName": "Fey Touched",
			"page": 2,
			"level": 18,
			"header": 2,
			"entries": [
				"You can choose to use this interplanar magic along with a powerful ritual to cover a larger area. If you are within a forest, you can spend 4 hours conducting a ritual to bridge that forest to the Feywild. All forested area within 1 mile of the ritual are linked to the Feywild for 24 hours. You can repeat this ritual once each day for three months in the same place to make effect last permanently, or until it is dispelled by a 9th level dispel magic, or wish spell.",
				"The appearance of the forest changes to suit your court. A Winter Court Sorcerer could create a forest that reflects the Feywild's dark and cold corners, while one of the Autumn would be colorful and filled with a bounty of fruit and plants.",
				"The magic of this forest flows freely, making it hard to navigate. All creatures other than you who attempt to travel through this forest must succeed on a Wisdom saving throw against your spell save DC or become magically lost. If you are within the forest, you know the location of any foreign creatures within it. If a creature fails its saving throw and becomes magically lost, you can choose to alter illusory paths and guide it to any location within the forest as long as it continues to travel. You can do this from anywhere within the forest.",
				"Additionally, all spells of the enchantment and illusion schools cast while within this forest are empowered; saves made to resist their effects are always made at disadvantage.",
				"Fey creatures flock to this new and different location, assisting you at your call. Once each day as an action, you can summon 1d12 sprites, 1d12 pixies, or 1d10 quicklings, each of which will obey your every command for 24 hours. These fey can leave the forest, but will always return after 24 hours.",
				"You can only have one forest affected in this way at any given time.",
				{
					"type": "inset",
					"name": "The Faerie Courts",
					"entries": [
						"Each of the Faerie Courts represent different traits and flaws, and each court can appear different to reflect this. Sorcerers touched by one of the courts may take on certain attributes based on their court heritage.",
						"{@bold The Fey of the Autumn Court} are patient, reflective, and wise, using their magic to help others. A Sorcerer of this court may appear older than they are, act gently towards others, or exude an air of calm when they are near.",
						"{@bold The Fey of the Winter Court} are aloof, harsh and unforgiving, and its members can debilitate others with their magic. A Sorcerer of this court may have grey-blue skin, act coldly towards others, or naturally chill the air around them.",
						"{@bold The Fey of the Spring Court} are cheerful, optimistic and witty, often employing illusions and trickery for fun as well as combat. A Sorcerer of this court may have a young, glowing complexion, be overly enthusiastic, or spread joy simply through their presence.",
						"{@bold The Fey of the Summer Court} are fierce, bold and passionate, employing powerful offensive and defensive magic. A Sorcerer of this court may appear to glow a soft crimson, suffer from bouts of fierce anger, or feel warm to the touch."
					]
				}
			]
		}
	]
}