{
	"_meta": {
		"sources": [
			{
				"json": "WMGlamour",
				"abbreviation": "WMGB",
				"full": "Glamour Bard",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"version": "1.0.0",
			"name": "College of Glamour",
			"subclassTitle": "Bard College",
			"subclassFeatures": [
				"College of Glamour|Bard||Glamour (Revised)|WMGlamour|3",
				"Mantle of Majesty|Bard||Glamour (Revised)|WMGlamour|6",
				"Unbreakable Majesty|Bard||Glamour (Revised)|WMGlamour|14"
			],
			"source": "WMGlamour",
			"shortName": "Glamour (Revised)",
			"className": "Bard",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "College of Glamour",
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 3,
			"entries": [
				"The College of Glamour is the home of bards who mastered their craft in the vibrant realm of the Feywild or under the tutelage of someone who dwelled there. Tutored by satyrs, eladrin, and other fey, these bards learn to use their magic to delight and captivate others.",
				"The bards of this college are regarded with a mixture of awe and fear. Their performances are the stuff of legend. These bards are so eloquent that a speech or song that one of them performs can cause captors to release the bard unharmed and can lull a furious dragon into complacency. The same magic that allows them to quell beasts can also bend minds. Villainous bards of this college can leech off a community for weeks, misusing their magic to turn their hosts into thralls. Heroic bards of this college instead use this power to gladden the downtrodden and undermine oppressors.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Mantle of Inspiration|Bard||Glamour (Revised)|WMGlamour|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Enthralling Performance|Bard||Glamour (Revised)|WMGlamour|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "Mantle of Inspiration",
			"entries": [
							"When you join the College of Glamour at 3rd level, you gain the ability to weave a song of fey magic that imbues your allies with vigor and speed.",
							"As a bonus action, you can expend one use of your Bardic Inspiration to grant yourself a wondrous appearance. When you do so, choose a number of creatures you can see and that can see you within 60 feet of you, up to a number equal to your Charisma modifier (minimum of one). Each of them gains 5 temporary hit points. When a creature gains these temporary hit points, it can immediately use its reaction to move up to its speed, without provoking opportunity attacks.",
							"The number of temporary hit points increases when you reach certain levels in this class, increasing to 8 at 5th level, 11 at 10th level, and 14 at 15th level."
						],
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Enthralling Performance",
			"entries": [
							"Starting at 3rd level, you can charge your performance with seductive, fey magic.",
							"If you perform for at least 1 minute, you can attempt to inspire wonder in your audience by singing, reciting a poem, or dancing. At the end of the performance, choose a number of creatures with an Intelligence score of 6 or higher within 60 feet of you who watched and listened to all of it, up to a number equal to your Charisma modifier (minimum of one). Each target must succeed on a Wisdom saving throw against your spell save DC or be {@condition charmed} by you. While {@condition charmed} in this way, the target idolizes you, it speaks glowingly of you to anyone who talks to it, and it hinders anyone who opposes you, although it avoids violence unless it was already inclined to fight on your behalf. This effect ends on a target after 1 hour, if it takes any damage, if you attack it, or if it witnesses you attacking or damaging any of its allies.",
							"If a target succeeds on its saving throw, the target has no hint that you tried to charm it.",
							"Once you use this feature, you can't use it again until you finish a short or long rest."
						],
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 3,
			"header": 1
		},
		{
			"name": "Mantle of Majesty",
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 6,
			"header": 2,
			"entries": [
							"At 6th level, you gain the ability to cloak yourself in a fey magic that makes others want to serve you. As a bonus action, you cast {@spell command}, without expending a spell slot, and you take on an appearance of unearthly beauty for 1 minute or until your concentration ends (as if you were concentrating on a spell). During this time, you can cast {@spell command} as a bonus action on each of your turns, without expending a spell slot.",
							"Any creature {@condition charmed} by you automatically fails its saving throw against the {@spell command} you cast with this feature.",
							"Once you use this feature, you can't use it again until you finish a long rest."
						
						]
		},
		{
			"name": "Unbreakable Majesty",
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 14,
			"header": 2,
			"entries": [
							"At 14th level, your appearance permanently gains an otherworldly aspect that makes you look more lovely and fierce.",
							"In addition, as a bonus action, you can assume a magically majestic presence for 1 minute or until you are {@condition incapacitated}. For the duration, whenever any creature tries to attack you for the first time on a turn, the attacker must make a Charisma saving throw against your spell save DC. On a failed save, it can't attack you on this turn, and it must choose a new target for its attack or the attack is wasted. On a successful save, it can attack you on this turn, but it has disadvantage on any saving throw it makes against your spells on your next turn.",
							"Once you assume this majestic presence, you can't do so again until you finish a short or long rest."
					
				
			]
		}
	]
}