{
	"_meta": {
		"sources": [
			{
				"json": "WMGlamour",
				"abbreviation": "WMGB",
				"full": "Glamour Bard",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"version": "1.0.0",
			"name": "College of Glamour",
			"subclassTitle": "Bard College",
			"source": "WMGlamour",
			"shortName": "Glamour (Revised)",
			"additionalSpells": [
				{
					"known": {
						"3": [
							"charm person",
							"mirror image"
						],
						"6": [
							"command"
						]
					}
				}
			],
			"subclassSpells": [
				"charm person",
				"mirror image",
				"command"
			],
			"subclassFeatures": [
				"College of Glamour|Bard||Glamour (Revised)|WMGlamour|3",
				"Mantle of Majesty|Bard||Glamour (Revised)|WMGlamour|6",
				"Unbreakable Majesty|Bard||Glamour (Revised)|WMGlamour|14"
			],
			"className": "Bard",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "College of Glamour",
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 3,
			"entries": [
				"The College of Glamour is the home of bards who mastered their craft in the vibrant realm of the Feywild or under the tutelage of someone who dwelled there. Tutored by satyrs, eladrin, and other fey, these bards learn to use their magic to delight and captivate others.",
				"The bards of this college are regarded with a mixture of awe and fear. Their performances are the stuff of legend. These bards are so eloquent that a speech or song that one of them performs can cause captors to release the bard unharmed and can lull a furious dragon into complacency. The same magic that allows them to quell beasts can also bend minds. Villainous bards of this college can leech off a community for weeks, misusing their magic to turn their hosts into thralls. Heroic bards of this college instead use this power to gladden the downtrodden and undermine oppressors.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Mantle of Inspiration|Bard||Glamour (Revised)|WMGlamour|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Beguiling Magic|Bard||Glamour (Revised)|WMGlamour|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "Mantle of Inspiration",
			"entries": [
							"When you join the College of Glamour at 3rd level, you gain the ability to weave a song of fey magic that imbues your allies with vigor and speed.",
							"You can weave fey magic into a song or dance to fill others with vigor. As a Bonus Action, you can expend a use of Bardic Inspiration, rolling a Bardic Inspiration die. When you do so, choose a number of other creatures within 60 feet of yourself, up to a number equal to your Charisma modifier (minimum of one creature). Each of them gains a number of Temporary Hit Points equal to 2 times the number rolled on the Bardic Inspiration die, and then each of them can use its Reaction to move up to its Speed without provoking Opportunity Attacks."
						],
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Beguiling Magic",
			"entries": [
							"Also at 3rd level, you always have the {@spell Charm Person} and {@spell Mirror Image} spells prepared.",
							"In addition, immediately after you cast an Enchantment or Illusion spell, you can cause a creature you can see within 60 feet of yourself to make a Wisdom saving throw against your Spell Save DC. On a failed save, the target has the {@condition Charmed} or {@condition Frightened} condition (your choice) for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
							"Once you use this benefit, you can’t use it again until you finish a Long Rest. You can also restore your use of the feature by expending one use of your Bardic Inspiration (no action required)."
						],
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 3,
			"header": 1
		},
		{
			"name": "Mantle of Majesty",
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 6,
			"header": 2,
			"entries": [
							"At 6th level, you always have the {@spell Command} spell prepared.",
							"As a Bonus Action, you cast {@spell Command} without expending a spell slot, and you take on an unearthly appearance for 1 minute or until your Concentration ends (as if you were concentrating on a spell). During this time, you can cast {@spell Command} as a Bonus Action without expending a spell slot.",
							"Any creature {@condition Charmed} by you automatically fails its saving throw against the {@spell Command} you cast with this feature.",
							"Once you use this feature, you can’t use it again until you finish a Long Rest. You can also restore your use of the feature by expending a spell slot of 3rd level or higher (no action required)."
						]
		},
		{
			"name": "Unbreakable Majesty",
			"source": "WMGlamour",
			"page": 51,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Glamour (Revised)",
			"subclassSource": "WMGlamour",
			"level": 14,
			"header": 2,
			"entries": [
							"At 14th level, your appearance permanently gains an otherworldly aspect that makes you look more lovely and fierce.",
							"As a Bonus Action, you can assume a magically majestic presence for 1 minute or until you have the {@condition Incapacitated} condition. For the duration, whenever any creature hits you with an attack roll for the first time on a turn, the attacker must succeed on a Charisma saving throw against your Spell Save DC, or the attack misses instead, as the creature recoils from your majesty.",
							"Once you assume this majestic presence, you can’t do so again until you finish a Short Rest or Long Rest."
					
				
			]
		}
	]
}