{
	"_meta": {
		"sources": [
			{
				"json": "WMGunslingerRogue",
				"abbreviation": "WMGR",
				"full": "Gunslinger Rogue",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"version": "1.0.0",
			"name": "Gunslinger",
			"subclassTitle": "Roguish Archetype",
			"subclassFeatures": [
				"Gunslinger|Rogue||Gunslinger|WMGunslingerRogue|3",
				"Quick and Quiet|Rogue||Gunslinger|WMGunslingerRogue|9",
				"Practiced Sniper|Rogue||Gunslinger|WMGunslingerRogue|13",
				"Ballistics Advantage|Rogue||Gunslinger|WMGunslingerRogue|17"
			],
			"source": "WMGunslingerRogue",
			"shortName": "Gunslinger",
			"className": "Rogue",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "Gunslinger",
			"source": "WMGunslingerRogue",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Gunslinger",
			"subclassSource": "WMGunslingerRogue",
			"level": 3,
			"entries": [
				"Most rogues and specialists spend their years of expertise on learning a specific skill-set, whether that be assassination, thievery, or courtroom dialogue. However, what is arguably the most deadly is a rogue who has devoted themselves in their entirety to the act of researching weapons - exposive weapons.",
				"This archetype focuses on key points that the Fighter variant does not. Namely, less focus on the crafting of unique firearms and more emphasis on the act of utilizing existing ones; exploiting weaknesses in your opponent has never been easier than with the Gunslinger Rogue.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Firearm Proficiency|Rogue||Gunslinger|WMGunslingerRogue|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Careful Aim|Rogue||Gunslinger|WMGunslingerRogue|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "Firearm Proficiency",
			"entries": [
							"Starting when you choose this archetype at 3rd level, you gain proficiency with firearms, allowing you to add your proficiency bonus to attacks made with firearms. Also, you gain proficiency with Tinker's Tools."
						],
			"source": "WMGunslingerRogue",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Gunslinger",
			"subclassSource": "WMGunslingerRogue",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Careful Aim",
			"entries": [
							"When you choose this archetype at 3rd level, your Steady Aim improves. When you aim while wielding a firearm, decrease that firearm's misfire value by 1 until the end of your turn. In addition, if your weapon misfires, you can use a reaction to prevent it from jamming using your finesse. You can only use your reaction this way a number of times equal to your proficiency bonus, and regain all expended uses on a short or long rest."
						],
			"source": "WMGunslingerRogue",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Gunslinger",
			"subclassSource": "WMGunslingerRogue",
			"level": 3,
			"header": 1
		},
		{
			"name": "Quick and Quiet",
			"source": "WMGunslingerRogue",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Gunslinger",
			"subclassSource": "WMGunslingerRogue",
			"level": 9,
			"header": 2,
			"entries": [
							"Starting at 9th level, you have learned to modify your weapon to suppress it as quietly as possible, and be quick enough to gain the upper hand in a fight. You can now add half of your proficiency bonus, rounded down, to your initiative rolls.",
							"You may attach or remove a suppressor as an item interaction once per turn. Whenever you make an attack while under the {@action Hide} action, you may choose to fire a suppresed shot from your firearm. If you do so, regardless of whether you hit or miss your target, you do not give away your location. Suppressed shots fired this way lower your Sneak Attack die by half (rounded down).",
							"You cannot use this feature unless your suppressor is attached to a firearm you are wielding, while you are within 15 feet of your target, nor can you use it alongside a firearm with the Explosive or Scatter properties."
						]
		},
		{
			"name": "Practiced Sniper",
			"source": "WMGunslingerRogue",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Gunslinger",
			"subclassSource": "WMGunslingerRogue",
			"level": 13,
			"header": 2,
			"entries": [
							"Starting at 13th level, your firearm attacks score a critical hit on a roll of 19-20, and making a critical strike with a firearm activates your Sneak Attack feature, regardless of whether you had advantage or not. Additionally, when you aim while wielding a firearm, you may reload one bullet into your gun."
						]
		},
		{
			"name": "Ballistics Advantage",
			"source": "WMGunslingerRogue",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Gunslinger",
			"subclassSource": "WMGunslingerRogue",
			"level": 17,
			"header": 2,
			"entries": [
							"At 17th level, your shots have become extremely precise with your innate knowledge of firearms and ballistics. When you make an attack with a suppressed firearm, you can add your Sneak Attack dice normally instead of half. You can do this a number of times equal to your proficiency bonus, and regain all expended uses on a long rest."
						]
		}
	]
}