{
	"_meta": {
		"sources": [
			{
				"json": "WMHiddenOne",
				"abbreviation": "WMHOW",
				"full": "Hidden One Patron",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"name": "The Hidden One Patron",
			"shortName": "Hidden One",
			"source": "WMHiddenOne",
			"subclassSpells": [
				"Command",
				"Sanctuary",
				"Blindness/Deafness",
				"Enhance Ability",
				"Clairvoyance",
				"Haste",
				"Greater Invisibility",
				"Mordenkainen's Private Sanctum",
				"Modify Memory",
				"Wall of Force"
			],
			"subclassFeatures": [
				"The Hidden One|Warlock||Hidden One|WMHiddenOne|1",
				"Hidden Magics|Warlock||Hidden One|WMHiddenOne|6",
				"Fear No Mortals|Warlock||Hidden One|WMHiddenOne|10",
				"Knowledge Overwhelming|Warlock||Hidden One|WMHiddenOne|14"
			],
			"className": "Warlock",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "The Hidden One",
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 1,
			"entries": [
				"Your patron has a vested interest in the affairs of mortal life. Be it a powerful dragon of the Chamber, a Lord of Dust, or another immortal creature dedicated to manipulating the Draconic Prophecy, you are their hands and eyes in the cities of Khorvaire and beyond.",
				"Anyone could be an agent of one of the Hidden Ones—the baker down the street, the savvy Cannith tinker who comes to your village every month or two, or the noble lord's daughter, eyes burning with curiosity. Warlocks of the Hidden One might be chosen due to their important positions, with influence to change nations through seemingly insignificant actions. However, the innocuous figure of a servant or simple guard is easily ignored, and their ranks might include a warlock of the Hidden One, with eyes ever-open.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Expanded Spell List|Warlock||Hidden One|WMHiddenOne|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Unseen Agent|Warlock||Hidden One|WMHiddenOne|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Discover Weakness|Warlock||Hidden One|WMHiddenOne|1"
				}
			]
		},
		{
			"type": "entries",
			"name": "Expanded Spell List",
			"entries": [
				"The Hidden One lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
				{
					"type": "table",
					"caption": "Hidden One Expanded Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-3 text-center",
						"col-9"
					],
					"rows": [
						[
							"1st",
							"{@spell command}, {@spell sanctuary}"
						],
						[
							"2nd",
							"{@spell blindness/deafness}, {@spell enhance ability}"
						],
						[
							"3rd",
							"{@spell clairvoyance}, {@spell haste}"
						],
						[
							"4th",
							"{@spell greater invisibility}, {@spell mordenkainen's private sanctum}"
						],
						[
							"5th",
							"{@spell modify memory}, {@spell wall of force}"
						]
					]
				}
			],
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 1,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Unseen Agent",
			"entries": [
				"Starting at 1st level, you acknowledge that your patron chose you for your cunning mind, not your social skills. Intelligence becomes your warlock spellcasting ability, instead of Charisma. Any warlock class feature that usually uses your Charisma modifier now uses your Intelligence modifier instead",
				"Additionally, instead of gaining proficiency in Charisma saving throws as a warlock class feature, you instead gain proficiency in Intelligence saving throws. If you wish to multiclass into this subclass, you must have an Intelligence score of 13 instead of Charisma."
			],
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 1,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Discover Weakness",
			"entries": [
				"At 1st level, you have keen insight into the targets of your spells. Whenever a creature fails a saving throw against a warlock spell you cast of 1st level or higher, you learn your choice of the creature's highest or lowest saving throw and its value. As a reaction, you can more closely analyze the target, choosing to either learn all of the creature's condition immunities, or to learn all of its damage resistances, immunities, and vulnerabilities."
			],
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 1,
			"header": 1
		},
		{
			"name": "Hidden Magics",
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 6,
			"header": 2,
			"entries": [
				"Starting at 6th level, your benefactor imbues you with an ability to know the unknowable and to tap power far beyond your limits. You gain a pool of hidden magic points that you can use to cast a spell from the Hidden One Expanded Spells table at its lowest level, even if you do not know it.",
				"You can expend 1 hidden magic point per level of the Hidden One spell you are casting. When you do so, you cast the spell at its lowest level without expending a spell slot and without any components.",
				"Your number of hidden magic points is equal to your Intelligence modifier. A hidden magic point is expended when you use it, and you regain all of your expended hidden magic points when you finish a long rest."
			]
		},
		{
			"name": "Fear No Mortals",
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 10,
			"header": 2,
			"entries": [
				"Beginning at 10th level, your patron shows you the true meaning of fear, but you have learned how to accept it, then turn it back on its maker. You are immune to being frightened.",
				"Additionally, as a reaction to a creature attempting to frighten you, you can turn the fear on it instead, causing the creature to make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is frightened of you for 1 minute. It may repeat the save at the end of its turn, ending the effect on a successful save."
			]
		},
		{
			"name": "Knowledge Overwhelming",
			"source": "WMHiddenOne",
			"page": 105,
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Hidden One",
			"subclassSource": "WMHiddenOne",
			"level": 14,
			"header": 2,
			"entries": [
				"Starting at 14th level, you can unleash a magical wave of pure knowledge to overwhelm the minds of lesser beings. As an action, you can cause up to five creatures within 30 feet of you to make an Intelligence saving throw. On a failed save, a creature takes psychic damage equal to {@dice 4d8} plus your Intelligence modifier, and it is stunned until the end of its next turn. On a successful save, it takes half damage and is not stunned.",
				"Once you use this feature, you can't use it again until you finish a short or long rest."
			]
		}
	]
}