{
	"_meta": {
		"sources": [
			{
				"json": "WMMountainMan",
				"abbreviation": "WMMMR",
				"full": "Mountain Man Ranger",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"version": "1.0.0",
			"name": "Mountain Man",
			"subclassTitle": "Ranger Archetype",
			"subclassFeatures": [
				"The Mountain Man|Ranger||Mountain Man|WMMountainMan|3",
				"Mountain's Resolve|Ranger||Mountain Man|WMMountainMan|7",
				"Mountain's Mundanity|Ranger||Mountain Man|WMMountainMan|11",
				"Mountain's Grasp|Ranger||Mountain Man|WMMountainMan|15"
			],
			"source": "WMMountainMan",
			"shortName": "Mountain Man",
			"additionalSpells": [
				{
					"prepared": {
						"3": [
							"feather fall"
						],
						"5": [
							"maximilian's earthen grasp"
						],
						"9": [
							"erupting earth"
						],
						"13": [
							"fabricate"
						],
						"17": [
							"transmute rock"
						]
					}
				}
			],
			"className": "Ranger",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "The Mountain Man",
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 3,
			"entries": [
				"The Mountain Men are an often forgotten sect of Rangers, the Mountain Men often isolating themselves within the most treacherous of Mountains. Only venturing out when they absolutely need to, or when chaos and disorder manifest themselves within the region their Mountain oversees. They are self reliant, enduring, and resourceful, having mastered how to make whatever they need from the base materials nature provides. It’s speculated that the Mountain Men have managed to develop their own forges and workstations within the Mountains, though this has never been confirmed. Despite the name, the Mountain Men have been observed to possess all manners of individuals within their ranks. It seems as if the Mountain Men judge by one’s will, resourcefulness, and endurance over all.",
				"Each Mountain Man has their own specialized hunting rifle, a weapon they’ve adopted and refined to deadly perfection. Legends and stories are often told of the rangers who strike from near unthinkable distances, striking fear into any who would disturb the balance. Many speculate that the Mountain Men are mere mythos, but those who have made the mistake of tangling with them know better, and will never repeat such a mistake again.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "This Is My Rifle, This Is My Gun|Ranger||Mountain Man|WMMountainMan|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Mountain's Secrets|Ranger||Mountain Man|WMMountainMan|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Mountain Man Magic|Ranger||Mountain Man|WMMountainMan|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "This Is My Rifle, This Is My Gun",
			"entries": [
				"At 3rd level, your extensive training, tinkering, and sheer will have resulted in you finally being able to craft your own signature hunting rifle. Every part of it is personalized to you and you alone. Weighted perfectly, the grip shaped to your own hand, the sights honed in just how you like it, and the material being that which you adore most. Whether it be for cosmetic reasons, or simply so you don’t chafe your hands as much, it doesn’t matter. This signature hunting rifle is yours, and yours alone.",
				"You gain proficiency in your signature hunting rifle, which is a firearm that deals 1d12 piercing damage with a range of 300 / 900 feet. It has the ammunition and two-handed property, a misfire score of (2), and a reload score of (2). Should you ever acquire a magical ranged weapon, you may strip that weapon of its core parts and learn how to transfer its magics or parts from it to your signature hunting rifle. The original magical ranged weapon is destroyed in this process, however.",
				"If another creature attempts to use your signature hunting rifle, they suffer disadvantage on all attack rolls made with it, as the rifle has not been designed to their exact specifications."
			],
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Mountain's Secrets",
			"entries": [
				"Also starting at 3rd level, your time spent alone within the Mountain has revealed to you what modifications you need to make to be at peak efficiency, and through pure trial and error, you’ve learned how to craft them with the most barebones of materials. You may exchange modifications whenever you take a short or long rest, though you may only have one modification active at a time. Should you make another modification while the previous one is active, the oldest modification is scavenged for parts. You may make and equip an additional modification once you reach 7th level, and gain another at 15th level.",
				{
					"type": "list",
					"items": [
						"{@b River's Scope.} You’ve made your very own scope, having used the sand you extracted from the riverbeds to make the glass necessary, with the base material for the scope either having been welded from the metal within the mountain, or painstakingly crafted from hardwood. Your normal and long range increase by 150 feet, and you no longer suffer disadvantage on attacks made beyond your normal range with your signature hunting rifle.",
						"{@b Forest's Bipod.} You’ve crafted your very own bipod out of the finest wood the forest could provide, making it light, durable, and effective. When you are prone, you no longer suffer disadvantage on attack rolls made with your signature hunting rifle, and attacks made with your signature hunting rifle now score a critical hit on a roll of 19 or 20 while you are prone.",
						"{@b Mountain's Stock.} You’ve fortified the stock of your signature hunting rifle with the various stones and metals found within the mountain, making your weapon both stable, and a deadly weapon up close. Your misfire score while wielding this rifle is reduced by 1, and you may make a melee attack that you are proficient with against a creature within your reach as you bash them with the butt of your rifle. This attack uses Strength for its attack and damage rolls, and deals {@dice 1d10} bludgeoning damage on a successful hit. In addition, on a successful hit, the target must make a Strength saving throw equal to your Ranger spell save DC or be knocked back five feet.",
						"{@b Stone's Grasp.} You’ve fitted a modification painstakingly carved from stone onto the underbarrel of your signature hunting rifle, chiseling it to perfection as you’ve managed to make a grappling hook dubbed the Stone’s Grasp. The line of this hook is made out of plant fibre, the hook itself also made of stone, though it flies as well as any other. When you take the Attack action, you may forgo an attack to launch your grappling hook at a point within 60 feet of you. The grappling hook embeds itself within any purchase it can find, fortifying itself immediately after. You and any creature may climb up this rope if they are able. In addition, if you shoot it towards a creature, they must make a Strength saving throw equal to your Ranger spell save DC on a successful hit. On a failure, they are pulled 15 feet towards you. You may reel in your grappling hook as an item interaction.",
						"{@b Field's Providence.} You’ve learned from the providence and bounty the fields of Kagrea provide, modifying the internal mechanical workings of your hunting rifle with tightly wound and bundled wheat and grass. As such, you’ve managed to free up more space within your rifle, allowing it to hold even more ammunition. Your reload score is increased by 1. The wondrous bounty of the fields of Kagrea have also taught you how to be further in tune with nature and all its creatures, allowing you to notice and appreciate the simple things. You now have advantage on Intelligence (Nature) checks."
					]
				}
			],
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Mountain Man Magic",
			"entries": [
				"As a Mountain Man you learn an additional spell when you reach certain levels in this class, as shown in the Mountain Man Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
				{
					"type": "table",
					"caption": "Mountain Man Spells",
					"colLabels": [
						"Ranger Level",
						"Spell"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"3rd",
							"{@spell feather fall}"
						],
						[
							"5th",
							"{@spell maximilian's earthen grasp|XGE}"
						],
						[
							"9th",
							"{@spell erupting earth|XGE}"
						],
						[
							"13th",
							"{@spell fabricate}"
						],
						[
							"17th",
							"{@spell transmute rock|XGE}"
						]
					]
				}
			],
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 3,
			"header": 1
		},
		{
			"name": "Mountain's Resolve",
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 7,
			"header": 2,
			"entries": [
				"At 7th level, the inner truths of the Mountain’s endurance and resolve instill themselves more deeply within your soul. You may cast the spell {@spell stoneskin}, without expending a spell slot or needing its material components. The spell is also not concentration for you, though the Mountain can only help you sustain this form for 1 minute.",
				"Once you use this ability, you cannot use it again until you complete a short or long rest."
			]
		},
		{
			"name": "Mountain's Mundanity",
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 11,
			"header": 2,
			"entries": [
				"At 11th level, you’ve learned another secret of the Mountain. The art of being within plain sight, yet hidden nonetheless as you blend into the natural landscape. Whenever you use a bonus action on your turn to use your Nature's Veil feature, you may hide yourself within an object or natural terrain large enough to hold you. While you are hidden in this way, you are treated as having total cover, though your senses still allow you to see as if you were outside the object or natural terrain. Creatures have disadvantage on Wisdom (Perception) checks to notice you, and you emerge from the object or natural terrain when you make an attack into an unoccupied space within five feet of you.",
				"You may use this feature an amount of times equal to your proficiency bonus, regaining any expended uses on the completion of a short or long rest."
			]
		},
		{
			"name": "Mountain's Grasp",
			"source": "WMMountainMan",
			"page": 89,
			"className": "Ranger",
			"classSource": "PHB",
			"subclassShortName": "Mountain Man",
			"subclassSource": "WMMountainMan",
			"level": 15,
			"header": 2,
			"entries": [
				"At 15th level, you’ve learned to call upon the very Mountain itself to grasp and swallow creatures you wish to protect, or demolish. As a reaction to an attack being made against you within 120 feet of you, you can call upon the Mountain to swallow your attacker into the earth. The target creature must make a Strength saving throw equal to your Ranger spell save DC or be dragged into the depths of the Mountain. While in the Mountain’s depths, the creature is blinded, restrained, and treated as having total cover. The creature is spat out by the mountain at the end of their next turn, reappearing in the space they were originally in, or the closest unoccupied space if need be.",
				"As a reaction to an allied creature within 120 feet of you taking damage, you can have the Mountain swallow them into the depths, protecting them from further harm. When you do so, the creature is treated as having had resistance to the triggering damage. They are also then considered to be blinded, restrained, and treated as having total cover. The allied creature then reappears in the space they were in previously at the start of their next turn, reappearing in the space they were originally in, or the closest unoccupied space if need be. This may also be used on yourself.",
				"You may use this feature an amount of times equal to your proficiency bonus, regaining any expended uses upon the completion of a long rest."
			]
		}
	]
}