{
	"_meta": {
		"sources": [
			{
				"json": "WMOctoperior",
				"abbreviation": "WMOA",
				"full": "Octoperior Artificer",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"version": "1.0.0",
			"name": "Octoperior",
			"subclassFeatures": [
				"Octoperior|Artificer|TCE|Octoperior|WMOctoperior|3",
				"Extra Attack|Artificer|TCE|Octoperior|WMOctoperior|5",
				"Tentacle Upgrades|Artificer|TCE|Octoperior|WMOctoperior|9",
				"Superior Upgrades|Artificer|TCE|Octoperior|WMOctoperior|15"
			],
			"source": "WMOctoperior",
			"shortName": "Octoperior",
			"additionalSpells": [
				{
					"prepared": {
						"3": [
							"entangle",
							"zephyr strike"
						],
						"5": [
							"earthbind",
							"vortex warp"
						],
						"9": [
							"haste",
							"erupting earth"
						],
						"13": [
							"grasping vine",
							"fire shield"
						],
						"17": [
							"bigby's hand",
							"far step"
						]
					}
				}
			],
			"className": "artificer",
			"classSource": "TCE"
		}
	],
	"subclassFeature": [
		{
			"name": "Octoperior",
			"source": "WMOctoperior",
			"page": 9,
			"className": "artificer",
			"classSource": "TCE",
			"subclassShortName": "Octoperior",
			"subclassSource": "WMOctoperior",
			"level": 3,
			"entries": [
				"An artificer who specializes as an Octoperior uses a special harness which allows them to control additional tentacle-like arms. The arms extend the reach of their wearer and allow them to manipulate hazardous materials from a distance. Such artificers believe that such technology is the future, and seek for all to be augmented to strive for the next state of human evolution.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Tools of the Trade|Artificer|TCE|Octoperior|WMOctoperior|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Mechanical Arms|Artificer|TCE|Octoperior|WMOctoperior|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "Tools of the Trade",
			"entries": [
				"When you adopt this specialization at 3rd level, you gain proficiency with smith's tools. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice.",
				{
					"type": "table",
					"caption": "Octoperior Spells",
					"colLabels": [
						"Artificer Level",
						"Spell"
					],
					"colStyles": [
						"col-3 text-center",
						"col-9"
					],
					"rows": [
						[
							"3rd",
							"{@spell entangle}, {@spell zephyr strike|XGE}"
						],
						[
							"5th",
							"{@spell earthbind|XGE}, {@spell vortex warp|SCC}"
						],
						[
							"9th",
							"{@spell haste}, {@spell erupting earth|XGE}"
						],
						[
							"13th",
							"{@spell grasping vine}, {@spell fire shield}"
						],
						[
							"17th",
							"{@spell bigby's hand}, {@spell far step|XGE}"
						]
					]
				}
			],
			"source": "WMOctoperior",
			"page": 51,
			"className": "artificer",
			"classSource": "TCE",
			"subclassShortName": "Octoperior",
			"subclassSource": "WMOctoperior",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Mechanical Arms",
			"entries": [
				"Upon reaching 3rd level, you've constructed for yourself a harness which has four tentacle-like arms attached to it. The arms provide the following additional benefits:",
				{
					"type": "list",
					"items": [
						"You can control these mechanical arms as if they were your own arms, able to manipulate and hold objects and weapons as normal, but you cannot gain the benefit of using a shield held by these arms. You may also use these arms to make and maintain a grapple, using your Strength (Athletics) as per normal grappling. You still can only grapple one creature at a time with each arm.",
						"When you use these mechanical arms, their reach is 10 feet instead of 5 feet. This does not apply to attacks made with weapons other than your mechanical arm strikes.",
						"Each mechanical arm can carry up to a number of pounds equal to 10 times your Artificer level.",
						"Each of the mechanical arms counts as a simple melee weapon you can strike with while you aren't holding anything in it, and it deals {@dice 1d8} bludgeoning damage on a hit. In addition, your arms count as magical for the purposes of overcoming resistance and immunity to nonmagical damage.",
						"The mechanical arms can't be removed from you against your will.",
						"Your mechanical arms can grab into the sides of walls and climb, granting you a climb speed equal to your base walking speed.",
						"Additionally, you can use Intelligence instead of Strength for the attack and damage rolls for your arm strikes."
					]
				}
			],
			"source": "WMOctoperior",
			"page": 51,
			"className": "artificer",
			"classSource": "TCE",
			"subclassShortName": "Octoperior",
			"subclassSource": "WMOctoperior",
			"level": 3,
			"header": 1
		},
		{
			"name": "Extra Attack",
			"source": "WMOctoperior",
			"page": 51,
			"className": "artificer",
			"classSource": "TCE",
			"subclassShortName": "Octoperior",
			"subclassSource": "WMOctoperior",
			"level": 5,
			"header": 2,
			"entries": [
				"At 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn."
			]
		},
		{
			"name": "Tentacle Upgrades",
			"source": "WMOctoperior",
			"page": 51,
			"className": "artificer",
			"classSource": "TCE",
			"subclassShortName": "Octoperior",
			"subclassSource": "WMOctoperior",
			"level": 9,
			"header": 2,
			"entries": [
				"You've managed to directly connect your arms to your subconscious for greater control and have upgraded their reach. The reach for your tentacles increases by 5 additional feet, and their damage increases from {@dice 1d8} to {@dice 1d10} bludgeoning damage. Additionally, you can use your mechanical arms to move or climb up to your movement speed each turn while you are unconscious."
			]
		},
		{
			"name": "Superior Upgrades",
			"source": "WMOctoperior",
			"page": 51,
			"className": "artificer",
			"classSource": "TCE",
			"subclassShortName": "Octoperior",
			"subclassSource": "WMOctoperior",
			"level": 15,
			"header": 2,
			"entries": [
				"Your Mechanical Arms gain the following additional benefits as your neural link with them is perfected:",
				{
					"type": "list",
					"items": [
						"You can use two of your mechanical arms to walk across the ground using your movement speed as long as the arms aren't holding anything, lifting yourself up to 5 feet off of the ground. Whenever you do so, you are unaffected by difficult terrain.",
						"You can grapple one additional creature for each mechanical arm not holding anything else.",
						"As a bonus action, you can throw a creature or item a mechanical arm of yours is holding or grappling by making a ranged attack roll at a target within 60 feet. You may use Intelligence for this attack roll. On a hit, the target takes {@dice 3d6} plus your Intelligence modifier magical bludgeoning damage, and must succeed on a Strength saving throw versus your Artificer Spell Save DC or fall prone. Regardless if your attack hits or not, the item or creature being thrown takes the same {@dice 3d6} plus your Intelligence modifier magical bludgeoning damage and lands in an unoccupied space within 5 feet of the target. You can make this throwing attack a number of times equal to your proficiency bonus, and regain all uses of this feature on a long rest."
					]
				}
			]
		}
	]
}