{
	"_meta": {
		"sources": [
			{
				"json": "WMRuffian",
				"abbreviation": "WMRR",
				"full": "Ruffian Rogue",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"version": "1.0.0",
			"name": "Ruffian",
			"subclassTitle": "Roguish Archetype",
			"subclassFeatures": [
				"Ruffian|Rogue||Ruffian|WMRuffian|3",
				"Rough 'Em Up|Rogue||Ruffian|WMRuffian|9",
				"The Bigger They Are|Rogue||Ruffian|WMRuffian|13",
				"The Unspoken Threat|Rogue||Ruffian|WMRuffian|17"
			],
			"source": "WMRuffian",
			"shortName": "Ruffian",
			"className": "Rogue",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "Ruffian",
			"source": "WMRuffian",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Ruffian",
			"subclassSource": "WMRuffian",
			"level": 3,
			"entries": [
				"Thug, sellsword, highwayman, blackguard. You have been called many of those names. Rather than rely on shining armour, honour, or skill with flourishing blades, you instead spit, claw, and fight with every dirty trick you know to gain an advantage over your foes. Perhaps you were once a knight or a guard, your experience teaching you that a fair fight is a worse option than one in your favour. Bounty hunters, deserters, and mercenaries all follow the pragmatic pathof the ruffian. A ruffian excels in a fight where the environment can be used to their advantage or where their foes are slow and cumbersome.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Tools of the Trade|Rogue||Ruffian|WMRuffian|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Strength of Arm|Rogue||Ruffian|WMRuffian|3"
				}
			]
		},
		{
			"type": "entries",
			"name": "Tools of the Trade",
			"entries": [
				"When you select this archetype at 3rd level, you gain proficiency in medium armor, shields, morningstars, handaxes, and flails."
			],
			"source": "WMRuffian",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Ruffian",
			"subclassSource": "WMRuffian",
			"level": 3,
			"header": 1
		},
		{
			"type": "entries",
			"name": "Strength of Arm",
			"entries": [
				"Starting at 3rd level you can use the bonus action granted by your Cunning Action to either attempt to grapple a target, or attempt to shove it 10 feet away from you or knock it prone. You also gain an additional way to use your Sneak Attack; you don’t need advantage on the attack roll to use your Sneak Attack against a creature if you are grappling it, you don’t have disadvantage on the attack roll, and the weapon does not have the heavy property.",
				"Alternatively, you can use your Sneak Attack against a target if you make a ranged attack with a weapon that has the thrown property. All the other rules for your Sneak Attack feature still apply to you."
			],
			"source": "WMRuffian",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Ruffian",
			"subclassSource": "WMRuffian",
			"level": 3,
			"header": 1
		},
		{
			"name": "Rough 'Em Up",
			"source": "WMRuffian",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Ruffian",
			"subclassSource": "WMRuffian",
			"level": 9,
			"header": 2,
			"entries": [
				"At 9th level, you've learned how best to present yourself in such a way that seems the most threatening. While in physical contact with a creature, such as squeezing tight during a handshake, putting a hand on their shoulder, or roughly shoving them aside, you gain advantage on Charisma (Intimidation) checks against that creature. Additionally, you may choose to use your Strength modifier in place of your Charisma modifier when making skill checks using Intimidation."
			]
		},
		{
			"name": "The Bigger They Are",
			"source": "WMRuffian",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Ruffian",
			"subclassSource": "WMRuffian",
			"level": 13,
			"header": 2,
			"entries": [
				"Beginning at 13th level, you've learned how to use the prodigious size and ponderous speed of larger opponents against them. You may expend all your movement to move 5 feet into a space occupied by a creature at least one size larger than you. On its turn, the creature may attempt to force you out of its space by using the Shove action.",
				"While you are in the space of another creature in this way and aren’t incapacitated or restrained, you receive the benefits of half cover, and when that creature moves in such a way that you would no longer occupy a space it is in, it provokes an attack of opportunity from you. When you hit a creature whose space you are occupying with a melee weapon and do not have disadvantage on the attack roll, you can use your Sneak Attack if the weapon does not have the Heavy property."
			]
		},
		{
			"name": "The Unspoken Threat",
			"source": "WMRuffian",
			"page": 94,
			"className": "Rogue",
			"classSource": "PHB",
			"subclassShortName": "Ruffian",
			"subclassSource": "WMRuffian",
			"level": 17,
			"header": 2,
			"entries": [
				"Starting at 17th level, you've perfected the art of holding a victim in your grasp while still keeping a weapon in hand. You hold your grapples in your elbows, or use weapons as leverage when grappling.",
				"While you are holding a melee weapon in one hand that lacks the versatile property, that hand counts as empty for the purposes of a grapple. When an enemy misses you with an attack roll while you have a creature grappled or are in a creature's space, you can use your reaction to have that attack hit one creature you are grappling or in the space of."
			]
		}
	]
}