{
	"_meta": {
		"sources": [
			{
				"json": "Aasimar  (Seeker)",
				"abbreviation": "WMR",
				"full": "Aasimar  (Seeker)",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/"
			}
		],
		"dateAdded": 1586943396,
		"dateLastModified": 1586943396
	},
	"race": [
		{
			"name": "Aasimar  (Seeker)",
			"source": "Aasimar  (Seeker)",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"con": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"common": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Healing Hands",
					"entries": [
						"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Light Bearer",
					"entries": [
						"You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Shroud of Life and Death",
					"entries": [
						"Starting at 3rd level, you can use your bonus action to awaken the power in your blood, causing a nimbus of crimson energy to flow out from you.",
						"Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you shed dim light in a 10-foot radius, and at the end of each of your turns, one creature within 30 feet of you takes necrotic damage equal to your proficiency bonus. In addition, if you or an ally within 30 feet drops to 0 hit points without being killed outright, you can use your reaction to preserve them, causing them to drop to 1 hit point instead. When you use this reaction, it ends your transformation early.",
						"Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language."
					],
					"type": "entries"
				}
			]
		}
	]
}