{
	"_meta": {
		"sources": [
			{
				"json": "Skeleton",
				"abbreviation": "WMR",
				"full": "Skeleton",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/"
			}
		],
		"dateAdded": 1586943396,
		"dateLastModified": 1586943396
	},
	"race": [
		{
			"name": "Skeleton",
			"source": "Skeleton",
			"size": [
				"V"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1,
					"choose": {
						"from": [
							"dex",
							"int"
						],
						"amount": 2
					}
				}
			],
			"traitTags": [
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"common": true,
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Skeletons do not age in the traditional sense, but they do decay over time. The necromantic energies that sustain you will heal most wounds you take at approximately the same rate as a mortal, and your hit die function as normal. A skeleton will generally live up to a maximum of two hundred years, at which their soul will be absorbed back into the Rift Plane to be reincarnated once more."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"An outcast in even minority socieites, the Skeleton is not without its fair share of natural enemies. In order to survive, they inclined to start a nation all of their own. Because to this, they tend to share a lawful bent. Apart from that, their inclination towards good or evil is not stagnant. The best and worst live among their numbers."
					],
					"type": "entries"
				},
				{
					"name": "Past Life",
					"entries": [
						"Choose another race besides this one; the race you select must be humanoid and lack the Living Construct trait (or similar). Even after becoming a Wraith (and later a Skeleton), you maintain vague memories of this past life as this race. Your size, height, and movement speed are the same as this race. You do not retain special movement speeds from this race (such as flying, climbing, or swimming), and you do not carry over any racial features. If your past race had subraces, select one, but you do not carry over any racial features from that either."
					],
					"type": "entries"
				},
				{
					"name": "Living Dead",
					"entries": [
						"As the offspring of the Rift Plane and a nonsentient Wraith, Skeletons are gifted with supernatural properties. Your creature type is Undead. You are immune to disease. You do not need to eat or breathe, but you can ingest food and drink if you wish."
					],
					"type": "entries"
				},
				{
					"name": "Onward to Salvation",
					"entries": [
						"With no pulse to drive you and no veins to pump blood, your body must be designed to operate at its maximum capacity almost always. As an undead, you rarely tire. You treat exhaustion as if it was one level less. In addition, instead of sleeping, you enter an inactive state for 4 hours each day. You do not dream in this state; you are fully aware of your surroundings and notice approaching enemies and other events as normal."
					],
					"type": "entries"
				},
				{
					"name": "Collapse",
					"entries": [
						"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. If you do, reduce yourself to a pile of bones and render yourself {@condition prone}. You are considered to be under similar effects to the {@spell feign death} spell. While subject to this condition, you are unable to move or take actions other than using an action to end this effect. Once you use this trait, you are unable to use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Bloodless",
					"entries": [
						"You are immune to poison damage and the {@condition Poisoned} condition."
					],
					"type": "entries"
				},
				{
					"name": "Them Bones",
					"entries": [
						"If both your hands are unoccupied, you can use a bonus action to rearrange your skeletal structure, or return your body to its original configuration. When you rearrange your bones, choose one of the following options, any of which are considered to occupy both of your hands:"
					],
					"type": "entries"
				},
				{
					"type": "inset",
					"name": "Options",
					"entries": [
						{
							"entries": [
								"• You remove an arm and use it as a bone club. While used as a weapon, you have proficiency with your removed arm, which is a melee weapon with the finesse property that deals {@dice 1d6} bludgeoning damage on it. This weapon also has the light property, but for all intents and purposes, that fact is of little use."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You remove a hand and hold it in your other as if it were a set of thieves' tools. This hand is capable of manipulating locks through picking, cutting glass, and any other function a normal set of thieves' tools could achieve."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You remove two of your ribs and use the rest of them as a musical instrument. This instrument is referred to as the Bone Xylophone, and while playing you gain advantage on Performance checks meant to entertain children."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You gain pull out several of your bones in an attempt to juggle them."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You can remove your skull from its socket and use your arm to look around walls."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Them Bones"
					}
				},
				{
					"entries": [
						"Your bones lose their animation if they are further than 5-feet away from your main body. If your skull loses animation, you are blinded and deafened until a skull is reaffixed to your body."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and two other languages of your choice."
					],
					"type": "entries"
				}
			]
		}
	]
}