{
	"_meta": {
		"sources": [
			{
				"json": "TCEE2",
				"abbreviation": "TCEE2",
				"full": "Tasha's Crucible of Everything Else - Volume 2",
				"authors": [
					"QL Games",
					"Alan Welker"
				],
				"convertedBy": [
					"Bowsori#7981",
					"Lxran#2292"
				],
				"version": "1.0.0",
				"url": "https://www.dmsguild.com/product/357665/Tashas-Crucible-of-Everything-Else-Volume-2",
				"targetSchema": "1.0.0",
				"color": "c7af28"
			}
		],
		"dateAdded": 1549715846,
		"dateLastModified": 1549715846
	},
	"subclass": [
		{
			"name": "Frost Domain",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"shortName": "Frost",
			"subclassSpells": [
				"armor of agathys",
				"fog cloud",
				"glacial path",
				"hold person",
				"sleet storm",
				"frost lance",
				"fire shield",
				"ice storm",
				"cone of cold",
				"hold monster"
			],
			"subclassFeatures": [
				"Frost Domain|Cleric|PHB|Frost|TCEE2|1",
				"Channel Divinity: Bitter Casting|Cleric|PHB|Frost|TCEE2|2",
				"Channel Divinity: Winter's Embrace|Cleric|PHB|Frost|TCEE2|2",
				"Glacial Mantle|Cleric|PHB|Frost|TCEE2|6",
				"Divine Strike|Cleric|PHB|Frost|TCEE2|8",
				"Frozen Form|Cleric|PHB|Frost|TCEE2|17"
			]
		},
		{
			"name": "Way of Devils",
			"source": "TCEE2",
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"shortName": "Devils",
			"subclassFeatures": [
				"Way of Devils|Alternate Monk|LLAM|Devils|TCEE2|3",
				"Vile Edict|Alternate Monk|LLAM|Devils|TCEE2|6",
				"Hellish Tether|Alternate Monk|LLAM|Devils|TCEE2|10",
				"Fiendish Form|Alternate Monk|LLAM|Devils|TCEE2|17"
			]
		},
		{
			"name": "Mimicry",
			"source": "TCEE2",
			"className": "Wizard",
			"classSource": "PHB",
			"shortName": "Mimicry",
			"subclassFeatures": [
				"Mimicry|Wizard|PHB|Mimicry|TCEE2|2",
				"Spittle Savant|Wizard|PHB|Mimicry|TCEE2|6",
				"Polymorph Proficiency|Wizard|PHB|Mimicry|TCEE2|10",
				"Mimic Mastery|Wizard|PHB|Mimicry|TCEE2|14"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Frost Domain",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 1,
			"entries": [
				"Gods of the cold and north, such as Auril, Iborighu, Thrym, and Ulutiu, are, like their element, often severe and demanding. These gods are not usually worshipped for their benevolence, but instead prey upon those who merely wish to survive the unforgiving tundra. Clerics to these gods may not be the warmest people, but they are often seen as saviors to northern settlements that rely on their blessings. These boons are not free though, and clerics of these gods may be sent to gather offerings in return for helping people survive.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Domain Spells|Cleric|PHB|Frost|TCEE2|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Bonus Proficiencies|Cleric|PHB|Frost|TCEE2|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Biting Frost|Cleric|PHB|Frost|TCEE2|1"
				}
			]
		},
		{
			"name": "Domain Spells",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 1,
			"entries": [
				"You gain domain spells at the cleric levels listed in the Frost Domain Spells table. See the Divine Domain class feature for how domain spells work.",
				{
					"type": "table",
					"caption": "Frost Domain Spells",
					"colLabels": [
						"Cleric Level",
						"Spell"
					],
					"colStyles": [
						"col-4 text-center",
						"col-8 text-left"
					],
					"rows": [
						[
							"1st",
							"{@spell armor of agathys}, {@spell fog cloud}"
						],
						[
							"3rd",
							"{@spell glacial path|WMPS}, {@spell hold person}"
						],
						[
							"5th",
							"{@spell sleet storm}, {@spell frost lance|WMPS}"
						],
						[
							"7th",
							"{@spell fire shield}, {@spell ice storm}"
						],
						[
							"9th",
							"{@spell cone of cold}, {@spell hold monster}"
						]
					]
				}
			]
		},
		{
			"name": "Bonus Proficiencies",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 1,
			"entries": [
				"At 1st level, you gain proficiency with martial weapons and heavy armor."
			]
		},
		{
			"name": "Biting Frost",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 1,
			"entries": [
				"When you deal cold damage with a spell of 1st level or higher, you may apply one of the following additional effects to the spell:",
				{
					"type": "list",
					"items": [
						"Your enemies' limbs go numb. Creatures that take damage from this spell have disadvantage on the next weapon attack roll they make before the end of their next turn.",
						"Your enemies begin to freeze in place. Creatures that take damage from this spell have their speed halved until the end of their next turn.",
						"Your enemies' teeth chatter incessantly. Creatures that take damage from this spell must succeed on a Constitution saving throw against your spell save DC or be unable to perform verbal components of spells until the end of their next turn."
					]
				}
			]
		},
		{
			"name": "Channel Divinity: Bitter Casting",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 2,
			"header": 2,
			"entries": [
				"You can use your Channel Divinity to alter your spells and infuse them with the power of your god. If a spell you cast would deal acid, fire, lightning, necrotic, or radiant damage, you can use your Channel Divinity to deal cold damage instead."
			]
		},
		{
			"name": "Channel Divinity: Winter's Embrace",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 2,
			"header": 2,
			"entries": [
				"Also at 2nd level, you can use your Channel Divinity to channel the bitter embrace of winter itself, your enemy feeling as if they were plunged into the very arctic cold itself.",
				"As an action, you present your holy symbol and call upon the winter’s wrath to make the blood of a creature within 60 feet of you run cold. The creature must succeed on a Constitution saving throw equal to your spell save DC or be petrified in true ice for 1 minute. The creature may attempt the saving throw again at the end of each of their turns. Should the creature be reduced to 0 hit points, the ice statue shatters harmlessly."
			]
		},
		{
			"name": "Glacial Mantle",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, you are blessed by the arctic elements. You gain resistance to cold damage, and if you use a bonus action, you are enveloped by a protective barrier of ice which gives you temporary hit points equal to half your cleric level (rounded up). You may use this an amount of times equal to your proficiency bonus, regaining any expended uses on the completion of a long rest."
			]
		},
		{
			"name": "Divine Strike",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 8,
			"header": 2,
			"entries": [
				"You gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra {@dice 1d8} cold damage. When you reach 14th level, the extra damage increases to {@dice 2d8}."
			]
		},
		{
			"name": "Frozen Form",
			"source": "TCEE2",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Frost",
			"subclassSource": "TCEE2",
			"level": 17,
			"header": 2,
			"entries": [
				"Your affinity with frost has reached its peak. You gain immunity to cold damage and resistance to fire damage, and moving through difficult terrain composed of ice or snow doesn't cost you extra movement."
			]
		},
		{
			"name": "Way of Devils",
			"source": "TCEE2",
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"subclassShortName": "Devils",
			"subclassSource": "TCEE2",
			"level": 3,
			"entries": [
				"Monks of the Way of Devils are part of an ancient and unholy order, one dedicated to serving the legions of devils in their war against the demons of the abyss, as well as serving their infernal masters' interests on the Material Plane. Whereas most monks train in the art of self-defense, those of the Way of Devils focus on inflicting punishment and controlling their enemies. It is said that the first of these monks were Duergar, newly bound into pacts with Asmodeus and willing to wield his devilish chains over the prospect of becoming chained themselves.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Devils Techniques|Alternate Monk|LLAM|Devils|TCEE2|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Devilish Chain|Alternate Monk|LLAM|Devils|TCEE2|3"
				}
			]
		},
		{
			"name": "Devils Techniques",
			"source": "TCEE2",
			"page": 10,
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"subclassShortName": "Devils",
			"subclassSource": "TCEE2",
			"level": 3,
			"header": 1,
			"entries": [
				"You learn certain Techniques at the levels noted in the table below. They don't count against your number of Techniques Known and they cannot be switched upon gaining a level.",
				{
					"type": "table",
					"colLabels": [
						"Monk Level",
						"Technique"
					],
					"colStyles": [
						"col-3 text-center",
						"col-9"
					],
					"rows": [
						[
							"3rd",
							"{@optfeature arresting strike|LLAM}"
						],
						[
							"5th",
							"{@optfeature stunning strike|LLAM}"
						],
						[
							"9th",
							"{@optfeature indomitable spirit|LLAM}"
						]
					]
				}
			]
		},
		{
			"name": "Devilish Chain",
			"source": "TCEE2",
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"subclassShortName": "Devils",
			"subclassSource": "TCEE2",
			"level": 3,
			"entries": [
				"You gain the ability to summon a spectral, fiendish chain of burning iron to attack and bind your foes. Whenever you take the Attack action, you can summon the chain to your empty hand and use it for the attack. The chain uses the statistics of a whip, but with a reach of 15 feet, and it counts as a monk weapon for you. You can only have one chain summoned at a time. It disappears after 1 minute, if you are reduced to 0 hit points, or if you dismiss it early as a bonus action.",
				"Also at 3rd level, you can bind a whip you acquire to become your Devilish Chain. The ritual takes an hour to perform, and after the ritual is complete, the chosen item vanishes. Whenever you summon your Devilish Chain, you may summon the designated weapon instead, except its reach increases to 15 feet and you gain the other benefits of your Devilish Chain with it.",
				"Additionally, whenever you hit a creature with your chain, you can spend 1 ki point to apply one of the following effects. You can only use one of these effects each time you make an attack with the chain.",
				{
					"type": "entries",
					"name": "Binding Chain",
					"entries": [
						"The creature must make a Strength saving throw. On a failed save, the creature is restrained until the start of your next turn and cannot move more than 15 feet away from you. A creature restrained by the chain can use its action to make a Strength saving throw, freeing itself on a success. While a creature is restrained in this way, you cannot use the chain to make other attacks."
					]
				},
				{
					"type": "entries",
					"name": "Burning Chain",
					"entries": [
						"You deal additional acid, cold, or fire damage (your choice when you use this feature) equal to one martial arts die + your Wisdom modifier (minimum of 1)."
					]
				},
				{
					"type": "entries",
					"name": "Luring Chain",
					"entries": [
						"If the creature is one size larger than you or smaller, you pull the creature up to 10 feet closer to you."
					]
				}
			]
		},
		{
			"name": "Vile Edict",
			"source": "TCEE2",
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"subclassShortName": "Devils",
			"subclassSource": "TCEE2",
			"level": 6,
			"header": 2,
			"entries": [
				"You have learned to speak in the wicked tongue of the nine hells, compelling your foes to obey in and out of battle. As a bonus action, you can spend 1 ki point to cast the {@spell command} spell. The target has disadvantage on the saving throw if it is restrained by your chain."
			]
		},
		{
			"name": "Hellish Tether",
			"source": "TCEE2",
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"subclassShortName": "Devils",
			"subclassSource": "TCEE2",
			"level": 10,
			"header": 2,
			"entries": [
				"You can bind a foe to you in torturous turmoil. When you restrain a target using the Binding Chain option from your Devilish Chain feature, you can spend an additional 2 ki points to change the duration of the restraining effect to 1 minute. The creature must repeat the saving throw at the end of each of its turns, ending the effect on a success. On a failed save, it takes acid, cold, or fire damage (your choice) equal to two rolls of your martial arts die."
			]
		},
		{
			"name": "Fiendish Form",
			"source": "TCEE2",
			"className": "Alternate Monk",
			"classSource": "LLAM",
			"subclassShortName": "Devils",
			"subclassSource": "TCEE2",
			"level": 17,
			"header": 2,
			"entries": [
				"Your commitment to the nine hells has been proven and you have been rewarded in kind. On your turn, you can spend 5 ki points as a bonus action to take on the qualities of a fiend for 1 minute. You can end these traits early as a bonus action.",
				"While in your fiendish form, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain immunity to fire damage, and resistance to cold damage and bludgeoning, piercing, and slashing damage from nonmagical weapons that aren't silvered.",
						"Your weapon attacks deal additional acid, cold, or fire damage (your choice) equal to one roll of your martial arts die.",
						"You gain a flying speed equal to your current walking speed."
					]
				}
			]
		},
		{
			"name": "Mimicry",
			"source": "TCEE2",
			"className": "Wizard",
			"classSource": "PHB",
			"subclassShortName": "Mimicry",
			"subclassSource": "TCEE2",
			"level": 2,
			"entries": [
				"The mimic. A devious hunter, every rogue's nightmare, and the last thing some creatures see before being swallowed whole. The first mimics were created by powerful mages, and they were intelligent creatures, combining tactical prowess with an all-consuming hunger to create terrifying and powerful devourers. While the secrets of how to create those beings have been lost to time, some mages have passed down a similar tradition that allows even novice wizards to create the monstrosities that many dungeon delvers have become familiar with, commanding these monstrosities as subordinates through sheer power of will.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Transmogrify|Wizard|PHB|Mimicry|TCEE2|2"
				}
			]
		},
		{
			"name": "Transmogrify",
			"source": "TCEE2",
			"className": "Wizard",
			"classSource": "PHB",
			"subclassShortName": "Mimicry",
			"subclassSource": "TCEE2",
			"level": 2,
			"entries": [
				"As an action, you can spend a spell slot and touch a nonmagical object that isn't being worn or carried to turn it into an experimental mimic of the same size. This mimic uses the {@creature arcane mimic|TCEE2} stat block, found below. Some details of this stat block vary based on the spell slot used to create the mimic and the size of the mimic, as described in the Transmogrification and Arcane Mimics tables.",
				"The spell slot used determines the mimic's Strength score and the maximum size of item you can transmogrify, according to the Transmogrification table. The mimic's size determines its hit points and the bludgeoning or piercing damage dealt by its attacks, according to the Arcane Mimics table.",
				"The change lasts for 1 hour, until the mimic is reduced to 0 hit points, or until you dismiss the effect as an action. You can only have one mimic created in this way at a time. You can communicate with your mimic telepathically as long as it is within 120 feet of you.",
				"In combat, the mimic takes its turn immediately after yours. It obeys your verbal or telepathic commands (no action required by you). If you don't issue any, it moves toward the nearest hostile creature and bites it if possible.",
				{
					"type": "table",
					"caption": "Transmogrification",
					"colLabels": [
						"Spell Slot Used",
						"Maximum Size",
						"Strength"
					],
					"colStyles": [
						"col-4 text-left",
						"col-4 text-left",
						"col-4 text-left"
					],
					"rows": [
						[
							"1st",
							"Tiny",
							"12 (+1)"
						],
						[
							"2nd",
							"Small",
							"14 (+2)"
						],
						[
							"3rd",
							"Medium",
							"16 (+3)"
						],
						[
							"4th",
							"Medium",
							"18 (+4)"
						],
						[
							"5th",
							"Large",
							"20 (+5)"
						],
						[
							"6th",
							"Large",
							"22 (+6)"
						],
						[
							"7th",
							"Huge",
							"24 (+7)"
						],
						[
							"8th",
							"Huge",
							"26 (+8)"
						],
						[
							"9th",
							"Gargantuan",
							"28 (+9)"
						]
					]
				},
				{
					"type": "table",
					"caption": "Arcane Mimics",
					"colLabels": [
						"Mimic Size",
						"Hit Points",
						"Attack Damages"
					],
					"colStyles": [
						"col-2 text-left",
						"col-5 text-left",
						"col-5 text-left"
					],
					"rows": [
						[
							"Tiny",
							"4 times the level of the spell slot used",
							"{@dice 1d4} + the mimic's Strength modifier"
						],
						[
							"Small",
							"6 times the level of the spell slot used",
							"{@dice 1d6} + the mimic's Strength modifier"
						],
						[
							"Medium",
							"8 times the level of the spell slot used",
							"{@dice 1d8} + the mimic's Strength modifier"
						],
						[
							"Large",
							"10 times the level of the spell slot used",
							"{@dice 2d8} + the mimic's Strength modifier"
						],
						[
							"Huge",
							"12 times the level of the spell slot used",
							"{@dice 3d8} + the mimic's Strength modifier"
						],
						[
							"Gargantuan",
							"20 times the level of the spell slot used",
							"{@dice 4d8} + the mimic's Strength modifier"
						]
					]
				}
			]
		},
		{
			"name": "Spittle Savant",
			"source": "TCEE2",
			"className": "Wizard",
			"classSource": "PHB",
			"subclassShortName": "Mimicry",
			"subclassSource": "TCEE2",
			"level": 6,
			"header": 2,
			"entries": [
				"Once you spend enough time in mimic slobber, you just kind of get used to it. You gain resistance to acid damage.",
				"Additionally, you can have up to two arcane mimics created at a time. As a bonus action, you can expend a spell slot to magically heal one of your arcane mimics within 120 feet of you. The arcane mimic heals for a number of {@dice d8}s equal to the level of the spell slot expended."
			]
		},
		{
			"name": "Polymorph Proficiency",
			"source": "TCEE2",
			"className": "Wizard",
			"classSource": "PHB",
			"subclassShortName": "Mimicry",
			"subclassSource": "TCEE2",
			"level": 10,
			"header": 2,
			"entries": [
				"Your knowledge of how to change creatures into mundane objects and the basic natural forms of animals is cemented in your mind. You add the {@spell polymorph} spell to your spellbook if you don't already have it, and you always have it prepared. This does not count against the number of spells you can prepare at once.",
				"When you cast {@spell polymorph}, you can transform the target creature into an object instead of a beast. This object counts as magical and must be no more than one size larger than the creature. Any attempt to undo the existence of the item without reducing its hit points, such as by the disintegration spell or by using it as a consumed material component for a spell, makes the effect fail and immediately ends the polymorph effect, as if the creature-object had been reduced to 0 hit points.",
				"You can also target a nonmagical object with this spell to turn it into another object or into a beast of the same size with a challenge rating equal to or less than the level of the spell slot used."
			]
		},
		{
			"name": "Mimic Mastery",
			"source": "TCEE2",
			"className": "Wizard",
			"classSource": "PHB",
			"subclassShortName": "Mimicry",
			"subclassSource": "TCEE2",
			"level": 14,
			"header": 2,
			"entries": [
				"You can have up to three arcane mimics created at a time, and can communicate with them telepathically or magically heal them using your Spittle Savant feature at any distance, even on different planes of existence."
			]
		}
	],
	"monster": [
		{
			"name": "Arcane Mimic",
			"source": "TCEE2",
			"page": 45,
			"size": "V",
			"type": {
				"type": "monstrosity",
				"tags": [
					"shapechanger"
				]
			},
			"alignment": [
				"N"
			],
			"ac": [
				{
					"special": "your spell save DC"
				}
			],
			"hp": {
				"special": "varies"
			},
			"speed": {
				"walk": 15
			},
			"str": 0,
			"dex": 12,
			"con": 13,
			"int": 10,
			"wis": 13,
			"cha": 8,
			"skill": {
				"stealth": "+1"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 11,
			"immune": [
				"acid"
			],
			"conditionImmune": [
				"prone"
			],
			"languages": [
				"understands the languages of its creator but can't speak"
			],
			"trait": [
				{
					"name": "Shapechanger",
					"entries": [
						"The mimic can use its action to polymorph into an object its size or back into its true, amorphous form. Its statistics are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
					]
				},
				{
					"name": "Adhesive (Object Form Only)",
					"entries": [
						"The mimic adheres to anything that touches it. A creature up to one size larger than the mimic adhered to the mimic is also {@condition grappled} by it (escape DC equal to your spell save DC). Ability checks made to escape this grapple have disadvantage. "
					]
				},
				{
					"name": "False Appearance (Object Form Only)",
					"entries": [
						"While the mimic remains motionless, it is indistinguishable from an ordinary object."
					]
				},
				{
					"name": "Grappler",
					"entries": [
						"The mimic has advantage on attack rolls against any creature {@condition grappled} by it."
					]
				},
				{
					"name": "Spider Climb",
					"entries": [
						"The mimic can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
					]
				},
				{
					"name": "Summoner Scaling",
					"entries": [
						"Add twice your PB (Proficiency Bonus) to the arcane mimic's Stealth checks."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} your spellcasting attack modifier to hit, reach varies*, one target. {@h}varying piercing damage* plus acid damage equal to a number of d4s equal to the level of the spell slot used."
					]
				},
				{
					"name": "Pseudopod",
					"entries": [
						"{@atk mw} your spellcasting attack modifier to hit, reach varies*, one target. {@h}varying* bludgeoning damage. If the mimic is in object form, the target is subjected to its Adhesive trait."
					]
				}
			],
			"tokenUrl": "https://imgur.com/ezH4e1t.png",
			"traitTags": [
				"False Appearance",
				"Shapechanger",
				"Spider Climb"
			],
			"senseTags": [
				"D"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"grappled"
			]
		}
	]
}