{
	"_meta": {
		"sources": [
			{
				"json": "The Beneath",
				"abbreviation": "WMR",
				"full": "The Beneath",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/"
			}
		],
		"dateAdded": 1586943396,
		"dateLastModified": 1586943396
	},
	"race": [
		{
			"name": "The Beneath",
			"source": "The Beneath",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": 20
			},
			"ability": [
				{
					"con": 2,
					"str": 1
					}
			],
			"darkvision": 120,
			"traitTags": [
				"Superior Darkvision",
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"terran": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"The Beneath live up to two hundred years after the time they ascended, sustained by the unholy powers that mutated them, before the dark energies fizzle out and the creature perishes."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"The bloodlust that lives within all Beneath drives them toward evil, but the strong willed can maintain a neutral disposition. A rare, exceptional few can even become good."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"The Beneath are between 8 feet to 9 feet tall, although as a quadruped, their height can deminish to as low as 4 to 5 feet when running. Your size is Medium."
					]
				},
				{
					"name": "Sunlight Sensitivity",
					"entries": [
						"You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
					],
					"type": "entries"
				},
				{
					"name": "Superior Darkvision",
					"entries": [
						"Accustomed to the depths below, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Ankheg's Tremorsense",
					"entries": [
						"You have tremorsense up to 10 feet. As an action which lasts for one minute, you can extend your tremorsense to 40 feet. You can only use this feature twice per short rest."
					],
					"type": "entries"
				},
				{
					"name": "Arctic Regeneration",
					"entries": [
						"Whenever you complete a short rest, you can roll {@dice 1d6} for each hit die you expend. Add the result to the total health you gain."
					],
					"type": "entries"
				},
				{
					"name": "Umber Hulk's Burrowing",
					"entries": [
						"As a bonus action, you can expend up to your current movement speed to burrow underground, traveling to a destination within range. While you are burrowing, you are considered to be under the effects of full-cover. After using this feature, you decide whether you'll emerge on the current turn, or the turn after you start to burrow.",
						"Regardless of when you arrive at your destination, you cannot use this feature again until you complete a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Monstrous",
					"entries": [
						"Your creature type is monstrosity, rather than humanoid."
					],
					"type": "entries"
				},
				{
					"name": "Deadly Leap",
					"entries": [
						"Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start. If you jump at least 15 feet as part of your movement, you can use an attack action to slam on the ground in a space that contains one or more other creatures. Each of those creatures must succeed on a Strength or Dexterity saving throw equal to 8 + your proficiency bonus + your Strength modifier. On a failed save, those creatures are knocked {@condition prone} and take {@dice 1d6} bludgeoning damage. This damage increases to {@dice 2d6}} at 5th level, {@dice 3d6}} at 10th level, {@dice 4d6}} at 15th level, and {@dice 5d6}} at 20th level. Once you use this feature, you cannot use it again until you finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Terran."
					],
					"type": "entries"
				}
			]
		}
	]
}