{
	"_meta": {
		"sources": [
			{
				"json": "WMBenefits",
				"abbreviation": "WMVB",
				"full": "Vampiric Benefits",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"optionalfeature": [
		{
			"name": "Grandcrest: Charm",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"The first time you would be subjected to the {@condition charmed} condition, you treat yourself as if you had immunity. Afterwards, your immunity transforms into advantage on saving throws against the {@condition charmed} condition. At the conclusion of a short or long rest, your advantage transforms back into immunity.",
				"{@b Hunger:} While you thirst, your blood pumps furiously, resisting each and every application of a charm or illusion. You have immunity to the {@condition charmed} condition for as long as you hunger."
			]
		},
		{
			"name": "Superior Darkvision",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"You have superior darkvision, allowing you to see in dim light and darkness out to 120 feet. You can only see shades of gray this way. If you already had darkvision, it instead increases by 120 feet.",
				"{@b Hunger:} While you thirst, your pupils dilate, allowing for a wider field of view. Your darkvision becomes 300 feet, and you gain blindsight out to 10 feet."
			]
		},
		{
			"name": "Blood-Drenched Claws",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"You gain a claw attack, which is an unarmed strike that deals {@dice 1d6} slashing damage, as opposed to the normal damage typical for an unarmed strike. This unarmed strike counts as magical for the purposes of overcoming resistance and immunity. Your claw attack also gains the finesse, light, and concealed properties.",
				"{@b Hunger:} While you thirst, your claws become rendered in your undead ichor, becoming deadly in their application. The first time you deal damage with your claws on your turn, you deal an additional {@dice 1d10} damage."
			]
		},
		{
			"name": "Vampiric Drip",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier to the attack and damage rolls with your bite. Your bite deals {@dice 1d4} piercing damage on a hit, and you have advantage on bite attacks while you are missing half or more of your hit points.",
				"When you use your bite and hit a creature that isn’t a Construct or an Undead, you can empower yourself in one of the following ways of your choice:",
				{
				"type": "list",
				"items": [
				"You regain hit points equal to the damage dealt by the bite. This healing does not account for damage from outside sources, such as class abilities or magic items.",
				"You gain a bonus to the next ability check or attack roll you make; this bonus is equal to the damage dealt by the bite. This bonus does not account for damage from outside sources, such as class abilities or magic items."
				]
				},
				"You can empower your bite a number of times equal to your proficiency bonus, and regain all expended uses on a long rest.",
				"{@b Hunger:} While you thirst, your fangs become sharper. You instead deal {@dice 1d6} piercing damage, as opposed to {@dice 1d4}."
			]
		},
		{
			"name": "Unnatural Regeneration",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"When you fall unconscious after dropping to 0 hit points and become stabilized, you slowly begin to regenerate. After 10 minutes have passed, you gain 1 hit point.",
				"{@b Hunger:} While you thirst, your regeneration cycles through at maximum output in order to prevent your death. You instead regain 1 hit point after 1 minute, as opposed to 10 minutes. This reduced time remains in effect so long as you drop to 1 hit point while your {@b hungered} state is active (even if it ends before you regain hit points)."
			]
		},
		{
			"name": "Abnormal Agility",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"When you make a Dexterity check or saving throw, you can immediately roll a {@dice 1d6} and add it to the result of the check or saving throw. You must add this additional {@dice 1d6} before you know the result of the roll. You can add this additional 1d6 a number of times equal to your proficiency bonus, and regain all expended uses on a long rest.",
				"{@b Hunger:} While you thirst, your reflexes become even more agile. Your {@dice 1d6} becomes a {@dice 1d8}."
			]
		},
		{
			"name": "Abnormal Senses",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"You gain advantage on Wisdom (Perception) checks.",
				"{@b Hunger:} While you thirst, your senses become even more refined. You gain expertise with Wisdom (Perception) checks."
			]
		},
		{
			"name": "Abnormal Strength",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. In addition, you gain proficiency in Strength (Athletics). If you already had proficiency, you instead add twice your proficiency bonus.",
				"{@b Hunger:} While you thirst, your muscles dilate and contract outwards, granting you a giant’s might. You count as three sizes larger when determining your carrying capacity and the weight you can push, drag, or lift (as opposed to simply one size larger)."
			]
		},
		{
			"name": "Jump Kick",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"You gain a jump kick (also known as a “comet kick”), typically performed by harnessing a vampire’s innate strength to deal a debilitating blow. This unarmed strike deals {@dice 1d12} bludgeoning damage, as opposed to the normal damage typical for an unarmed strike. This unarmed strike counts as magical for the purposes of overcoming resistance and immunity. Your jump kick attack gains the heavy property.",
				"{@b Hunger:} While you thirst, your kicks become shrouded in your vampiric aura. The first time you hit with a jump kick attack on your turn, that creature must make a Strength saving throw with a DC equal to 8 + your proficiency bonus + your Strength modifier. On a failed save, that creature falls {@condition prone}."
			]
		},
		{
			"name": "Bloodborne Speed",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"Your movement speed increases by 5 feet.",
				"{@b Hunger:} While you thirst, your limbs become more tout and flexible. Your movement speed increases by an additional 5 feet (10 feet total)."
			]
		},
		{
			"name": "Undead Resilience",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"You gain resistance to necrotic damage.",
				"{@b Hunger:} While you thirst, your true undead nature takes center stage. You gain immunity to necrotic damage for as long as your {@b hunger} lasts."
			]
		},
		{
			"name": "Undead Fortitude",
			"source": "WMBenefits",
			"featureType": [
				"VampiricBenefits"
			],
			"entries": [
				"When damage would leave you to 0 hit points, you can make a Constitution saving throw equal to 5 + the damage taken. On a successful save, you drop to 1 hit point instead.",
				"You cannot make this saving throw if the damage is radiant, or is from a critical hit. In addition, starting from 5th level, the DC is reduced by an amount equal to your Constitution modifier + your proficiency bonus.",
				"You can use this benefit a number of times equal to your proficiency bonus, and regain all expended uses on a long rest.",
				"{@b Hunger:} While you thirst, your body’s natural strengthening multiplies two-fold, preventing even the strongest hits from taking you out of the fight. While you {@b hunger} the DC is instead reduced by an amount equal to your Constitution modifier + twice your proficiency bonus."
			]
		}
	]
}