{
	"_meta": {
		"sources": [
			{
				"json": "WMFlaws",
				"abbreviation": "WMVF",
				"full": "Vampiric Flaws",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"optionalfeature": [
		{
			"name": "Forbiddance of Ceremony",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"You cannot enter a place of residence without permission from at least one of its residents. To qualify as a place of residence, the area must meet the definition of “building” and have at least one living occupant who treats the area as their home. You are aware if there is at least one living occupant of the area even if you have not yet made contact with them.",
				"If you attempt to forcefully step into a place of residence without permission, you immediately take {@dice 1d10} + 5 damage that cannot be reduced or negated by any means, and an additional {@dice 1d10} + 5 damage at the start of each of your turns.",
				"You take this damage even if you are currently unconscious, although so long as you have hit points, taking damage this way will immediately jolt you awake (unless you are currently being affected by magic)."
			]
		},
		{
			"name": "Unholy Structure",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"Any healing spell which states it does not work on undead deals damage to you, rather than nothing."
			]
		},
		{
			"name": "Ashen Skin",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"Your curse has exemplified one of your vampiric weaknesses, causing your skin to become more ashen. Whenever you take fire damage, you have disadvantage on all ability checks and attack rolls until the end of your next turn."
			]
		},
		{
			"name": "Cursed Transformation",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"Your curse has transformed your physical appearance into a twisted, deformed version of your former self. You suffer disadvantage on all Charisma ability checks, except for Intimidation, made to interact with other creatures, unless your form is disguised magically."
			]
		},
		{
			"name": "Vulnerable to the Light",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"You gain vulnerability to radiant damage."
			]
		},
		{
			"name": "Exquisite Palate",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"Your taste for blood is much more refined and exquisite compared to other vampires. You can no longer feed off blood packs, and can only sate your need for blood by feeding on humanoids."
			]
		},
		{
			"name": "Stake to the Heart",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"If a wooden stake is driven into your heart, you become paralyzed until the stake is removed. If you would die while a stake is currently driven into your heart, you die as if by the effects of the disintegrate spell."
			]
		},
		{
			"name": "Hypersensitivity",
			"source": "WMFlaws",
			"featureType": [
				"VampiricFlaws"
			],
			"entries": [
				"Your kind was not meant to be in the sun. You take 10 radiant damage when you start your turn in direct sunlight. Utilizing a parasol, umbrella, or similar object can circumvent this damage."
			]
		}
	]
}