{
	"_meta": {
		"sources": [
			{
				"json": "WMDisciplines",
				"abbreviation": "WMVD",
				"full": "Vampiric Disciplines",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"optionalfeature": [
		{
			"name": "Potence: Extra Attack",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can attack twice, instead of once, whenever you take the Attack action on your turn."
			]
		},
		{
			"name": "Quietus: Children of the Night",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"If it is currently night, or you are in an area of dim light or darkness, you can use an action to call in {@dice 2d4} {@creature swarm of bats|MM}. The swarm arrives in {@dice 1d4} turns in unoccupied squares within 15 feet of you (your choice) and acts as your allies, obeying your verbal commands.",
				"You can dismiss the swarms you have summoned as a bonus action. After one hour if any member of the swarm remains, they disperse. Once you use this Discipline, you cannot use it again until you finish a long rest."
			]
		},
		{
			"name": "Quietus: Children of the Night & Moon",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to have already learned the Quietus: Children of the Night vampiric discipline.}",
				"Instead of calling upon {@dice 2d4} {@creature Swarm of Bats|MM}, you can instead call upon {@dice 2d4} {@creature wolf|MM}. In order to use this feature, the sun must not currently be up and you must be outside."
			]
		},
		{
			"name": "Dominate: Mesmerize",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell charm person} at the 1st level an amount of times equal to your proficiency bonus, regaining any expended uses when you finish a long rest. Charisma is your spellcasting modifier for this spell."
			]
		},
		{
			"name": "Protean: Misty Form",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can use an action to polymorph yourself into a Medium cloud of mist or back into your true form. While you are in your misty form, you cannot take any actions (other than to revert to your true form), speak, or manipulate objects.",
				"You are weightless, have a flying speed of 20 feet, and can enter a hostile creature’s space and stop there. In addition, if air could pass through an opening, you can as well without squeezing. You cannot pass through water this way.",
				"While in your misty form, you also have advantage on Strength, Dexterity, and Constitution saving throws, and have resistance to non-magical damage. Your body also counts as an area of light obscurement for features which benefit from being lightly obscured.",
				"You can use this Discipline a number of times equal to your proficiency bonus, and regain all expended uses on a long rest."
			]
		},
		{
			"name": "Protean: Faceless Meister",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"You can cast {@spell disguise self} at will, without expending a spell slot or material components. Charisma is your spellcasting modifier for this spell."
			]
		},
		{
			"name": "Protean: Formless Meister",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell polymorph} once without expending a spell slot or material components. When you cast {@spell polymorph} this way, you can only target yourself. Once you use this Discipline, you cannot use it again until you finish a long rest."
			]
		},
		{
			"name": "Fortitude: True Birth",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to have already manifested the Grandcrest: Charm vampiric benefit.}",
				"You now have immunity to the charmed condition, rather than pseudo-temporary immunity. In addition, your hunger benefit changes to the following:",
				"{@b Hunger:} While you thirst, your blood pumps furiously, dispelling illusions directly in front of your eyes. You gain truesight out to a range of 15 feet, with the exception that you cannot see into the Ethereal Plane. This truesight lasts for as long as your hungered state remains."
			]
		},
		{
			"name": "Celerity: Rapid Reflexes",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [],
			"entries": [
				"{@italic The following vampiric discipline requires you to have already manifested the Unerring Aim vampiric benefit.}",
				"If you have no weapons drawn when you roll Initiative, add your Proficiency bonus to your initiative roll. The first time you strike a creature with a ranged weapon attack before they have taken a turn in combat, you inflict maximum damage on the weapon’s damage dice for that attack."
			]
		},
		{
			"name": "Potence: Execution",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [],
			"entries": [
				"{@italic The following vampiric discipline requires you to have already manifested the Earthshock vampiric benefit.}",
				"If a creature falls prone within your reach, you may use your reaction to make an attack against that creature with a melee weapon. If a creature is both prone and restrained, the creature is considered vulnerable to this attack."
			]
		},
		{
			"name": "Thaumaturgy: Seal of the Scholar",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tremere Bloodline.}",
				"You've learned how to weave a magical sigil to further aid your blood sorcery. You may add a +2 to your spell attack rolls made with a vampire spell. In addition, you may use a bonus action to gain advantage on your next spell attack roll as you invoke the Seal's power.",
				"You may use your bonus action in this way a number of times equal to your proficiency bonus, regaining any expended uses upon the completion of a short or long rest."
			]
		},
		{
			"name": "Obtenebration: Let Us Depart",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 12,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"Over the course of twenty four hours, you can perform an unholy ceremony over the site of a small crypt, coffin, or other such resting place for the dead. At the completion of the ritual, the item you sanctified as well as the area in a 120 foot radius becomes your vampiric resting place.",
				"An area that constitutes your vampiric resting place cannot be consecrated as per the {@spell hallow} spell, and creatures within the area cannot fall under the influence of a spell that protects them from undead, such as the spell {@spell protection from evil and good} (though they can still use the spell to protect them from other types of enemies).",
				"Whenever you take a short or long rest within your vampiric resting place, you gain temporary hit points equal to {@dice 2d6} + twice your proficiency bonus. You can only have one vampiric resting place at a time—creating a new vampiric resting place with the unholy ritual erases your old one, if an older one exists.",
				"As an action, you can cast the {@spell teleport} spell targeting up to eight willing creatures within 20 feet of you. Your shadow enlarges, wrapping around their feet and sinking their bodies into the floor. The destination you choose must be your vampiric resting place, and you are always on target. You can use this feature once per long rest."
			]
		},
		{
			"name": "Potence: Blood Rend",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to have already manifested the Blood-Drenched Claws vampiric benefit.}",
				"The first time you successfully hit a creature on your turn with an unarmed strike from your Blood-Drenched Claws feature, you deal an additional {@dice 2d6} damage and heal for half the amount of damage from Blood Rend."
			]
		},
		{
			"name": "Protean: Immortality",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 15,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to have already learned the Let Us Depart vampiric discipline.}",
				"When you drop to 0 hit points outside your vampiric resting place, you can choose to transform into a cloud of mist instead of falling unconscious, provided you aren’t in an area of sunlight or running water. If a stake has been directly implanted into your heart, this feature fails to activate.",
				"While you have 0 hit points in your misty form, you cannot use an action to transform back into your true form, but you are immune to all damage. You cannot cross areas of sunlight or running water. While in this form, you must reach your vampiric resting place within the next two hours or become destroyed and immediately die. Your movement speed in this form is equal to your base movement speed, and you cannot speak for the purpose of casting spells with a verbal component.",
				"Once you reach your resting place, you revert to your true form and become stabilized, and are considered to be {@condition paralyzed} but conscious until you regain at least 1 hit point."
			]
		},
		{
			"name": "Potence: Universal Traversal",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You are permanently under the effect of {@spell spider climb}."
			]
		},
		{
			"name": "Necromancy: Touch of Death",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell vampiric touch} at the 3rd level once without expending a spell slot or material components. Charisma is your spellcasting modifier for this spell. You may use this Discipline once per short or long rest.",
				"The casting level of this Discipline increases to 4th at 10th level, 5th at 13th level, and 6th at 16th level."
			]
		},
		{
			"name": "Fortitude: Pureblood",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline can be taken multiple times.}",
				"You can choose one additional vampiric benefit from the Vampiric Benefits list. When you do so, you do not have to choose an accompanying flaw."
			]
		},
		{
			"name": "Animalism: Flight",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 15,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"As a bonus action, you sprout large, leathery wings that emerge from your back, granting you a flying speed equal to your walking speed. These wings last until you dismiss them as a bonus action on your turn."
			]
		},
		{
			"name": "Potence: Blades of Caine",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"You gain proficiency in the use of longswords. In addition, you can throw a non-magical longsword into the air and animate it with your vampiric charisma, granting it a hover speed of 30 feet.",
				"A longsword that is hovering this way can be commanded to move and attack a creature within range on your turn (which replaces an attack from the Attack action), but it cannot ever fly more than 30 feet away from you. You can use Strength or Dexterity for the attack roll. On a hit, that creature takes {@dice 1d8} + your Strength or Dexterity modifier magical slashing or piercing damage (your choice).",
				"If you are a vampire of the Toreador Bloodline, you can choose to use rapiers and jians with this feature, rather than longswords."
			]
		},
		{
			"name": "Fortitude: Magic Resistance",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You have advantage on all Intelligence and Charisma saving throws against magic."
			]
		},
		{
			"name": "Obfuscate: Cloak the Gathering",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell pass without trace} once without expending a spell slot or material components. Once you use this Discipline, you cannot use it again until you finish a long rest."
			]
		},
		{
			"name": "Obfuscate: Blithe Acceptance",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"If you remain motionless in a crowd or dimly-lit environment, you are considered to be {@condition invisible}. This effect ends the moment you move or perform any actions that involve movement, such as the Attack action."
			]
		},
		{
			"name": "Obfuscate: Fade From the Mind's Eye",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"You can cast {@spell mirror image} once without expending a spell slot or material components. You regain use of this Discipline on a short or long rest."
			]
		},
		{
			"name": "Auspex: Horoscopic Forecast",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"You can cast {@spell augury} once without expending a spell slot or material components. Once you use this Discipline, you cannot use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Auspex: The Mind Revealed",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell detect thoughts} once without expending a spell slot or material components. Once you use this Discipline, you cannot use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Chimerstry: Army of Apparitions",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 12,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell mislead} once without expending a spell slot or material components. Once you use this Discipline, you cannot use it again until you finish a long rest."
			]
		},
		{
			"name": "Chimerstry: Fata Amria",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"You become immune to magic that allows other creatures to read your thoughts, know your alignment, or know your creature type. Creatures can telepathically communicate with you only if you allow it. In addition, you have advantage on saving throws against any effect that would determine whether you are telling the truth."
			]
		},
		{
			"name": "Protean: Purify the Impaled Beast",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"As a reaction to when a stake is impaled into your heart, or when you would contract a disease or poison, you can activate this Discipline. The stake, disease, or poison is immediately expelled from your body. Once you use this Discipline, you cannot use it again until you finish a long rest.",
				"As an additional benefit, you can unattune from a cursed item without need of a {@spell remove curse} spell, so long as that item does not also possess the symbiotic nature tag."
			]
		},
		{
			"name": "Obfuscate: Manifold's Guise",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"You can cast {@spell fog cloud} twice without expending a spell slot or material components. You regain all expended uses of this Discipline on a long rest. In addition, fog, mist, rain, snow, dust, smoke, and similar substances do not obscure your vision, and you can see in lightly and heavily obscured conditions."
			]
		},
		{
			"name": "Quietus: Deed the Heart's Desire",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You have grown skilled in using Quietus to manipulate a creature's blood, lurching them to a complete stop and controlling their form like a marionette.",
				"When you successfully hit a creature with an unarmed strike or melee weapon attack, you can manipulate the creature’s blood using your sanguine magic. That creature must make a Charisma saving throw with a DC equal to 8 + your proficiency bonus + your Charisma modifier.",
				"On a failed save, when the creature's next turn begins, you take hold of their transient marionette strings, forcing them to move up to their movement speed in any direction of your choice. A creature moving as a result of this Discipline provokes opportunity attacks as normal. Movement enacted this way cannot force the creature to move into immediate danger, such as walking off a cliff or into a fire.",
				"You can only use this Discipline once per turn, and only a number of times equal to your proficiency bonus. You regain all expended uses on a long rest."
			]
		},
		{
			"name": "Obtenebration: Shadow Lair",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell rope trick} once per long rest, without expending a spell slot or material components. When you cast {@spell rope trick} this way, instead of summoning a rope and climbing it to enter your extradimensional space, you and your allies instead enter your own shadow. Your shadow can be retracted back into your body after entering the extradimensional space, causing your shadow to disappear from view outside the space. If a creature steps on the correct spot, they will still be able to enter the space, even without the shadow present."
			]
		},
		{
			"name": "Necromancy: Summon Undead Thralls",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Cappadocian Bloodline.}",
				"You can cast {@spell animate dead} at the 3rd level once without expending a spell slot or material components. Once you use this Discipline, you cannot use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Necromancy: Unholy Communion",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Cappadocian Bloodline.}",
				"You can cast {@spell speak with dead} at will, without expending a spell slot or material components."
			]
		},
		{
			"name": "Celerity: Flawless Parry",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Ishtarri Bloodline.}",
				"When a hostile creature makes an unarmed strike or a melee weapon attack, you can use your reaction as time begins to slow around you.",
				"Your AC increases by a number equal to your proficiency bonus. If that attack misses, you can immediately expend 1 frenzy point to make a Fanged Bite attack against that creature (if they are in range). You can only gain the benefits of this feature once per turn, and your AC returns to normal immediately after the attack.",
				"You can use this ability an amount of times equal to your proficiency bonus, regaining any expended uses on the completion of a short or long rest."
			]
		},
		{
			"name": "Celerity: Momentum",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Ishtarri Bloodline.}",
				"You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be {@condition blinded}, {@condition deafened}, or {@condition incapacitated}."
			]
		},
		{
			"name": "Potence: Deadly Leap",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Ishtarri Bloodline.}",
				"As an action, you leap to a creature within 30 feet without expending any movement and begin to tear them asunder with your claws in a maddened frenzy. The creature must make a Dexterity saving throw with a DC equal to 8 + proficiency bonus + your Strength or Dexterity modifier. On a failure, the creature takes {@dice 6d6} + your Strength or Dexterity modifier (your choice) slashing damage, half damage on a successful save. You may use this an amount of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest."
			]
		},
		{
			"name": "Celerity: Tempo",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 11,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Ishtarri Bloodline.}",
				"You gain the following Blood Frenzy Art: {@b Unearthly Reflexes (1 FP):} When you roll a Dexterity saving throw in response to another creature’s effect, you can use your reaction to use this Frenzy Art. When you do, you take half damage on a failed save, and no damage on a successful one."
			]
		},
		{
			"name": "Dominate: Autonomic Mastery",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tzimisce or Malkavian Bloodline.}",
				"You can turn inanimate objects into temporary thralls within 60 feet of you as an action. You can issue a verbal command to any inanimate object within that area, causing it to move, gesture, or act in a way befitting of a servant, such as handing you a drink or bowing in your presence. It can also be commanded to perform its intended purpose.",
				"An object that you command this way cannot go against their intended purpose, however—a goblet cannot pour out its contents on the floor, and a lock cannot be made to unlock itself without its accompanying key.",
				"In addition, if a hostile creature is within 20 feet of you, you can attack them an action with objects from the vicinity. If you're able to make multiple attacks with the Attack action, this attack replaces one of them. When you make an attack against that creature, you use your Charisma modifier for the attack roll. You are considered proficient in this attack.",
				"On a hit, that creature takes {@dice 1d12} + your Charisma modifier magical slashing, bludgeoning, or piercing damage (your choice).",
				"You cannot transform magical objects into temporary thralls using this Discipline. You can, however, command objects with the technological tag.",
				"If you command a weapon to strike or a firearm to shoot, it will, using your Charisma modifier for the attack and damage rolls. However, if you are not proficient in the weapon or firearm, you do not add your proficiency bonus to the attack roll. In addition, the creature must be in range of the weapon, and this command requires an action—it cannot be performed as part of an Attack action."
			]
		},
		{
			"name": "Auspex: Aura Perception",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Toreador Bloodline.}",
				"You can sense the quality of one’s aura, granting you detailed insight into any creature in sight of your vampiric irises. You learn the emotional state of any creature within range of your vision, as well as whether they are afflicted by any conditions or diseases.",
				"Finally, you can communicate telepathically with any creature you can see within 30 feet of you, and they can respond to you likewise. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language."
			]
		},
		{
			"name": "Auspex: Eagle's Sight",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Toreador Bloodline.}",
				"As an action, you transfer your sense of vision to the skies, gaining a bird’s eye view of your surrounding location. Your internal sensor begins at a height of 100 feet, but can be moved to a maximum height of 300. Your sensor can travel away from you no further than 1,000 feet in any direction. It can travel 100 feet in a single second on any axis, and your mental processing speed expands to be able to take in all the information within a surrounding area—comprehend it—and digest the important details without pause. The DM will inform you of anything important occurring in the area, as you are able to comprehend details even when your vision is being assaulted by thousands of simultaneous stimuli."
			]
		},
		{
			"name": "Auspex: Enhanced Vision",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Toreador Bloodline.}",
				"In conditions of clear visibility, you can make out details of even extremely distant creatures and objects as small as 2 feet across.",
				"In addition as a bonus action, you can tap into the supernatural sense of your bloodline, revealing to your eyes creatures who share in your undead nature. You are aware if there are undead creatures within 100 feet of you, and are able to pinpoint their exact location. Furthermore, undead creatures cannot benefit from being invisible within range of your sight, and you can see them even if they take residence in the Ethereal Plane. These benefits last until the start of your next turn.",
				"You may use this feature an amount of times equal to your proficiency bonus, and regain any expended uses when you finish a short or long rest."
			]
		},
		{
			"name": "Auspex: Enhanced Hearing",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Toreador Bloodline.}",
				"Your hearing has grown incredibly acute, allowing you to pick out voices and sounds from beyond typical mortal comprehension. You can accurately pick out sounds that originate from up to 120 feet away.",
				"In addition, you have advantage on Wisdom (Perception) checks made in regards to hearing, and you have advantage on Wisdom (Insight) checks to determine if a creature is lying."
			]
		},
		{
			"name": "Thaumaturgy: Familiar of Blood",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tremere Bloodline.}",
				"You have the ability to imbue your blood with your vampiric influence, transforming it into a familiar loyal to you who serves your whims and executes your orders in combat.",
				"After one hour of uninterrupted focus, you can birth forth a faithful companion from a list of the following creatures: bat, crawling crawl, giant bat, giant rat, hawk, rat, raven, skeleton, zombie, or wolf. Your familiar follows your verbal commands to the best of its ability, and takes its turn directly after your turn in initiative.",
				"You can only have one vampiric familiar at a time. If your vampiric familiar is slain, you must spend one hour in uninterrupted focus to conjure a new one. If you use this feature to gain the service of another familiar, you lose the service of the previous one as it dissipates back into a pool of your blood."
			]
		},
		{
			"name": "Auspex: Arcane Sight",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tremere Bloodline.}",
				"You can cast {@spell detect magic} at will, without expending a spell slot or material components."
			]
		},
		{
			"name": "Thaumaturgy: Herbal Wisdom",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tremere Bloodline.}",
				"You can cast {@spell speak with plants} at will, without expending a spell slot or material components."
			]
		},
		{
			"name": "Chimerstry: Suspension of Disbelief",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tzimisce Bloodline.}",
				"As a reaction to when you make a Charisma (Deception) check against a {@condition charmed} target, you can activate this Discipline. The creature you targeted will treat any lie you spin as a “reasonable, form-fitting explanation of events”, no matter how incomprehensible the lie actually is. Once you use this Discipline, you cannot use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Thaumaturgy: Endless Slumber",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Vampire"
						}
					}
				}
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Tremere Bloodline.}",
				"You can cast {@spell sleep} a number of times equal to your proficiency bonus without expending a spell slot or material components. When you do so, you instead roll d10s as opposed to d8s. You regain all expended uses of this Discipline on a long rest."
			]
		},
		{
			"name": "Vicissitude: Arm in Arm",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Vozhad Bloodline.}",
				"Through your training in the vampiric art of Vicissitude, you have gained the ability to manifest additional muscles and joints to augment your form. These joints protrude into subsidiary arms which you can manipulate, either divulging their existence from your torso or retracting them back into your body at will. The armor or clothing you are wearing must make accommodations for your arms if you wish to summon them.",
				"Your two additional arms allow you to interact with an additional object or feature of the environment for free on your turn. In addition, you can perform the somatic components of spells with these arms, and use them to maintain grapples.",
				"You may not carry and use shields for defense with these additional arms or wield weapons with them."
			]
		},
		{
			"name": "Potence: Reach of the Malleable",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Vozhad Bloodline.}",
				"Your reach with your bone talons increases by 5 feet."
			]
		},
		{
			"name": "Dominate: Chain the Psyche",
			"source": "WMDisciplines",
			"featureType": [
				"VampiricDisciplines"
			],
			"entries": [
				"{@italic The following vampiric discipline requires you to be of the Vozhad Bloodline.}",
				"Any creature below half their maximum hit points (rounded down) who end their turn within 10 feet of you while you are in your monstrously disfigured form must make a Wisdom saving throw with a DC equal to 8 + proficiency bonus + Charisma modifier or become {@condition frightened} of you for 1 minute. They can repeat the save at the end of their turns, ending the effect on a successful save. On a successful save, that creature becomes immune to this effect for 1 hour. If that creature is restrained by you, they automatically fail the saving throw, and can be put under this feature’s effects again even if they are currently immune due to this feature."
			]
		}
	]
}