{
	"_meta": {
		"sources": [
			{
				"json": "Vespidan (Worker)",
				"abbreviation": "WMR",
				"full": "Vespidan (Worker)",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/"
			}
		],
		"dateAdded": 1586943396,
		"dateLastModified": 1586943396
	},
	"race": [
		{
			"name": "Vespidan (Worker)",
			"source": "Vespidan (Worker)",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": 20,
				"fly": 30
			},
			"ability": [
				{
					"con": 1,
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"amount": 2
					}
				}
			],
			"traitTags": [
				"Tool Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"All Vespids reach maturity at 12, beyond this workers live about as long as 75 years, drones as long as 350 years, and workers that become queens can live as long as 750 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Vespidan societies are invariably highly structured and caste-based. They are almost always strongly lawful and usually lawful neutral as the good of the hive supersedes all other concerns. The exception are the hive- broken who are still often lawful by upbringing, but can easily stray into any form of thinking from there."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Workers and Drones are small sized, while Queens are medium sized."
					]
				},
				{
					"name": "Multiarmed",
					"entries": [
						"All Vespids are born with 4 arms. Your two additional arms allow you to interact with an additional object or feature of the environment for free on your turn. You may not carry and use shields for defense with these additional arms. Nor do they grant you additional attacks, or allow you to wield weapons with them for combat."
					],
					"type": "entries"
				},
				{
					"name": "Flight",
					"entries": [
						"As part of a move action, a Vespidan can instead fly 30 feet, but must end their movement on the ground or a solid surface. A Vespidan who ends its turn in the air immediately plummets to the ground. To use this speed you can't be wearing heavy armor or be encumbered."
					],
					"type": "entries"
				},
				{
					"name": "Carapace",
					"entries": [
						"Your Carapace provides limited protection, and makes you accustomed to wearing armor. You can calculate your base AC as 11 + your Dexterity modifier while not wearing armor, and a shield’s benefits apply as normal while you use this AC. While wearing medium armor, your maximum Dexterity modifier bonus is increased by 1."
					],
					"type": "entries"
				},
				{
					"name": "Swarm Tactics",
					"entries": [
						"You have advantage on an attack roll against a creature if at least one of your allies is within 5 feet of the creature and the ally isn’t incapacitated. You may only benefit from this trait once per turn."
					],
					"type": "entries"
				},
				{
					"name": "Sting",
					"entries": [
						"Your sting is a natural weapon, which you can use to make a unarmed strike with. If you hit with it, you deal piercing damage equal to {@dice 1d4} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. On a hit, you may choose to inject the target with your venom, after which you must spend a long rest before you can use your venom again.",
						"This venom causes the target to take {@dice 2d6} poison damage, and it must make a Constitution saving throw (DC: 10 + your Proficiency bonus + your Strength modifier). On a failed save, it is also {@condition Poisoned} until the start of your next turn. The poison damage increases to {@dice 3d6}} at 5th level. {@dice 4d6}} at 10th level, {@dice 5d6}} at 15th level, and {@dice 6d6}} at 20th level."
					],
					"type": "entries"
				},
				{
					"name": "Talented Builder",
					"entries": [
						"You have proficiency in one Tool of your choice. In addition, you learn new Tool proficiencies in half the normal amount of downtime weeks, rounded down. This reduction is applied last, after any reduction you may receive from your Intelligence modifier."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish."
					],
					"type": "entries"
				}
			]
		}
	]
}