{
	"_meta": {
		"sources": [
			{
				"json": "WMF",
				"abbreviation": "WMF",
				"full": "West March Feats",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.0.0"
			}
		],

		"dateAdded": 0,
		"dateLastModified": 1954236505
	},
	"feat": [{
			"name": "Dark Reaping",
			"source": "WMF",
			"prerequisite": [{
				"race": [{
					"name": "Revenant"
				}]
			}],
			"ability": [{
				"cha": 1
			}],
			"entries": [
				"Your dark powers now allow you to extract the thoughts of man and use it to fuel your abilities. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Additionally, when a creature within 30 feet of you is reduced to 0 hit points and dies, you can feed upon the power of their death to gain your choice of one of the following benefits:"
					]
				},
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"• Temporary hit points equal to your total character level + your Constitution modifier, which last for up to one minute."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• The first attack you hit with on your next turn deals additional necrotic damage equal to your total character level + your choice of either your Strength or Charisma modifier."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• Advantage on all saving throws until the start of your next turn."
							],
							"type": "entries"
						}
					],
					"data": {}
				},
				{
					"type": "list",
					"items": [
						"Once you use this ability, you must finish a short or long rest before you can use it again."
					]
				}
			]
		},
		{
		"name": "Unstable Rebirth",
		"source": "WMF",
		"prerequisite": [
			{
				"other": "At least one level in any Wild Magic class"
			}
		],
		"entries": [
			"Your very existence is chaos, so why wouldn't your end be as well?",
			{
				"type": "list",
				"items": [
					"Raise an ability score of your choice by 1.",
					"Each time you short or long rest, roll a {@dice d20}. On a 20, the first time you would die before you next short or long rest, you come back to life as if by the {@spell reincarnate} spell."
					]
				}
			]
		},
		{
			"name": "Changeling Metamorphosis",
			"source": "WMF",
			"page": 213,
			"prerequisite": [
				{
					"race": [
						{
							"name": "changeling"
						}
					]
				}
			],
			"ability": [
				{
					"hidden": true,
					"con": 1
				}
			],
			"entries": [
				"Your ability to shapechange is more than skin deep. In addition, when you use your Shapechanging trait, you can choose one of the following benefits, which lasts until you use your Shapechanging trait again. Some of these benefits require specific physical features, such as gills or claws, that can be seen by observers.",
				{
					"type": "list",
					"items": [
						"Increase your Constitution score by 1, to a maximum of 20.",
						"{@b Aquatic Adaptation.} You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed.",
						"{@b Darkvision.} You adapt your eyes and gain {@sense darkvision} with a range of 60 feet.",
						"{@b Natural Weapons.} You grow claws, fangs, spines, horns, or a different natural weapon of your choice.Your unarmed strikes deal {@damage 1d6} bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes."
					]
				}
			]
		},
		{
			"name": "Envoy Specialist",
			"source": "WMF",
			"page": 213,
			"prerequisite": [
				{
					"race": [
						{
							"name": "warforged"
						}
					]
				}
			],
			"ability": [
				{
					"hidden": true,
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"amount": 1
					}
				}
			],
			"entries": [
				"You have modified your body to perform a specific task, integrating a tool directly into your body. You gain the following benefits.",
				{
					"type": "list",
					"items": [
						"Increase one ability score of your choice by 1, to a maximum of 20.",
						"You gain proficiency with one tool of your choice.",
						"Choose one of these tools you are proficient with that weighs 10 pounds or less: an {@filter artisan's tools|items|type=artisan's tools}, {@item forgery kit|phb}, {@item herbalism kit|phb}, {@item poisoner's kit|phb}, {@item thieves' tools|phb}, or a {@filter musical instrument|items|type=instrument}. You have a working model of this tool integrated into your body. It can't be removed, and as long as you have a hand free, you can make use of the integrated tool.",
						"Your proficiency bonus is doubled when you make ability checks using this integrated tool."
					]
				}
			]
		},
		{
	"name": "Cartomancer",
	"source": "WMF",
	"page": 49,
	"prerequisite": [
		{
			"spellcastingFeature": true
		}
	],
	"additionalSpells": [
		{
			"innate": {
				"known": {
					"_": [
						"prestidigitation#c"
					]
				}
			}
		}
	],
	"entries": [
		"You have learned to channel your magic through a deck of cards. You can use a card deck as your spellcasting focus, and you gain the following benefits:",
		{
			"type": "list",
			"style": "list-hang-notitle",
			"items": [
				{
					"type": "item",
					"name": "Card Tricks",
					"entries": [
						"You learn the {@spell Prestidigitation} cantrip and can use it to create illusions that duplicate the effects of stage magic. When you use {@spell Prestidigitation} in this way, you can conceal the verbal and somatic components of the spell as ordinary conversation and card handling."
					]
				},
				{
					"type": "item",
					"name": "Hidden Ace",
					"entries": [
						"When you finish a long rest, you can choose one spell from your class's spell list and imbue that spell into a card. The chosen spell must have a casting time of 1 action, and it must be a level for which you have spell slots. The card remains imbued with this spell for 8 hours. While the card is imbued with the spell, you can use a bonus action to flourish the card and cast the spell within. The card then immediately loses its magic."
							]
						}
					]
				}
			]
		},
		{
	"name": "Aberrant Dragonmark",
	"source": "WMF",
	"page": 52,
	"ability": [
		{
			"con": 1
		}
	],
	"additionalSpells": [
		{
			"ability": "con",
			"innate": {
				"_": {
					"rest": {
						"1": [
							{
								"choose": "level=1|class=Sorcerer"
							}
						]
					}
				}
			},
			"known": {
				"_": [
					{
						"choose": "level=0|class=Sorcerer"
					}
				]
			}
		}
	],
	"entries": [
		"You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:",
		{
			"type": "list",
			"items": [
				"You learn a {@filter cantrip of your choice from the sorcerer spell list|spells|level=0|class=Sorcerer}. In addition, choose a {@filter 1st-level spell from the sorcerer spell list|spells|level=1|class=Sorcerer}. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.",
				"When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage."
			]
		},
		"You also develop a random flaw from the Aberrant Dragonmark Flaws table.",
		{
			"type": "table",
			"caption": "Aberrant Dragonmark Flaws",
			"colLabels": [
				"d8",
				"Flaw"
			],
			"colStyles": [
				"col-2 text-center",
				"col-10"
			],
			"rows": [
				[
					"1",
					"Your mark is a source of constant physical pain."
				],
				[
					"2",
					"Your mark whispers to you. Its meaning can be unclear."
				],
				[
					"3",
					"When you're stressed, the mark hisses audibly."
				],
				[
					"4",
					"The skin around the mark is burned, scaly, or withered."
				],
				[
					"5",
					"Animals are uneasy around you."
				],
				[
					"6",
					"You have a mood swing any time you use your mark."
				],
				[
					"7",
					"Your looks change slightly whenever you use the mark."
				],
				[
					"8",
					"You have horrific nightmares after you use your mark."
						]
					]
				}
			]
		},
		{
	"name": "Revenant Blade",
	"source": "WMF",
	"page": 22,
	"ability": [
		{
			"choose": {
				"from": [
					"str",
					"dex"
				],
				"amount": 1
			}
		}
	],
	"entries": [
		"You are descended from a master of the {@item double-bladed scimitar|ERLW}, and some of that mastery has passed on to you. You gain the following benefits:",
		{
			"type": "list",
			"items": [
				"While you are holding a double-bladed scimitar with two hands, you gain a +1 bonus to Armor Class.",
				"A double-bladed scimitar has the finesse property when you wield it."
					]
				}
			]
		},
		{
			"name": "Focused Personas",
			"source": "WMF",
			"page": 213,
			"prerequisite": [
				{
					"race": [
						{
							"name": "changeling"
						}
					]
				}
			],
			"ability": [
				{
					"hidden": true,
					"cha": 1
				}
			],
			"entries": [
				"You've developed personas that help you focus your talents. Work with your DM to define two unique personas—identities with distinct appearances and personalities. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Increase your Charisma score by 1, to a maximum of 20.",
						"Choose a tool and define a persona associated with it.While you are using your Shapechanging trait to assume the identity of that persona, you are proficient with that tool.If you are already proficient in it, your proficiency bonus is doubled for any ability check you make using that tool while assuming that persona.",
						"Choose a skill you're proficient in and define a different persona associated with it. While you are using your Shapechanging trait to assume the identity of that persona, your proficiency bonus is doubled for any ability check you make using that skill."
					]
				}
			]
		},
		{
			"name": "Thrown Arms Master",
			"source": "WMF",
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"amount": 1
					}
				}
			],
			"entries": [
				"You've honed your ability to lob weaponry into the fray, including weapons not meant for ranged combat. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Simple and martial melee weapons without the thrown property have the thrown property for you. One-handed weapons have a normal range of 20 feet and a long range of 60 feet, while two-handed weapons have a normal range of 15 feet and a long range of 30 feet.",
						"Weapons that already have the thrown property increase their short range by 20 feet and their long range by 40 feet for you.",
						"When you make an attack with a thrown weapon attack using a light weapon, the weapon returns to your grasp like a boomerang at the end of your turn, unless something prevents it from returning. You can catch and stow as many weapons as you threw in this way."
					]
				}
			]
		},
		{
			"name": "Superior Shifting",
			"source": "WMF",
			"page": 213,
			"prerequisite": [
				{
					"race": [
						{
							"name": "shifter"
						}
					]
				}
			],
			"ability": [
				{
					"hidden": true,
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"wis",
							"cha"
						],
						"amount": 1
					}
				}
			],
			"entries": [
				"You have a strong connection to the beast within, strengthening your body and your ability to shift. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Choose one of the ability scores affected by your subrace's Ability Score Increase. Increase this ability score by 1, to a maximum of 20.",
						"When you use your Shifting trait, the transformation lasts for ten minutes, until you die, or until you end it as a bonus action.",
						"You can use your Shifting trait one additional time. You regain all uses when you complete a short or long rest."
					]
				}
			]
		},
		{
			"name": "Sentient Bones",
			"source": "WMF",
			"prerequisite": [{
				"race": [{
					"name": "skeleton"
				}]
			}],
			"ability": [{
				"choose": {
					"from": [
						"dex",
						"con"
					],
					"amount": 1,
					"entry": "Increase the chosen ability score by 1, to a maximum of 20."
				}
			}],
			"entries": [
				"You have become increasingly more self-aware as you time spent on the Material Plane increases. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Additionally, you can use a bonus action to detach or reattach one of your hands, which allows the hand to wander freely by walking on its fingertips. This deatched hand has a walking speed and climbing speed of 30 and can move up, down, and across vertical surfaces and upside down along ceilings.",
						"Your skeletal hand counts as an improvised weapon which you can use to make unarmed strikes. It has a thrown property of 15/30."
					]
				},
				{
					"type": "inset",
					"name": "",
					"entries": [{
							"entries": [
								"The hand has a strength score of 5, a hit point maximum equal to twice your total character level, and otherwise uses your statistics and AC. You cannot detach a hand in this way while using the Them Bones trait, or use Them Bones while a hand is detached."
							],
							"type": "entries"
						},
						{
							"entries": [
								"You have a psychic link with your detached hand, and can command it to move or take actions on your turn with no additional action from you. A hand detached in this way retains animation up to 1,000 feet away from you. A detached hand can take the Dodge, Disengage, Dash, or Help actions, but no other actions."
							],
							"type": "entries"
						},
						{
							"entries": [
								"You mentally receive visual and auditory information from the detached hand, which can see and hear as any other creature, in addition to having darkvision out to 30 feet. While the hand is detached, you know its exact location relative to you, as long as you are on the same plane of existence."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Sentient Hands"
					}
				}
			]
		},
		{
			"name": "Polearm Master",
			"source": "WMF",
			"entries": [
				"You can keep your enemies at bay with reach weapons. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you make a melee attack and attack with only a {@item glaive|phb}, {@item halberd|phb}, {@item quarterstaff|phb}, or {@item spear|phb}, you can use a bonus action to make a melee attack with the opposite end of the weapon; this attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a {@dice d4}, and the attack deals bludgeoning damage.",
						"While you are wielding a {@item glaive|phb}, {@item halberd|phb}, {@item pike|phb}, {@item quarterstaff|phb}, or {@item spear|phb}, other creatures provoke an opportunity attack from you when they enter the reach you have with that weapon."
					]
				}
			]
		},
		{
			"name": "Grappler",
			"source": "WMF",
			"prerequisite": [],
			"entries": [
				"You've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While you are grappling only one creature, your speed is not halved.",
						"You have advantage on attack rolls against a creature you are grappling.",
						"You can use your action to try to pin a creature {@condition grappled} by you. To do so, make another grapple check. If you succeed, the creature is {@condition restrained} until the grapple ends."
					]
				}
			]
		},
		{
			"name": "Advanced Mutation",
			"source": "WMF",
			"prerequisite": [{
				"race": [{
					"name": "Demihuman"
				}]
			}],
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"dex",
							"con"
						],
						"amount": 1,
						"entry": "Increase the chosen ability score by 1, to a maximum of 20."
					}
				}
			],
			"entries": [
				"You’ve mutated an additional trait, being among the few Demihumans to manifest another boon. Whether this be through evolution, a freak accident, or a magic ritual, you’ve been changed in some way. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You may choose one bestial enchantment from the following list and evolve it, gaining the acquired benefits. Whenever you gain a bestial enhancement from your race and you have this feat, you may instead choose one bestial enhancement from this list rather than from the Demihuman Birth From Creation list."
					]
				},
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"{@b Beast of Burden.} You are considered one size larger than you are for the purposes of determining carrying capacity and the amount you can push, drag, or lift."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Jumper.} You gain proficiency in your choice of Athletics or Acrobatics. Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Kin of Mine.} You gain proficiency in Animal Handling. Your proficiency bonus is doubled when you make an Animal Handling check. In addition, you have two creature types: humanoid and beast. You can be affected by a spell or ability that works on either of your creature types."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Keen Senses.} You gain proficiency in the Perception skill and choose one sense (sight, smell, taste, temperature, or touch). You gain advantage on Perception rolls that utilize that sense."
							],
							"type": "entries"
						}
					],
					"data": {}
				}
			]
		},
		{
			"name": "Otherworldly",
			"source": "WMF",
			"prerequisite": [{
				"race": [{
					"name": "ghost",
					"subrace": "spirit"
				}]
			}],
			"entries": [
				"Your soul has grown exceptionally powerful, and you may channel its energy into a semblance of mortal magic. You can cast the following spells with this ability: {@spell blink}, {@spell catapult}, and {@spell invisibility}.",
				{
					"type": "list",
					"items": [
						"When you cast {@spell invisibility} this way, you can only target yourself.",
						"Any spell cast using this feat is automatically cast at its lowest possible level.",
						"Choose between Wisdom or Charisma; this is your spellcasting ability for these spells.",
						"At 4th level, {@spell catapult} casts at 2nd level. It becomes 3rd level at 8th, 4th level at 12th, 5th level at 16th, and 6th level at 20th.",
						"You regain the ability to cast any spells provided by this feat once you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Might of the Small",
			"source": "WMF",
			"prerequisite": [{
				"other": "Creature size of tiny or small"
			}],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have an unusually strong carrying capacity and grip for a creature of your size, honed through years of constant training with heavy weapons. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Being Small or Tiny doesn’t impose disadvantage on your attack rolls with heavy weapons.",
						"Your Strength score is doubled for the purpose of determining your carrying capacity and the weight you can push, drag, or lift."
					]
				}
			]
		},
		{
			"name": "Black Lotus",
			"source": "WMF",
			"prerequisite": [{
				"other": "Proficiency in Poisoner's Kit"
			}],
			"entries": [
				"You have extensive experience dealing with poisons. Your mastery earns you the following benefits:",
				{
					"type": "list",
					"items": [
						"You have resistance to poison damage, and gain advantage on saving throws to avoid being {@condition poisoned}.",
						"In addition, when you take a long rest, you fill three vials with one of the following poisons using your Poisoner's Kit (or one vial on a short rest):"
					]
				},
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"{@b Powderboil.} This powdered poison can be applied to a weapon as an object interaction. The next time the weapon deals damage to a creature, it must succeed on a Constitution saving throw or take poison damage. The poison's damage is equal to xd8, where x equals half of your current level."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Stomachturner.} This slick oil can be applied to a weapon as an object interaction. The next time the weapon deals damage, the opposing creature becomes {@condition poisoned} for one minute, or until they spend an action on their turn to regain their senses."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Night's Kiss.} This tasteless and odorless liquid can be slipped into drink or food. When a creature consumes the poison, it must make a Constitution saving throw or fall unconscious for ten minutes. This effect ends if the creature takes damage."
							],
							"type": "entries"
						}
					],
					"data": {}
				},
				{
					"type": "list",
					"items": [
						"Poisons created in this way lose their potency, and expire at the completion of your next long rest.",
						"The DC for all saving throws for poisons created with this feat is 8 + your proficiency bonus + your Intelligence or Wisdom modifier (your choice)."
					]
				}
			]
		},
		{
			"name": "Piper & The Goat",
			"source": "WMF",
			"prerequisite": [{
				"race": [{
					"name": "Satyr"
				}]
			}],
			"entries": [
				"You've managed to master the panpipes to the point you're able to manifest the magical effects of the Feywild with ease with just a simple melody. The DC of these melodies are equal to 8 + your Charisma modifier + your proficiency bonus. You can use these melodies a total of three times, regaining any expended uses on the completion of a short or long rest.",
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"{@b Melody of Charm.} As an action, you play a dizzying and enchanting tune to a creature within 30 feet of you. That creature must make a Wisdom saving throw with a DC equal to your melody save DC. On a failed save, that creature becomes {@condition charmed} for one minute. Undead and creatures immune to being {@condition charmed} aren't affected by this melody."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Melody of Galloping.} As an action, you play a chipper and upbeat tune as you gain a skip in your step and feel a blossoming freedom in your chest. Your movement speed increases by 10 for one minute."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Melody of Slumber.} As an action, you play a gentle and soft tune to a creature within 30 feet of you. That creature must make a Wisdom saving throw with a DC equal to your melody save DC. On a failed save, that creature descends into a deep slumber as it falls {@condition unconscious} until one minute passes, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Undead and creatures immune to being {@condition charmed} aren't affected by this melody."
							],
							"type": "entries"
						}
					],
					"data": {}
				}
			]
		},
		{
			"name": "Great Weapon Master",
			"source": "WMF",
			"entries": [
				"You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.",
						"Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a penalty equal to your proficiency to the attack roll. If the attack hits, add double your proficiency to the damage roll."
					]
				}
			]
		},
		{
			"name": "Sharpshooter",
			"source": "WMF",
			"entries": [
				"You have mastered ranged and thrown weapons and can make shots that others find impossible. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.",
						"Your ranged weapon attacks ignore half cover and three-quarters cover.",
						"Before you make an attack with a ranged or thrown weapon that you are proficient with, you can choose to take a penalty equal to your proficiency to the attack roll. If the attack hits, add double your proficiency to the damage roll."
					]
				}
			]
		},
		{
			"name": "Mage Slayer",
			"source": "WMF",
			"entries": [
				"You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"When a creature within reach of you casts a spell, you can use your reaction to make an opportunity attack against that creature. When you make this reaction, you can choose to make the attack {@italic before} the spell is cast. You may only attack before the spell is cast a number of times equal to your proficiency bonus, and you regain all expended uses on a long rest.",
						"When you use your reaction to make a melee weapon attack against a creature before the spell is cast, that creature must make a concentration check. If that creature's concentration is broken, the spell fails.",
						"When you damage a creature that is currently concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.",
						"You have advantage on saving throws against spells cast by creatures within 5 feet of you."
					]
				}
			]
		},
		{
			"name": "Artificer Initiate",
			"source": "WMF",
			"prerequisite": [],
			"entries": [
				"You’ve learned some of an artificer’s inventiveness, granting you the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn one cantrip of your choice from the {@filter Artificer spell list|spells|class=Artificer (Alternate) (LLAART)}, and you learn one 1st-level spell of your choice from that list. Intelligence is your spellcasting ability for these spells. Whenever you gain a level, you can replace one of these spells with another spell of the same level from the artificer spell list.",
						"You learn one Artificer {@filter Infusion|optionalfeatures|feature type=LLAART:INF} of your choice. If an infusion has a level prerequisite, you must be an Artificer of that level to learn that infusion.",
						"You can cast this feat’s 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.",
						"You gain proficiency with one type of artisan’s tools of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability."
					]
				}
			]
		},
		{
			"name": "Chef",
			"source": "WMF",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"Time and effort spent mastering the culinary arts has paid off. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency with cook’s utensils if you don’t already have it.",
						"As part of a short rest, you can cook special food, provided you have ingredients and cook’s utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra {@dice 1d8} hit points.",
						"With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to double your proficiency bonus."
					]
				}
			]
		},
		{
			"name": "Metamagic Adept",
			"source": "WMF",
			"prerequisite": [{
				"other": "Spellcasting or Pact Magic feature"
			}],
			"entries": [
				"You’ve learned how to exert your will on your spells to alter how they function. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you gain a level, you can replace one of your Metamagic options with another one from the sorcerer class.",
						"You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Shadow Touched",
			"source": "WMF",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"int",
						"wis",
						"cha"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You learn how to bend shadows from your experience with the Shadowfell. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn the {@spell darkness} spell and one 1st-level spell of your choice. The 1st-level spell must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can’t cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells’ spellcasting ability is the ability increased by this feat."
					]
				}
			]
		},
		{
			"name": "Shield Training",
			"source": "WMF",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex",
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You’ve trained in the effective use of shields. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency with shields.",
						"In combat, you can don or doff a shield as the free object interaction on your turn.",
						"If you have the Spellcasting or Pact Magic feature, you can use a shield as a spellcasting focus."
					]
				}
			]
		},
		{
			"name": "Tandem Tactician",
			"source": "WMF",
			"prerequisite": [],
			"entries": [
				"Your presence in a scrap tends to elevate your comrades. You gain the following benefits: ",
				{
					"type": "list",
					"items": [
						"You can use the {@action Help} action as a bonus action.",
						"When you use the {@action Help} action to aid an ally in attacking a creature, increase the range of the {@action Help} action by 10 feet. Additionally, you can help two allies targeting the same creature within range when you use the {@action Help} action this way."
					]
				}
			]
		},
		{
			"name": "Gunslinger's Waltz",
			"source": "WMF",
			"prerequisite": [],
			"entries": [
				"You have achieved new heights when dual wielding firearms. You gain the following benefits as you strive to lay waste to those who would oppose you:",
				{
					"type": "list",
					"items": [
						"You deal +1 to damage rolls while wielding two firearms.",
						"You gain the ability to dual wield two one-handed firearms even when they aren't light. This follows the same rules for dual wielding melee weapons.",
						"You can draw or stow two one-handed ranged weapons when you would normally be able to draw or stow only one.",
						"While you are dual wielding firearms, you can reload normally even if you do not have a free hand."
					]
				}
			]
		}
	]
}