{
	"_meta": {
		"sources": [
			{
				"json": "WMInvocations",
				"abbreviation": "WMIN",
				"full": "West March Invocations",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"optionalfeature": [
		{
			"name": "Investment of the Chain Master (Revised)",
			"source": "WMInvocations",
			"isClassFeatureVariant": true,
			"featureType": [
				"EI"
			],
			"prerequisite": [
				{
					"pact": "Chain"
				}
			],
			"entries": [
				"When you cast {@spell find familiar}, you infuse the summoned familiar with a measure of your eldritch power, granting the creature the following benefits:",
				{
					"type": "list",
					"items": [
						"The familiar gains either a flying speed or a swimming speed (your choice) of 40 feet.",
						"As a bonus action, you can command the familiar to take the {@action Attack} action.",
						"The familiar's weapon attacks are considered magical for the purpose of overcoming immunity and resistance to nonmagical attacks.",
						"If the familiar forces a creature to make a saving throw, it uses 8 + your proficiency bonus + your Charisma modifier rather than it being equal to your spell save DC. It cannot benefit from Rod of the Pact Keeper.",
						"The pseudodragon, in place of poison on its stinger, now deals acid damage instead of poison damage with its condition now simply being a magical effect (creatures with magic resistance have advantage on this save)",
						"The sprite, in place of using poison on its shortbow, is now simply a magical effect.",
						"The quasit, in place of poison on its claws, now uses necrotic damage and is not a poison, rather being a magical effect.",
						"The imp, in place of poison on its stinger, now uses necrotic damage and is now a magical effect."
					]
				}
			]
		},
		{
			"name": "Pact of the Chain (Revised)",
			"source": "WMInvocations",
			"isClassFeatureVariant": true,
			"featureType": [
				"PB"
			],
			"entries": [
				"You learn the {@spell find familiar} spell and can cast it as a ritual. The spell doesn't count against your number of spells known.",
				"When you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: {@creature imp}, {@creature pseudodragon}, {@creature quasit}, or {@creature sprite}.",
				"Additionally, when you take the {@action Attack} action, you can forgo one of your own attacks to allow your familiar to use its reaction to make one attack of its own.",
				"You add hit point to your familiar equal to 3 * Your Warlock Levels",
				{
					"type": "entries",
					"name": "Might of the Master",
					"entries": [
						"The following numbers increase by 1 when your proficiency bonus increases by 1: the familiar’s skill and saving throw bonuses (and the bonuses to hit and damage of its attacks)."
					]
				},
				{
					"type": "entries",
					"name": "Eldritch Reconstruction",
					"entries": [
						"As an action, your familiar heals for 2d8 + 2 hit points. The +2 scales with Might of the Master. This ability has 3 charges, and you regain all expended charges on a long rest."
					]
				},
				{
					"type": "inset",
					"name": "Pact of the Chain familiars have received a few changes:",
					"entries": [
						"The pseudodragon‘s poison lasts for one minute, and creatures can attempt the save at the end of their turns.",
						"The poisoned condition for sprites now allows for a creature to make a save at the end of each of their turns."
					]
				}
			]
		},
		{
			"name": "Graceful Technique",
			"source": "WMInvocations",
			"page": 41,
			"isClassFeatureVariant": true,
			"featureType": [
				"FS:F"
			],
			"entries": [
				"You learn one flourish of your choice from among those available to the Fencer archetype in the fighter class at level 3. If a flourish requires your target to make a saving throw to resist the flourish’s effects, the saving throw DC equals 8 + proficiency bonus + your Charisma modifier. You must follow the prerequisites outlined in the Fencer archetype to perform flourishes and use your precision die. Should you already know all the flourishes available at level 3, you instead add a +1 to attack rolls you make with finesse melee weapons.",
				"You gain one precision die, which is a {@dice d8} (this die is added to any precision die you have from another source). This die is used to fuel your flourishes. A precision die is expended when you use it. You regain precision die when you finish a short or long rest."
			]
		},
		{
			"name": "Bound Steed",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Chain"
				}
			],
			"entries": [
				"You can cast {@spell find steed} once without expending a spell slot.",
				"You regain the ability to do so when you finish a long rest."
			]
		},
		{
			"name": "Dual Blade",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Blade"
				}
			],
			"entries": [
				"When you summon a one handed weapon with the light property as your weapon with the Pact of the Blade Feature, you can summon a weapon of the same type in your other hand as a bonus action.",
				"Both summoned weapons count as your pact weapon for the purposes of class features. In addition, when engaging in two weapon fighting you may add your relevant ability modifier to the damage of your off hand attacks."
			]
		},
		{
			"name": "Teacher of the Arcane",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Tome"
				}
			],
			"entries": [
				"You gain the ability to impart your abilities onto your allies. When you cast a warlock spell with a casting time of 1 action, you can hold your Book of Shadows and increase its casting time to 1 minute. You expend the spell slot, but none of the spell’s effects occur. Instead, the spell transfers into one of your book's pages for later use. This page can be torn out and given to another creature so they may cast it. Any creature holding the page thereafter can use an action to activate the spell. The creature holding the page casts the spell at the spell slot level used to make it, though the spell is cast using your spellcasting ability.",
				"You may only have one of these pages active at a time, and you cannot regain your spell slot maximum until it is cast. The page remains enchanted until your next short or long rest, at which point the page turns to ash and you regain the spell slot."
			]
		},
		{
			"name": "Booming Aura",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"spell": [
						"booming blade#c"
					]
				}
			],
			"entries": [
				"When you cast the cantrip {@spell booming blade|tce}, all creatures within 5 feet of you must make a Constitution saving throw equal to your spell save DC. On a failed save, a creature takes thunder damage equal to your Charisma modifier (minimum of 0)."
			]
		},
		{
			"name": "Green-Flame Chain",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"spell": [
						"green-flame blade#c"
					]
				}
			],
			"entries": [
				"When you cast the cantrip {@spell green-flame blade|tce}, flames leap from the second creature the cantrip targets to a third within 5 feet of it inflicting fire damage equal to your Charisma modifier."
			]
		},
		{
			"name": "Unerring Blast",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					},
					"spell": [
						"eldritch blast#c"
					]
				}
			],
			"entries": [
				"When you cast the eldritch blast cantrip, and one of your spell attacks misses its target, you can use your bonus action to make another attack roll in an attempt to hit the creature you missed."
			]
		},
		{
			"name": "Voice of the Rune Master",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 15,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell tongues} on yourself at will, without expending a spell slot or material components."
			]
		},
		{
			"name": "Blessing of the Spider Queen",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You gain a climbing speed equal to your walking speed, and you can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
			]
		},
		{
			"name": "Legendary Sacrifice",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"As a reaction when you make a saving throw, you can expend a warlock spell slot to succeed on the saving throw instead of rolling to determine an outcome. You cannot use this feature to succeed on a save you have already attempted and failed."
			]
		},
		{
			"name": "Mistbringer",
			"source": "WMInvocations",
			"featureType": "EI",
			"entries": [
				"Fog, mist, rain, snow, dust, smoke, and similar substances do not obscure your vision, and you can cast {@spell fog cloud} once using a warlock spell slot. You can’t do so again until you finish a long rest."
			]
		},
		{
			"name": "Otherworldy Grace",
			"source": "WMInvocations",
			"featureType": "EI",
			"entries": [
				"You gain proficiency in the Acrobatics skill, and your walking speed increases by 10 feet."
			]
		},
		{
			"name": "Otherworldy Resilience",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"As a bonus action, you can regain a number of hit points equal to {@dice 1d8} plus your Warlock level. You can’t do so again until you finish a long rest."
			]
		},
		{
			"name": "Whisperless",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 15,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You can cast {@spell silence} on yourself at will, without expending a spell slot or material components. You and your spells can ignore the effects of magical silence."
			]
		},
		{
			"name": "Otherworldy Strength",
			"source": "WMInvocations",
			"featureType": "EI",
			"entries": [
				"You gain proficiency in the Athletics skill, and your melee weapon attacks deal double damage to objects and structures."
			]
		},
		{
			"name": "Bond of Loyalty",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Chain"
				}
			],
			"entries": [
				"Whenever you or your familiar would take damage, the other can use their reaction to magically take the damage instead of the target taking it. This doesn't transfer any effects that might accompany the damage. You can only use this feature if your familiar is within 100 feet of you.",
				"Should this damage reduce the familiar or Warlock to 0 hit points, any excess damage carries over to the original target."
			]
		},
		{
			"name": "Book of Eldritch Secrets",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Tome",
					"level": {
						"level": 12,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You learn two extra spells of your choice from either the warlock spell list or your expanded patron spell list. These spells must be of a level you can cast with a warlock spell slot, and the chosen spells don’t count against the number of spells you know for the class."
			]
		},
		{
			"name": "Book of Unfettered Lore",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Tome",
					"level": {
						"level": 15,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"For any invocations that grant spells that use warlock spell slots, you can ignore any restrictions that limit how often those spells can be cast per long rest."
			]
		},
		{
			"name": "Bound Greater Steed",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Chain",
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You gain the ability to cast {@spell find greater steed|xge} once per long rest without expending a spell slot."
			]
		},
		{
			"name": "Lightning Lasso",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Chain",
					"spell": [
						"lightning lure#c"
					]
				}
			],
			"entries": [
				"With this invocation you can choose to hold a target instead of pulling it closer with the cantrip {@spell lightning lure|tce}. If you use it this way the target takes the lightning damage from the cantrip as normal per round they stay grappled. The target can break free with a Strength saving throw at the end of its turn against your spell save DC."
			]
		},
		{
			"name": "Master of Many Chains",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Chain",
					"level": {
						"level": 12,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You gain a second familiar of the same type as the one you already have.",
				"Familiars summoned via this invocation count as one creature for the purposes of attunement."
			]
		},
		{
			"name": "Searing Strike",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Blade",
					"level": {
						"level": 12,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"When you hit a creature with your pact weapon, the creature takes extra radiant damage equal to your Charisma modifier (minimum of 1). You cannot take this invocation if you already have the Lifedrinker invocation."
			]
		},
		{
			"name": "Superior Mystic Arcanum",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Tome",
					"level": {
						"level": 18,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"You select a second 6th-level Mystic Arcanum spell, and once per long rest, you regain the use of your 6th-level Mystic Arcanum at the end of a short rest."
			]
		},
		{
			"name": "Two Minds in One",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Chain",
					"level": {
						"level": 18,
						"class": {
							"name": "Warlock"
						}
					}
				}
			],
			"entries": [
				"When you cast a concentration spell, your familiar can hold concentration on that spell for you and increase your total number of concentration spells you can maintain at the same time (maximum of 2).",
				"If, while concentrating, your familiar moves more than 30 feet from you, is incapacitated, fails a concentration check, or dies, then concentration on the spell is lost, and you must succeed on a concentration check with a DC of 10 + the level of the spell your familiar was concentrating on or become Stunned until the beginning of your next turn."
			]
		},
		{
			"name": "Witching Blade",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Blade"
				}
			],
			"entries": [
				"You can use your Charisma modifier instead of your Strength or Dexterity modifiers for attack and damage rolls made with your pact weapon."
			]
		},
		{
			"name": "Ally of Nature",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Archfey or Wilderness"
				}
			],
			"entries": [
				"You can cast {@spell awaken} once using a warlock spell slot. You can’t do so again until you finish a long rest. The creature you awakened is also imbued with your patron's magic, taking on an appearance similar to the theme of your patron."
			]
		},
		{
			"name": "Aspect of Jubilex",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Fiend"
				}
			],
			"entries": [
				"Any spell granted to you by your Expanded Spell list that deals fire damage may instead deal acid damage, and melts flammable objects in the area rather than burning them.",
				"Additionally, your body takes on an amorphous property. You can now move through the spaces of larger creatures."
			]
		},
		{
			"name": "Aura of Baalzebul",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"patron": "Fiend"
				}
			],
			"entries": [
				"Creatures within 30 feet of you automatically lose any immunity to the poisoned condition they may possess, and any such creature's immunity to poison damage becomes resistance while within your aura."
			]
		},
		{
			"name": "Celestial Blessing",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Celestial"
				}
			],
			"entries": [
				"You can cast {@spell Bless} as a 1st level spell at will without maintaining concentration. You can use this feature a number of times equal to your Charisma modifier. You regain any expended uses after completing a long rest."
			]
		},
		{
			"name": "Celestial Instincts",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"patron": "Celestial"
				}
			],
			"entries": [
				"You can cast {@spell detect evil and good} at will, without expending a spell slot."
			]
		},
		{
			"name": "Eldritch Seal",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"patron": "Undying or Undead (Revised)",
					"spell": [
						"eldritch blast#c"
					]
				}
			],
			"entries": [
				"You can halt the flow of a creature's life force with your attacks. Once per turn, when you successfully hit a creature with {@spell eldritch blast}, that creature cannot be healed or benefit from healing effects until the end of its next turn."
			]
		},
		{
			"name": "Enthraller's Might",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 18,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Great Old One"
				}
			],
			"entries": [
				"Your patron has imbued you with the power to infect the minds of other sentient creatures. You may now use {@italic create thrall} on any incapacitated creature as long as they have an Intelligence score of 3 or higher."
			]
		},
		{
			"name": "Everlasting Counsel",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Great Old One"
				}
			],
			"entries": [
				"You may cast {@spell augury} at will, without expending a spell slot. In addition, you may cast {@spell augury} one additional time before incurring the chance of a random reading."
			]
		},
		{
			"name": "Hellfire",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 18,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Fiend"
				}
			],
			"entries": [
				"You may cast {@spell meteor swarm} once using a warlock spell slot. You can't do so again until you finish a long rest."
			]
		},
		{
			"name": "High Tide",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Fathomless"
				}
			],
			"entries": [
				"You can cast {@spell tidal wave|xge} at the 3rd level up to an amount of times equal to your Charisma modifier (minimum of 1)."
			]
		},
		{
			"name": "Power from Death",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Undying"
				}
			],
			"entries": [
				"When you stabilize a creature with {@spell spare the dying}, you may regain one expended warlock spell slot. You can't do so again until you finish a short or long rest."
			]
		},
		{
			"name": "Rite of Returning",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 18,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Undying or Undead (Revised)"
				}
			],
			"entries": [
				"You can cast {@spell clone} once using a warlock spell slot. You can't do so again until you finish a long rest."
			]
		},
		{
			"name": "Servants of the Green Path",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Archfey or Wilderness"
				}
			],
			"entries": [
				"You can cast {@spell conjure animals} once using a warlock spell slot. You can’t do so again until you finish a long rest."
			]
		},
		{
			"name": "Water's Edge",
			"source": "WMInvocations",
			"featureType": "EI",
			"prerequisite": [
				{
					"pact": "Blade",
					"level": {
						"level": 5,
						"class": {
							"name": "Warlock"
						}
					},
					"patron": "Fathomless"
				}
			],
			"entries": [
				"As a bonus action, you can create a melee weapon you are proficient with from a source of water for a duration of 1 minute. This weapon counts as magical for the purposes of overcoming resistance and immunity to nonmagical attacks. It also counts as your pact weapon for the purposes of any features. If you are not wielding the weapon you created using this feature at the end of your turn, it disappears. You can use this feature up to the amount of times equal to your Charisma modifier (minimum of 1) and you regain any expended uses after a short or long rest. You can decide from two options when you summon this weapon:",
				{
					"type": "entries",
					"name": "Ice Edge:",
					"entries": [
						"Your weapon turns to ice and deals an additional {@dice 1d6} cold damage, on top of your normal melee damage. The damage is increased by an additional {@dice 1d6} at 9th ({@dice 2d6}), 13th ({@dice 3d6}), and 17th ({@dice 4d6}) level."
					]
				},
				{
					"type": "entries",
					"name": "Lightning Edge:",
					"entries": [
						"Your weapon electrifies around the water blade and deals an additional {@dice 1d6} lightning damage, on top of your normal melee damage. The damage is increased by an additional {@dice 1d6} at 9th ({@dice 2d6}), 13th ({@dice 3d6}), and 17th ({@dice 4d6}) level."
					]
				}
			]
		}
	]
}