{
	"_meta": {
		"sources": [
			{
				"json": "WMRaces",
				"abbreviation": "WMR",
				"full": "West March Races",
				"authors": [
					"Gebri"
				],
				"convertedBy": [
					"Gebri#6820"
				],
				"version": "1.0.0",
				"url": "https://wyth.github.io/SRP/",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1537874753,
		"dateLastModified": 1537874753
	},
	"race": [
		{
			"name": "Firenewt",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"dex": 2,
					"con": 1
				}
			],
			"traitTags": [
				"Spellcasting",
				"Damage Resistance"
			],
			"languageProficiencies": [
				{
					"primordial": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Firenewts reach adulthood at age five, but have been known to live up to 50 years."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Firenewts worship Imix, the Prince of Evil Fire. A religion which permeates their very being, causing them to revel in evil acts across the Plane of Fire. Firenewt society has few rules, although they are more regimented than a goblin horde or an orc tribe. They are thus usually more neutral rather than lawful or chaotic."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"A firenewt stands at roughly 6 feet tall (about a third of which being their necks), and maintain narrow, extremely tubular torsos. They are, without doubt, the sexiest creatures on Kagrea. Your size is Medium."
					],
					"type": "entries"
				},
				{
					"name": "Amphibious?",
					"entries": [
						"You can breathe in smoke, air, and water. In addition, you can ingest lava and other flammable liquids."
					],
					"type": "entries"
				},
				{
					"name": "Spit Fire",
					"entries": [
						"As a bonus action, you can spit a molt of fire at a creature within 10 feet of you. That creature must make a Dexterity saving throw equal to 8 + your proficiency bonus + your Constitution modifier. On a failed save, that creature takes {@dice 1d8} fire damage, or half as much on a successful one. The fire damage increases to {@dice 2d8}} at 5th level. {@dice 3d8}} at 10th level, {@dice 4d8}} at 15th level, and {@dice 5d8}} at 20th level. Once you use this feature, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Lizard of Flames",
					"entries": [
						"You have resistance to fire damage, and do not take any damage from being immersed in lava or other hot liquids. In addition, you do not suffer any ill effects from extreme heat."
					],
					"type": "entries"
				},
				{
					"name": "Conventional Weaponry",
					"entries": [
						"You gain proficiency in scimitars."
					],
					"type": "entries"
				},
				{
					"name": "Touched by the Fire Lord",
					"entries": [
						"As an action, you immerse yourself in the rage of Imix, the Prince of Evil Fire. For the next minute, whenever you take slashing or piercing damage from a creature within 5 feet of you, that creature takes {@dice 1d6} fire damage. Once you use this feature, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common, Ignan, and Draconic."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Aarakocra",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 25,
				"fly": 40
			},
			"ability": [
				{
					"dex": 2,
					"wis": 1
				}	
		
			],
			"traitTags": [
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"primordial": true,
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Aarakockra tend to grow up very fast, reaching adulthood at the age of 14 and living up to 70 years."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Aarakocra are about 5 feet tall. They have thin, lightweight bodies that weigh between 80 and 100 pounds. Your size is Medium."
					]
				},
				{
					"name": "Attuned Flight",
					"entries": [
						"You have a flying speed of 40 feet. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item."
					],
					"type": "entries"
				},
				{
					"name": "Updraft",
					"entries": [
						"Your powerful legs come segmented into two separate sections, which shift together tightly to produce a large amount of force that puts horses to shame.As a bonus action, you can launch yourself 10-feet into the air in a single movement. This movement does not provoke opportunity attacks, and you immediately begin flying with your Attuned Flight or similar feature. If you do not have a fly speed, you maintain your elevation for a few seconds, falling back to the ground at the end of your turn. Once you use this ability, you cannot do so again until you finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Peak Dwellers",
					"entries": [
						"You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to strong wind and cold environments, as described in chapter 5 of the Dungeon Master's Guide, and have resistance to cold damage."
					],
					"type": "entries"
				},
				{
					"name": "Talons",
					"entries": [
						"You have proficiency with your claws, which are a finesse weapon that deal 1d6 slashing damage."
					],
					"type": "entries"
				},
				{
					"name": "Shining Wings",
					"entries": [
						"Your wings have been sheened with a divine blessing from the Elemental Plane of Air, which you can use to reestablish your connection to your forlorn home. As a bonus action, you regain 2d4+4 hit points. Once you use this ability, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common, Aarakocra, and Auran."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Awakened",
			"source": "WMRaces",
			"size": "T",
			"speed": {
				"walk": null
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Imbued with magic, awakened age more slowly and typically live much longer than their unawakened counterparts. They reach adulthood after a year but can live for as long as 60 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Awakened will generally adopt the alignment of their owner, if they have any. Without an owner, an awakened upbringing can be radically different, as a result of the instinctual urges various breeds of awakened have. The best and worst exist among their ranks."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Awakened are miniscule individuals, yet their sizes vary greatly. Cats reach just under 1 foot tall and 2 feet long from head to tail, typically weighing between 7 and 10 pounds, with larger breeds weighing up to 20 pounds. Dogs, meanwhile, are about 2 to 3 feet in height and generally weigh between 40 and 90 pounds. Regardless of your breed, your size is Tiny."
					]
				},
				{
					"type": "entries",
					"name": "Beastly",
					"entries": [
						"Your creature type is beast, rather than humanoid."
					]
				},
				{
					"type": "entries",
					"name": "You Are an Animal",
					"entries": [
						"Awakened don't have hands, but their arms (depending on the breed) are dextrous enough to handle small complex tasks. Awakened can pick up weapons but can't use them in combat."
					]
				},
				{
					"type": "entries",
					"name": "Amongst Giants",
					"entries": [
						"Tiny creatures have advantage on Dexterity saving throws, but disadvantage on Strength saving throws. In addition, tiny creatures can move into the spaces of creatures that are small or larger, provoking opportunity attacks as normal. They have a reach of 0 feet, meaning they must be in the same space as a creature to use a weapon or touch spell. This feature does not take effect if you are not currently considered Tiny."
					]
				}
			],
			"subraces": [
				{
					"name": "Cat",
					"speed": {
						"walk": 35,
						"climb": 30
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"wis": 1,
							"choose": {
								"from": [
									"dex",
									"int"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Darkvision",
							"entries": [
								"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
							]
						},
						{
							"type": "entries",
							"name": "Animal Instinct",
							"entries": [
								"Your base walking speed increases to 35 and your base climbing speed increases to 30."
							]
						},
						{
							"type": "entries",
							"name": "Escape Artist",
							"entries": [
								"While you are conscious, fall damage cannot knock you prone. In addition, you can use your reaction to reduce fall damage by an amount equal to 5 times your level. If this would reduce the damage of a fall greater than 20 feet to zero, you can choose to move a distance equal to half of your movement speed as part of the same reaction without provoking opportunity attacks."
							]
						},
						{
							"type": "entries",
							"name": "Cat's Claws",
							"entries": [
								"Your claws are natural weapons with the finesse property, which you can use to make unarmed strikes. On a hit, you deal slashing damage equal to {@dice 1d4} + your Strength or Dexterity modifier, instead of the typical bludgeoning damage of an unarmed strike."
							]
						},
						{
							"type": "entries",
							"name": "Cat's Talents",
							"entries": [
								"You have proficiency in the {@skill Perception} and {@skill Stealth} skills."
							]
						},
						{
							"type": "entries",
							"name": "Pounce!",
							"entries": [
								"As a bonus action, you can leap to a creature you can see within 30 feet without provoking opportunity attacks. Once you use this feature, you cannot use it again until you finish a short or long rest."
							]
						},
						{
							"type": "entries",
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and one other language of your choice."
							]
						}
					]
				},
				{
					"name": "Chicken",
					"speed": {
						"walk": 25
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"dex": 1,
							"choose": {
								"from": [
									"con",
									"wis"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Peck & Claw",
							"entries": [
								"You have proficiency with your claws, which are a finesse weapon that deal {@dice 1d6} slashing damage."
							]
						},
						{
							"type": "entries",
							"name": "Into the Sunset",
							"entries": [
								"If you move at least 10 feet on foot, you can choose to gain a fly speed equal to your remaining movement. A chicken who begins to fly must end their movement on the ground or a solid surface. A chicken who ends its turn in the air immediately plummets to the ground. To use this speed you can't be wearing medium or heavy armor.",
								"In addition, while falling, you can use your reaction to slow your descent as if you were under the effects of the {@spell feather fall} spell."
							]
						},
						{
							"type": "entries",
							"name": "Bawk!",
							"entries": [
								"When you use your action to perform a melee attack, you can use the Help action against the target as a bonus action, as you begin to pester them with your flailing wings."
							]
						},
						{
							"type": "entries",
							"name": "Absurdly Paranoid",
							"entries": [
								"You are proficient in the {@condition Perception} skill and cannot have disadvantage on Wisdom {@condition Perception} checks."
							]
						},
						{
							"type": "entries",
							"name": "Tale of the Headless Chicken",
							"entries": [
								"As a bonus action on your turn, you can make a Wisdom saving throw against your chicken DC (12 - your Wisdom modifier) On a failed save, you fall under the {@condition frightened} condition for one turn against all enemies within a 60 foot radius, but can move toward them so long as would end your turn further away from them than before. Regardless of whether you succeed or fail this saving throw, your movement speed increases by 25 until the end of your turn. Once you use this feature. you cannot use it again until you finish a short or long rest."
							]
						},
						{
							"type": "entries",
							"name": "Bleh",
							"entries": [
								"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. If you do so, you fall into a heap of unconscious feathers and render yourself {@condition prone}. You are considered to be under similar effects to the {@spell feign death} spell. While subject to this condition, you are unable to move or take actions other than using an action to end this effect. Once you use this trait, you are unable to use it again until you finish a long rest."
							]
						},
						{
							"type": "entries",
							"name": "Languages",
							"entries": [
								"You can read and understand Common and one language of your choice. You are unable to speak, but can communicate via a series of clucks, squawks, cackles, and similar utterances to other avian creatures. You are unable to write, but on any appropriate surface, you can create a form of writing known as chicken scratch, which can be discerned by a successful Intelligence check with the DC equal to 12 - your proficiency bonus - your Dexterity modifier."
							]
						}
					]
				},
				{
					"name": "Dog",
					"speed": {
						"walk": 40
					},
					"ability": [
						{
							"con": 1,
							"choose": {
								"from": [
									"str",
									"dex",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Bite",
							"entries": [
								"Your carnivorous canines are a natural weapon, which you can use to make unarmed strikes. On a hit, you deal slashing damage equal to {@dice 1d6} + your Strength modifier, instead of the typical bludgeoning damage of an unarmed strike."
							]
						},
						{
							"type": "entries",
							"name": "Animal Instinct",
							"entries": [
								"Your base walking speed increases to 40."
							]
						},
						{
							"name": "Keen Nose",
							"entries": [
								"You have proficiency in the {@skill Perception} skill and gain advantage on Wisdom ({@skill Perception}) checks that rely on sight or smell."
							],
							"type": "entries"
						},
						{
							"name": "Speak!",
							"entries": [
								"You may use the Help action as a bonus action, for a number of times equal to your Proficiency bonus. You regain the ability to use the Help action this way after finishing a short or long rest. At level 3, when you use the Help action to aid an ally in attacking a creature, the target of that attack can be within 30 feet of you, rather than within 5 feet of you. Should the ally already have advantage, then it may add half your proficiency bonus (rounded up) to the attack's hit and damage roll instead."
							],
							"type": "entries"
						},
						{
							"name": "Who's a Good Boy?",
							"entries": [
								"As an action, you can comfort a friendly creature within 5 feet who isn't {@condition incapacitated}. For one minute, the affected creature cannot be {@condition frightened}, and they are no longer under the effects of the {@condition frightened} condition if they were previously. You can use this ability a number of times equal to your Charisma modifier (minimum 1), and regain all expended uses on a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Loyal & Loved",
							"entries": [
								"While attempting to convince a creature of something, you can choose to attack their hearts directly with the most adorable pair of puppy eyes they've ever seen. For the next minute, you gain advantage on Charisma ({@skill Persuasion}) checks against that creature. Once you use this feature, you cannot use it again until you finish a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and one other language of your choice."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Elf  (City)",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": 30
			},
			"ability": [
				{
					"dex": 2,
					"int": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."
					]
				},
				{
					"name": "Darkvision",
					"entries": [
						"Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Keen Senses",
					"entries": [
						"You have proficiency in the Perception skill."
					],
					"type": "entries"
				},
				{
					"name": "Fey Ancestry",
					"entries": [
						"You have advantage on saving throws against being charmed, and magic can't put you to sleep."
					],
					"type": "entries"
				},
				{
					"name": "Trance",
					"entries": [
						"Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance.') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
					],
					"type": "entries"
				},
				{
					"name": "Agile Scaler",
					"entries": [
						"You gain a climb speed equal to 30 feet."
					],
					"type": "entries"
				},
				{
					"name": "Mask of the Urbane",
					"entries": [
						"You can attempt to hide even when you are only lightly obscured by crowds, smoke, structures, and other urban features."
					],
					"type": "entries"
				},
				{
					"name": "Streetwise",
					"entries": [
						"You gain proficiency with one of the following skills of your choice: Deception, Intimidation, Persuasion, Sleight of Hand, or Stealth."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Aasimar  (Court)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"dex": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting",
				"Improved Resting"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Age",
					"entries": [
						"You mature at the same rate as an elf, but you can live up to 1,000 years."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Fey Ancestry",
					"entries": [
						"You have advantage on saving throws against being charmed, and magic can't put you to sleep."
					],
					"type": "entries"
				},
				{
					"name": "Trance",
					"entries": [
						"Trance. You don't need to sleep. Instead, you meditate deeply, remaining semiconscious, for 4 hours a day. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
						"{@note If you meditate during a long rest, you finish the rest after only 4 hours. You otherwise obey all the rules for a long rest; only the duration is changed.}"
					],
					"type": "entries"
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Healing Hands",
					"entries": [
						"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Light Bearer",
					"entries": [
						"You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Guidance From the Past",
					"entries": [
						"Starting at 3rd level, you can use a bonus action to draw on your connection to your ancestors. Misty tendrils flow around you, whispering advice only you can hear.",
						"Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you gain advantage on all Wisdom checks and saving throws.",
						"Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common, Elvish, and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Demibeast",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"traitTags": [],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Young demibeasts grow quickly, reaching maturity by 10 years of age, but only live for up to 80 years. Many demibeasts see dying as a result of old age as a sign of weakness, and as such, most demibeast die in battle or during their hunts. There are a few, though, such as those who take on the appearance of sheep, as multiple years of sedimentary living have left them more passive then their brethren."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Demibeasts of the wolf blood are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Sheep blood, however, tend to be equivalent in size to the average human. Your size is Medium."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Demibeasts tend toward no particular alignment. The best and the worst are found among them."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"Accustomed to roaming under the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Man & the Beast",
					"entries": [
						"You have two creature types: humanoid and beast. You can be affected by a spell or ability that works on either of your creature types."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Wolf",
					"ability": [
						{
							"choose": {
								"from": [
									"str",
									"con",
									"wis"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"speed": {
						"walk": 35
					},
					"entries": [
						{
							"name": "Ability Score Increase",
							"entries": [
								"Choose one of the abilities you did not increase between Strength, Constitution, or Wisdom. That ability score increases by 1."
							],
							"type": "entries"
						},
						{
							"name": "Gait of the Wolf",
							"entries": [
								"Your base walking speed increases to 35 feet."
							],
							"type": "entries"
						},
						{
							"name": "Howl of the Beast",
							"entries": [
								"When you roll initiative and aren't surprised, you can use your reaction to unleash a howl to rally your allies for battle. You can choose a number of friendly creatures that can hear you equal to your Consitution or Wisdom modifier (your choice). If any of those creatures are surprised, they're no longer surprised, and they can move up to half their speed as a reaction. After you use your battle howl, you can't use it again until you complete a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Carnivorous Bite",
							"entries": [
								"Your fanged maw is a natural weapon, which you are proficient with. If you hit with it, you deal piercing damage equal to {@dice 1d8} + your Strength modifier."
							],
							"type": "entries"
						},
						{
							"type": "entries",
							"name": "Birthright",
							"entries": [
								"You grew up in a territory that grants you benefits. Choose one of the types of territories from the Demibeast Territory table. You only need to sleep for 4 hours while performing a long rest in your territory, as you've adapted to survival there. Additionally, you're naturally adapted to the climate associated with your territory, as described in chapter 5 of the Dungeon Master's Guide.",
								"If no climate is specialized under the climate benefit column, you instead gain advantage on saving throws against any conditions mentioned.",
								{
									"type": "table",
									"caption": "Demibeast Territory",
									"colLabels": [
										"Territory",
										"Climate Benefit",
										"Damage Resistance"
									],
									"colStyles": [
										"col-4",
										"col-4",
										"col-4"
									],
									"rows": [
										[
											"Arctic",
											"Extreme Cold",
											"Cold"
										],
										[
											"Desert",
											"Extreme Heat",
											"Fire"
										],
										[
											"Forest",
											"{@condition Posioned} Condition",
											"Poison"
										],
										[
											"Mountain",
											"High Altitude",
											"Cold"
										]
									]
								}
							]
						},
						{
							"name": "Unrivaled Hunter",
							"entries": [
								"Whenever you make a Wisdom ({@skill Survival}) check related to smelling out a trail or following a creature's scent, you are considered proficient in the Survival skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demibeast could speak with sheep."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Sheep",
					"ability": [
						{
							"choose": {
								"from": [
									"dex",
									"int",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"speed": {
						"walk": 30
					},
					"entries": [
						{
							"name": "Ability Score Increase",
							"entries": [
								"Choose one of the abilities you did not increase between Dexterity, Intelligence, or Charisma. That ability score increases by 1."
							],
							"type": "entries"
						},
						{
							"name": "Sure-Footed",
							"entries": [
								"You have advantage on saving throws against being knocked {@condition prone}."
							],
							"type": "entries"
						},
						{
							"name": "Ram",
							"entries": [
								"You can use your head and horns to make unarmed strikes. If you hit with them, you deal bludgeoning damage equal to {@dice 1d4} + your Strength modifier."
							],
							"type": "entries"
						},
						{
							"name": "Herd Mentality",
							"entries": [
								"So long as there is an ally within 15 feet of you, you have advantage on saving throws that would cause you to be {@condition frightened}."
							],
							"type": "entries"
						},
						{
							"name": "Peak Dwellers",
							"entries": [
								"You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to strong wind and cold environments, as described in chapter 5 of the Dungeon Master's Guide."
							],
							"type": "entries"
						},
						{
							"name": "Counting Sheep",
							"entries": [
								"At 1st level, you can cast the {@spell sleep} spell once per long rest. When you reach 5th level, you can cast {@spell sleep} at 3rd level once per short or long rest. Intelligence or Charisma (your choice) is your spellcasting modifier for this spell."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demibeast could speak with sheep."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Ursus",
					"ability": [
						{
							"choose": {
								"from": [
									"con",
									"wis"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"speed": {
						"walk": 30
					},
					"entries": [
						{
							"name": "Ability Score Increase",
							"entries": [
								"Choose one of the abilities you did not increase between Constitution or Wisdom. That ability score increases by 1."
							],
							"type": "entries"
						},
						{
							"name": "Powerful Build",
							"entries": [
								"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
							],
							"type": "entries"
						},
						{
							"name": "Mountain Born",
							"entries": [
								"You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to cold climates, as described in chapter 5 of the Dungeon Master's Guide."
							],
							"type": "entries"
						},
						{
							"name": "Rugged Hide",
							"entries": [
								"The body of the Ursus has calloused over the years, becoming as tough as hardened leather. When you aren't wearing armor, your AC is 12 + your Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
							],
							"type": "entries"
						},
						{
							"name": "Stench of War",
							"entries": [
								"You have advantage on Wisdom ({@skill Perception}) checks related to determining a creature's location using the smell of blood, or deciphering the species of a creature using their blood."
							],
							"type": "entries"
						},
						{
							"name": "Protector of the Ursa",
							"entries": [
								"When an ally within 10-feet of you is subject to a Dexterity saving throw, you may choose to intercept the effect and have it target you instead. When you use this feature, the Dexterity saving throw instead becomes a Strength saving throw for you. Once you use this ability, you cannot use it again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demibeast could speak with sheep."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Leonin",
					"ability": [
						{
							"choose": {
								"from": [
									"str",
									"con"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"speed": {
						"walk": 35
					},
					"entries": [
						{
							"name": "Ability Score Increase",
							"entries": [
								"Choose one of the abilities you did not increase between Strength or Constitution. That ability score increases by 1."
							],
							"type": "entries"
						},
						{
							"name": "Gait of the Lion",
							"entries": [
								"Your base walking speed increases to 35 feet."
							],
							"type": "entries"
						},
						{
							"name": "Claws",
							"entries": [
								"Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you can deal slashing damage equal to {@dice 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
							],
							"type": "entries"
						},
						{
							"name": "Rout the Enemy!",
							"entries": [
								"As a bonus action, you can let out an especially menacing roar. Creatures of your choice within 30 feet of you that can hear you must succeed on a Wisdom saving throw or become {@condition frightened} of you until the end of your next turn. The DC of the save equals 8 + your proficiency bonus + your Constitution modifier. Once you use this trait, you can't use it again until you finish a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Clamber",
							"entries": [
								"Your build and lion-like physique allow you to tread across dangerous terrain with added stability. When you move on your turn in combat, you can take to all fours, ignoring difficult terrain until the end of the turn. Once you use this trait, you cannot use it again until you finish a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Heightened Resolve",
							"entries": [
								"You have advantage on saving throws made to resist the {@condition poisoned} condition, and your hit points are doubled for the purposes of resolving the negative effects of the {@spell sleep} spell."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demibeast could speak with sheep."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Siren",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30,
				"swim": 30
			},
			"ability": [
				{
					"cha": 2
				}
			],
			"languageProficiencies": [
				{
					"common": true,
					"primordial": true
				}
			],
			"traitTags": [],
			"entries": [
				{
					"name": "Creature Type",
					"entries": [
						"You are both Humanoid and a Fey."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Sirens generally range from 4 to 6 feet tall. You are Medium."
					],
					"type": "entries"
				},
				{
					"name": "Amphibious",
					"entries": [
						"You can breathe air and water."
					],
					"type": "entries"
				},
				{
					"name": "Enchanting Nature",
					"entries": [
						"You have advantage on saving throws against being charmed."
					],
					"type": "entries"
				},
				{
					"name": "Sirensong",
					"entries": [
						"You know the {@spell charm person} spell. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell when you cast them with this trait (choose when you select this race). Once you cast this spell, you can't cast it again until you finish a long rest. You can also cast this spell using any spell slots you have of the appropriate level.",
						"In addition, you can magically enchant your voice to enthrall the weak-minded. When you cast {@spell charm person}, you can sing the song of your people as part of the same action, directing any creatures that can hear you and are charmed by you to move towards a creature you can see within 60 feet. Affected creatures spend their next turn moving towards the designated creature.",
						"Once you use this feature, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Hot Spring Siren",
					"ability": [
						{
							"con": 1
						}
					],
					"entries": [
						{
							"name": "Hydrothermal Adaptation",
							"entries": [
								"Adapted to the heat channeled from within the earth, you have resistance to fire damage. In addition, you have the ability to channel heat into pools of water. As part of a short or long rest, you can touch a volume of water no larger than a 10-foot cube, instantly setting it to a warm simmer. Creatures that immerse themselves within this water gain temporary hit points equal to your proficiency bonus. Once you use this feature, you can't use it again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Healing Hands",
							"entries": [
								"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You can speak, read, and write Common and Primordial."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Oceanic Siren",
					"ability": [
						{
							"str": 1
						}
					],
					"entries": [
						{
							"name": "Bioluminescence",
							"entries": [
								"As a bonus action, you can make your skin glow with patches of eerie light, shedding bright light in a 15-foot radius and dim light for an additional 15 feet. This light can be colored as you like, and you can also use it to form simple patterns on your skin. The light lasts until you dismiss it as a bonus action."
							],
							"type": "entries"
						},
						{
							"name": "Abyssal Adaptation",
							"entries": [
								"Adapted to even the most extreme ocean depths, you have resistance to cold damage. In addition, you can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
							],
							"type": "entries"
						},
						{
							"name": "Sirenlight",
							"entries": [
								"You can magically enchant your bioluminescent lights to enthrall the unwary. When you use your Sirensong, you can emit an enchanting glow instead of singing. When you use your Sirensong in this way, creatures that can see you are affected even if they cannot hear you."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You can speak, read, and write Common and Primordial."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "River Siren",
					"ability": [
						{
							"dex": 1
						}
					],
					"entries": [
						{
							"name": "Deceiver of Fools",
							"entries": [
								"You gain proficiency in your choice of Deception, Insight, Persuasion, or Stealth."
							],
							"type": "entries"
						},
						{
							"name": "One with the Water",
							"entries": [
								"You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena. In addition, if you are fully submerged in water, you can use your action to make yourself and anything you are holding or carrying take on a water-like texture, rendering them invisible. This invisibility lasts until you make an attack, cast a spell, or are no longer fully submerged."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You can speak, read, and write Common and Primordial."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Demihuman",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"count": 1
					}
				}
			],
			"traitTags": [],
			"languageProficiencies": [
				{
					"common": true,
					"beastspeech": true
				}
			],
		"entries": [
		{
			"type": "entries",
			"name": "Age",
			"entries": [
				"Demihumans reach adulthood in their late teens and live less than a century."
			]
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Demiumans tend toward no particular alignment. The best and the worst are found among them."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Demihumans vary widely in height and build, from barely 4 feet to well over 7 feet tall. Regardless of your position in that range, your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demihuman could speak with sheep."
			]
		},
		{
			"type": "entries",
			"name": "Birth From Creation",
			"entries": [
				"All Demihumans are radically different from one another, depending on the changes than manifested within them from birth. You can select one bestial enhancement now, a second bestial enhancement at 5th level, and a third bestial enhancement at 9th level.",
				"At 1st level, choose one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Born From Waves",
							"entry": "You can breathe air and water, and you have a swimming speed equal to your walking speed."
						},
						{
							"type": "item",
							"name": "Adept Climber",
							"entry": "You have a climbing speed equal to your walking speed."
						},
						{
							"type": "item",
							"name": "Darkvision",
							"entry": "Accustomed to life underground or the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
						}
					]
				},
				"At 5th level, your body evolves further, developing new characteristics. Choose one of the options you didn't take at 1st level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Natural Armor",
							"entry": "When you aren’t wearing armor, your AC equals 12 + your Constitution or Dexterity modifier (your choice)."
						},
						{
							"type": "item",
							"name": "Echolocation",
							"entry": "As a bonus action on your turn you can emit a shriek inaudible to creatures without this trait. Until the end of your next turn you have blindsight up to 30 feet away while you are not deafened. You have a number of uses equal to your proficiency bonus, and you regain all uses of it when you finish a short or long rest. "
						},
						{
							"type": "item",
							"name": "Chameleon",
							"entry": "You have advantage on Dexterity (Stealth) checks if you have not used your movement during the current turn. In addition, you can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
						}
					]
				},
				"At 9th level, your body has reached the pinnacle of its evolution, developing a final characteristic. Choose one of the options you didn't take at 1st or 5th level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Attuned Flight",
							"entry": "You have a flying speed of 30 feet. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item."
						},
						{
							"type": "item",
							"name": "Relentless",
							"entry": "When you are left with 0 hit points but not killed outright, you can use a reaction to be left with 1 hit point instead. Once you use this ability, you cannot use it again until you finish a long rest."
						},
						{
							"type": "item",
							"name": "Grappling Appendages",
							"entry": "You have two special appendages growing alongside your arms. As an action, you can use one of them to try to grapple a creature. Each one is also a natural weapon, which you can use to make an unarmed strike. If you hit with it, the target takes bludgeoning damage equal to {@dice 1d6} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. Immediately after hitting, you can try to grapple the target as a bonus action. These appendages can't precisely manipulate anything and can't wield weapons, magic items, or other specialized equipment."
								}
							]
						}
					]
				}
			]
		},
		{
			"name": "Flameveil",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"str": 1
					}
			],
			"darkvision": 120,
			"traitTags": [
				"Spellcasting",
				"Damage Resistance"
			],
			"languageProficiencies": [
				{
					"common": true,
					"primordial": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Flameveil reach adulthood in their late teens and live less than a century. Flameveils who merge with an elemental can live upwards of 300 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Flameveil society, with its clear devotion to their deity, has a strong lawful bent. Because of their isolation, they tend to lean more toward neutral."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Flameveil take the shape of humans, and as such, they vary widely in height and build, from barely 5 feet to well over 6 feet tall. Your size is Medium."
					]
				},
				{
					"name": "Candle in the Dark",
					"entries": [
						"You appear to be surrounded by a soft flickering candlelight that extends outwards 30 feet in all directions. As a bonus action, you can smother your flames and cause them to dim. Dimming your flames this way causes no visible light emit from your body, although up-close inspection will still reveal a faint flickering light."
					],
					"type": "entries"
				},
				{
					"type": "entries",
					"name": "Heritage of the Flameveil",
					"entries": [
						"You were born to the Eternal Hearth. As a flameveil, you are composed of the plane of fire's will and desire—yet the flameveil were never a warlike race. On the contrary, they often fought defensively, protecting their land from clans such as the firenewt tribes and elementals which roamed their homeworld. As a child of the Eternal Hearth, you gain the following benefits:",
					{	
					"type": "list",
					"items": [
							"You have two creature types: humanoid and elemental. You can be affected by a spell or ability that works on either of your creature types.",
							"The first time you would be subjected to fire damage, you treat that attack as if you had immunity. Afterwards, your immunity transforms into resistance. This temporary immunity resets on a short or long rest.",
							"You learn the {@spell control flames|xge} and {@spell produce flame} cantrips. Charisma is your spellcasting modifier for these spells.",
							"For many millennia, your people have done battle with elementals, and you know their tricks. You have advantage on Constitution and Dexterity saving throws made to avoid or resist fire."
							]
						}
					]
				},
				{
					"name": "Body of Flame",
					"entries": [
						"While you appear humanoid on the offset, your true form is composed of extremely-dense fire which can be easily morphed into the visage of a human. That form can easily be dropped at a moment's notice, although it requires a decent bit of stamina to perform.",
						"When you would be subject to a melee or ranged weapon attack, you can roll a Dexterity or Charisma saving throw (your choice) as a reaction with a DC equal to 8 + the creature's to-hit modifier. On a successful save, the attack misses. You can use this feature twice, and regain all expended uses on a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Final Light",
					"entries": [
						"Starting at 2nd level, upon reaching zero hit points, your body becomes one with the Eternal Hearth, and you explode into a fiery storm. Each hostile creature in a 30 feet radius must make a Dexterity saving throw equal to your 8 + your Charisma modifier + your proficiency bonus. On a failed save, they take {@dice 1d8} fire damage. For every two levels above 2, add an additional {@dice 1d8} fire damage. On a successful save, they instead take half damage. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Primordial."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Half-Nasod",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"dex": 2,
					"choose": {
						"from": [
							"con",
							"int"
						],
						"count": 1
					}
				}
			],
			"traitTags": [],
			"languageProficiencies": [
				{
					"common": true,
					"neural": true
				}
			],
		"entries": [
		{
			"type": "entries",
			"name": "Age",
			"entries": [
				"Half-Nasods age at virtually the same rate as Humans, although they live a bit longer, with the oldest of them being around one-hundred and thirty years old."
			]
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Half-Nasods tend toward no particular alignment. The best and the worst are found among them."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Half-Nasods vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You can speak, read, and write Common and Neural."
			]
		},
		{
			"type": "entries",
			"name": "Cybernetic Implants",
			"entries": [
				"All Half-Nasods have been modified from their original race in some way, with these cybernetics varying immensely. You can select one cybernetic enhancement now, a second cybernetic enhancement at 5th level, and a third cybernetic enhancement at 9th level.",
				"At 1st level, choose one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Implanted Weapon",
							"entry": "You have a one-handed ranged or melee weapon that you are proficient with hidden under your skin. This weapon has the properties it would normally have, and the Concealed property if it didn’t have it already. Drawing this weapon is an item interaction. You may swap out the weapon implanted in this way whenever you gain a level. You may choose this implant a second time."
						},
						{
							"type": "item",
							"name": "Optical Implants",
							"entry": "In conditions of clear visibility, you can make out details of even extremely distant creatures and objects as small as 2 feet across. You can also see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades representative of thermal vision."
						},
						{
							"type": "item",
							"name": "Burst Joint",
							"entry": "Your movement speed is raised from 30 to 35. You may also Dash as a bonus action once per short or long rest."
						}
					]
				},
				"At 5th level, you manage to acquire a new cybernetic implant, allowing you access to new abilities. Choose one of the options you didn't take at 1st level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Propulsion Systems",
							"entry": "As a bonus action, you may manifest your propulsion systems. You gain a flight speed equal to your walking speed, though you must end your turn on a solid surface. Otherwise, your propulsion systems will sputter out, and you fall to the ground at the end of your turn. You may activate your propulsion systems a number of times equal to your proficiency bonus. You regain all expended uses on a long rest."
						},
						{
							"type": "item",
							"name": "Reinforced Bones",
							"entry": "As a reaction to when you are hit by an attack, you may increase your AC by 2 until the start of your next turn as you attempt to block incoming attacks. You may do this an amount of times equal to your proficiency bonus. You regain all expended uses on a long rest."
						},
						{
							"type": "item",
							"name": "Microgenerator",
							"entry": "You’ve implanted a small, high-voltage generator within your circulatory system that packs a shocking punch. When you’re reduced to a quarter of your hit points (rounded down), you may use a reaction to unleash an electroshock in a ten foot radius. All creatures within that radius must make a Strength saving throw equal to 8 + proficiency bonus + Constitution modifier or be pushed back ten feet and knocked prone. Once you’ve used this implant, you must complete a long rest before using it again."
						}
					]
				},
				"At 9th level, you've managed to acquire one last cybernetic enhancement, as modifying yourself any further would strain your body too much. Choose one of the options you didn't take at 1st or 5th level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Internal Defibrillator",
							"entry": "When you would die from failing three death saving throws, an electric jolt is sent into your heart, stabilizing you on the spot and saving you from certain death. Once activated, you must complete a long rest before this implant recharges."
						},
						{
							"type": "item",
							"name": "High Intelligence Chip",
							"entry": "You gain access to 1 extra language or 1 extra skill proficiency of your choice and the ability to gain proficiency in one weapon of your choice. While this chip is in your head, you gain the ability to gain advantage on a skill check you have proficiency in. You may do this a number of times equal to your Proficiency bonus. You regain all expended uses on a long rest."
						},
						{
							"type": "item",
							"name": "Cybernetic Reflexes",
							"entry": "You may take the Dodge action as a bonus action an amount of times equal to half your proficiency bonus, rounded down. You regain all expended uses on a long rest."
								}
							]
						}
					]
				}
			]
		},
		{
			"name": "Kitsune",
			"source": "WMRaces",
			"size": "V",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2
				}
			],
			"languageProficiencies": [
				{
					"common": true,
					"sylvan": true,
					"choose": true
				}
			],
			"darkvision": 60,
			"traitTags": [],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Kitsune mature slowly, achieving adulthood at 20 and living up to 300 with only one tail."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Born in the epicenter of Yonia between the mortal plane and the spiritual plane, Kitsune adhere mostly to a neutral alignment. Some will align with humanity, and awaken a spark of good, while others align with the darkness and become Nogitsune."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Your size is Medium when in human form. In fox form, your size is Small."
					]
				},
				{
					"name": "Keen Senses",
					"entries": [
						"You have advantage on {@skill Perception} checks pertaining to scent or hearing."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"Fey in origin, Kitsune can see in dim light within 60 feet as if it were bright light, and in darkness as if it were dim. You cannot discern color in darkness, only in shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "The Nine Tailed Path",
					"entries": [
						"Kitsune begin with a single fox tail generally 3 feet long. At 4th level and every 2 levels afterwards, you grow an additional tail as you grow in worldly experience. Each tail you possess increases your lifespan by 100 years. Tails which are cut off or otherwise removed do not grow back naturally, but may be restored by use of the {@spell regenerate} spell. Losing a tail or tails does not affect the years you gain of extended life."
					],
					"type": "entries"
				},
				{
					"name": "Shapeshift",
					"entries": [
						"Your connection to the Feywild and bonds with the Spirit Realm allow you to transform into your ancestral half—a being who represents your clan and their ancestors, also known as a Spirit Fox.",
						"You can transform between your fox and human forms as an action. Alternatively, you can choose to transform from a fox back into a human as a bonus action. While in your Spirit Fox form, you maintain the ability to read, write, and speak any languages you already know, but lose the ability to cast spells other than cantrips.",
						"Your weapons and clothes transform with you when you use this ability. While your paws are dexterous enough to handle small complex tasks, you cannot use weapons in combat.",
						"While you are in your Spirit Fox form, your base movement speed becomes 40. If your base movement speed was equal to 40 or higher before your transformation, it instead increases by an additional 5 feet. In addition, you gain access to your Bite and Claw attacks (mentioned under the Slash & Maul racial feature) while in your Spirit Fox form.",
						"Instead to changing shape, you can choose to instead hide your ears and tail(s) to appear human completely. This transformation acts like a limited version of the {@spell alter self} spell."
					],
					"type": "entries"
				},
				{
					"name": "Slash and Maul",
					"entries": [
						"You are proficient with your unarmed strikes. When you make an unarmed attack, decide whether you're attacking with your claws or your bite. Your claws deal {@dice 1d4} slashing damage on a hit, whereas your bite deals {@dice 1d6} piercing damage."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Atsui",
					"ability": [
						{
							"str": 1
						}
					],
					"entries": [
						{
							"name": "First Clan of Flame",
							"entries": [
								"Your unarmed claw attacks now deal {@dice 1d4} fire damage."
							],
							"type": "entries"
						},
						{
							"name": "Sticky Fingers",
							"entries": [
								"You have advantage on {@skill Sleight of Hand} checks made to pick pockets without being noticed."
							],
							"type": "entries"
						},
						{
							"name": "Trickster",
							"entries": [
								"When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and take the higher amount. You can use this feature once per tail you possess, and regain all expended uses when you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Sylvan, and one other language of your choice."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Samui",
					"ability": [
						{
							"int": 1
						}
					],
					"entries": [
						{
							"name": "Second Clan of Ice",
							"entries": [
								"Your unarmed claw attacks now deal {@dice 1d4} cold damage."
							],
							"type": "entries"
						},
						{
							"name": "Detective",
							"entries": [
								"You gain advantage on Intelligence checks made to discover clues and piece together evidence."
							],
							"type": "entries"
						},
						{
							"name": "Logical Mind",
							"entries": [
								"Your mind is inherently logical, and is not easily swayed. As a bonus action, you can end one effect causing you to be {@condition charmed} or {@condition frightened}. You can use this feature once per tail you possess, and regain all expended uses when you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Sylvan, and one other language of your choice."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Tsuki",
					"ability": [
						{
							"wis": 1
						}
					],
					"entries": [
						{
							"name": "Third Clan of the Moon",
							"entries": [
								"Your unarmed claw attacks now deal {@dice 1d4} radiant damage."
							],
							"type": "entries"
						},
						{
							"name": "Superior Darkvision",
							"entries": [
								"Blessed by the moon, the Tsuki can call upon its illumination to enhance their eyes as naturally as they breathe. Your darkvision improves to 120 feet, represented by your internal connection to your clan's symbol."
							],
							"type": "entries"
						},
						{
							"name": "Lunar Charm",
							"entries": [
								"You can cast the {@spell charm person} spell once with this trait, and regain the ability to do so when you finish a long rest. Charisma is your spellcasting modifier for this spell."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Sylvan, and one other language of your choice."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Hasumi",
					"ability": [
						{
							"dex": 1
						}
					],
					"entries": [
						{
							"name": "Fourth Clan of the Mist",
							"entries": [
								"Your unarmed claw attacks now deal {@dice 1d4} thunder damage."
							],
							"type": "entries"
						},
						{
							"name": "Born From Mist",
							"entries": [
								"As a bonus action, you can gain advantage on any {@skill Perception} or {@skill Stealth} check you make. You can use this feature once per tail you possess, and regain all expended uses when you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Misty Escape",
							"entries": [
								"As a reaction to taking damage, you can create a 20-foot-radius sphere of mist centered on you. The sphere spreads around corners, and its area is heavily obscured. It lasts for one minute or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. Once you use this ability, you can't do so again until you finish a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Sylvan, and one other language of your choice."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Nogitsune",
					"ability": [
						{
							"str": 1
						}
					],
					"entries": [
						{
							"name": "Fifth Clan of Shadow",
							"entries": [
								"Your unarmed claw attacks now deal {@dice 1d8} necrotic damage."
							],
							"type": "entries"
						},
						{
							"name": "Born From Beast",
							"entries": [
								"You gain proficiency in the {@skill Intimidation} skill."
							],
							"type": "entries"
						},
						{
							"name": "Frightening Presence",
							"entries": [
								"While in your natural fox form, your size is Medium instead of Small. Your eyes turn red and your fur turns a charred ashen black. As a bonus action, you can emit an aura of fear within a 10-foot radius for 1 minute. Any creature entering that aura must make a Wisdom saving throw or become frightened of you. The DC for this ability is 8 + your Charisma modifier + your proficiency bonus.",
								"Your opponent may make another saving throw at the end of their next turn. On a success, they are no longer frightened, and are immune to your aura for 24 hours. Once you use this trait, you can't use it again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Sylvan, and one other language of your choice."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Aasimar  (Mabaran)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"con": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"common": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Consuming Touch",
					"entries": [
						"As an action, you can make a melee spell attack against a creature within your reach. On a hit, the target takes necrotic damage equal to a number of d4s equal to your proficiency bonus, and you regain hit points equal to half the damage dealt (round up). Once you use this trait, you can't use it again until you finish a long rest. Charisma is your spellcasting ability for this trait."
					],
					"type": "entries"
				},
				{
					"name": "Herald of Doom",
					"entries": [
						"You know the {@spell toll the dead|xge} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Necrotic Shroud",
					"entries": [
						"Your eyes briefly become pools of darkness, and ghostly, flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you that can see you must succeed on a Charisma saving throw (DC 8 + your proficiency bonus + your Charisma modifier) or become frightened of you until the end of your next turn. Until the transformation ends, once on each of your turns, you can deal extra necrotic damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Saki",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1
				}
			],
			"traitTags": [
				"Improved Resting"
			],
			"languageProficiencies": [
				{
					"giant": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Saki live long lives. They enter adulthood in their late teens and usually live to be about two centuries."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Saki society, with its clear roles and tasks, has a strong lawful bent. The Saki's sense of fairness, balanced with a strict code of conduct, leans them more towards good."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Saki are between 7 and 9 feet tall and weigh between 300 and 400 pounds. Your size is Medium."
					]
				},
				{
					"type": "entries",
					"name": "Hearty Fortitude",
					"entries": [
						"You have proficiency in the {@skill Athletics} skill."
					]
				},
				{
					"type": "entries",
					"name": "Rock Hurler",
					"entries": [
						"You are considered proficient in the use of appropriately-sized rocks and boulders as ranged weapons. Such boulders typically weigh fifty pounds, and deal bludgeoning damage equal to {@dice 1d10} + your Strength modifier, and have the thrown (30/150) and heavy qualities. These boulders are also considered simple melee weapons."
					]
				},
				{
					"type": "entries",
					"name": "Mountain Born",
					"entries": [
						"You’re acclimated to high altitude, including elevations above 20,000 feet. You’re also naturally adapted to cold climates, and have resistance to cold damage."
					]
				},
				{
					"type": "entries",
					"name": "Door Opener",
					"entries": [
						"You learn the {@spell mold earth} cantrip, and are skilled at using it to modify doorways to allow for your larger build. You can repair the doorway afterward without expending an action."
					]
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Giant."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Scholar",
					"traitTags": [
						"Skill Proficiency",
						"Improved Resting"
					],
					"languageProficiencies": [
						{
							"other": true
						}
					],
					"ability": [
						{
							"int": 2
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Dusk Study",
							"entries": [
								"Scholars have hardened their minds to resist the calls of slumber. While taking a long rest, you can spend half of that time doing any studious activity, including reading and writing."
							]
						},
						{
							"type": "entries",
							"name": "Path of Knowledge",
							"entries": [
								"When attempting to recall information about a particular city, kingdom, or culture, you are considered proficient in History, and add double your proficiency to the check, instead of your normal proficiency bonus. Once you use this feature, you cannot use it again until you finish a short or long rest."
							]
						},
						{
							"name": "Extra Language",
							"entries": [
								"You can speak, read, and write one additional language."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Warrior",
					"traitTags": [
						"Weapon Proficiency"
					],
					"ability": [
						{
							"str": 2,
							"con": 1
						}
					],
					"entries": [
						{
							"name": "Savage Attacks",
							"entries": [
								"When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
							],
							"type": "entries"
						},
						{
							"name": "War Born",
							"entries": [
								"You gain proficiency in two martial weapons of your choice."
							],
							"type": "entries"
						},
						{
							"name": "Savage Dissonance",
							"entries": [
								"When you are reduced to 0 hit points, before you fall unconscious, you can use your reaction to make one melee attack against a creature within melee range. Once you use this trait, you can't use it again until you finish a short or long rest."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Cook",
					"speed": {
						"walk": 30
					},
					"traitTags": [
						"Tool Proficiency"
					],
					"ability": [
						{
							"con": 2,
							"cha": 1
						}
					],
					"entries": [
						{
							"name": "Cook at the Hill",
							"entries": [
								"You gain proficiency with cook’s utensils."
							],
							"type": "entries"
						},
						{
							"name": "Exotic Ingredients",
							"entries": [
								"Whenever you prepare a meal for your party, provided you have cook’s utensils and other supplies on hand, you can use a variety of strange ingredients."
							],
							"type": "entries"
						},
						{
							"name": "Keen Nose",
							"entries": [
								"You have advantage on {@skill Perception} checks that rely on smell."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Executioner",
					"speed": {
						"walk": 30
					},
					"traitTags": [
						"Weapon Proficiency",
						"Skill Proficiency"
					],
					"ability": [
						{
							"con": 2,
							"cha": 1
						}
					],
					"entries": [
						{
							"name": "As Hard as His Axe",
							"entries": [
								"As an Executioner, you've seen it all, and you don't care. You no longer feel non-magical fear."
							],
							"type": "entries"
						},
						{
							"name": "Exotic Weaponry",
							"entries": [
								"You are proficient in the use of nets."
							],
							"type": "entries"
						},
						{
							"name": "It's Me or You",
							"entries": [
								"You loathe to let a criminal escape your grasp. Whenever you would make an attack of opportunity, you can gain advantage on that attack. Once you use this trait, you can't use it again until you finish a short or long rest."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Prophet",
					"speed": {
						"walk": 30
					},
					"traitTags": [
						"Skill Proficiency"
					],
					"ability": [
						{
							"con": 1,
							"wis": 2
						}
					],
					"entries": [
						{
							"name": "Divine Prophet",
							"entries": [
								"You gain proficiency in {@skill Religion}."
							],
							"type": "entries"
						},
						{
							"name": "Blood of Alu'kuri",
							"entries": [
								"Your Rock Hurler now allows you to use boulders over one hundred pounds as ranged weapons. You deal bludgeoning damage equal to {@dice 1d12} + your Strength modifier. Boulders below a hundred pounds do not gain the benefit of this trait."
							],
							"type": "entries"
						},
						{
							"name": "Choba Choba",
							"entries": [
								"You can tap into your divine sense to see future events once per long rest. These visions can be sporadic, and typically have little context."
							],
							"type": "entries"
						},
						{
							"name": "Hands of Alu'kuri",
							"entries": [
								"You learn the {@spell mage hand} cantrip. When used, it appears as a long, mechanical red hand, symbolic of the blood-soaked weapon that Alu'kuri has become in the eyes of the lowlanders."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Aasimar  (Seeker)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"con": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"common": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Healing Hands",
					"entries": [
						"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Light Bearer",
					"entries": [
						"You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Shroud of Life and Death",
					"entries": [
						"Starting at 3rd level, you can use your bonus action to awaken the power in your blood, causing a nimbus of crimson energy to flow out from you.",
						"Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you shed dim light in a 10-foot radius, and at the end of each of your turns, one creature within 30 feet of you takes necrotic damage equal to your proficiency bonus. In addition, if you or an ally within 30 feet drops to 0 hit points without being killed outright, you can use your reaction to preserve them, causing them to drop to 1 hit point instead. When you use this reaction, it ends your transformation early.",
						"Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Skeleton",
			"source": "WMRaces",
			"size": [
				"V"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1,
					"choose": {
						"from": [
							"dex",
							"int"
						],
						"amount": 2
					}
				}
			],
			"traitTags": [
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"common": true,
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Skeletons do not age in the traditional sense, but they do decay over time. The necromantic energies that sustain you will heal most wounds you take at approximately the same rate as a mortal, and your hit die function as normal. A skeleton will generally live up to a maximum of two hundred years, at which their soul will be absorbed back into the Rift Plane to be reincarnated once more."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"An outcast in even minority socieites, the Skeleton is not without its fair share of natural enemies. In order to survive, they inclined to start a nation all of their own. Because to this, they tend to share a lawful bent. Apart from that, their inclination towards good or evil is not stagnant. The best and worst live among their numbers."
					],
					"type": "entries"
				},
				{
					"name": "Past Life",
					"entries": [
						"Choose another race besides this one; the race you select must be humanoid and lack the Living Construct trait (or similar). Even after becoming a Wraith (and later a Skeleton), you maintain vague memories of this past life as this race. Your size, height, and movement speed are the same as this race. You do not retain special movement speeds from this race (such as flying, climbing, or swimming), and you do not carry over any racial features. If your past race had subraces, select one, but you do not carry over any racial features from that either."
					],
					"type": "entries"
				},
				{
					"name": "Living Dead",
					"entries": [
						"As the offspring of the Rift Plane and a nonsentient Wraith, Skeletons are gifted with supernatural properties. Your creature type is Undead. You are immune to disease. You do not need to eat or breathe, but you can ingest food and drink if you wish."
					],
					"type": "entries"
				},
				{
					"name": "Onward to Salvation",
					"entries": [
						"With no pulse to drive you and no veins to pump blood, your body must be designed to operate at its maximum capacity almost always. As an undead, you rarely tire. You treat exhaustion as if it was one level less. In addition, instead of sleeping, you enter an inactive state for 4 hours each day. You do not dream in this state; you are fully aware of your surroundings and notice approaching enemies and other events as normal."
					],
					"type": "entries"
				},
				{
					"name": "Collapse",
					"entries": [
						"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. If you do, reduce yourself to a pile of bones and render yourself {@condition prone}. You are considered to be under similar effects to the {@spell feign death} spell. While subject to this condition, you are unable to move or take actions other than using an action to end this effect. Once you use this trait, you are unable to use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Bloodless",
					"entries": [
						"You are immune to poison damage and the {@condition Poisoned} condition."
					],
					"type": "entries"
				},
				{
					"name": "Them Bones",
					"entries": [
						"If both your hands are unoccupied, you can use a bonus action to rearrange your skeletal structure, or return your body to its original configuration. When you rearrange your bones, choose one of the following options, any of which are considered to occupy both of your hands:"
					],
					"type": "entries"
				},
				{
					"type": "inset",
					"name": "Options",
					"entries": [
						{
							"entries": [
								"• You remove an arm and use it as a bone club. While used as a weapon, you have proficiency with your removed arm, which is a melee weapon with the finesse property that deals {@dice 1d6} bludgeoning damage on it. This weapon also has the light property, but for all intents and purposes, that fact is of little use."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You remove a hand and hold it in your other as if it were a set of thieves' tools. This hand is capable of manipulating locks through picking, cutting glass, and any other function a normal set of thieves' tools could achieve."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You remove two of your ribs and use the rest of them as a musical instrument. This instrument is referred to as the Bone Xylophone, and while playing you gain advantage on Performance checks meant to entertain children."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You gain pull out several of your bones in an attempt to juggle them."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• You can remove your skull from its socket and use your arm to look around walls."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Them Bones"
					}
				},
				{
					"entries": [
						"Your bones lose their animation if they are further than 5-feet away from your main body. If your skull loses animation, you are blinded and deafened until a skull is reaffixed to your body."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and two other languages of your choice."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "The Beneath",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": 20
			},
			"ability": [
				{
					"con": 2,
					"str": 1
					}
			],
			"darkvision": 120,
			"traitTags": [
				"Superior Darkvision",
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"terran": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"The Beneath live up to two hundred years after the time they ascended, sustained by the unholy powers that mutated them, before the dark energies fizzle out and the creature perishes."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"The bloodlust that lives within all Beneath drives them toward evil, but the strong willed can maintain a neutral disposition. A rare, exceptional few can even become good."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"The Beneath are between 8 feet to 9 feet tall, although as a quadruped, their height can deminish to as low as 4 to 5 feet when running. Your size is Medium."
					]
				},
				{
					"name": "Sunlight Sensitivity",
					"entries": [
						"You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
					],
					"type": "entries"
				},
				{
					"name": "Superior Darkvision",
					"entries": [
						"Accustomed to the depths below, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Ankheg's Tremorsense",
					"entries": [
						"You have tremorsense up to 10 feet. As an action which lasts for one minute, you can extend your tremorsense to 40 feet. You can only use this feature twice per short rest."
					],
					"type": "entries"
				},
				{
					"name": "Arctic Regeneration",
					"entries": [
						"Whenever you complete a short rest, you can roll {@dice 1d6} for each hit die you expend. Add the result to the total health you gain."
					],
					"type": "entries"
				},
				{
					"name": "Umber Hulk's Burrowing",
					"entries": [
						"As a bonus action, you can expend up to your current movement speed to burrow underground, traveling to a destination within range. While you are burrowing, you are considered to be under the effects of full-cover. After using this feature, you decide whether you'll emerge on the current turn, or the turn after you start to burrow.",
						"Regardless of when you arrive at your destination, you cannot use this feature again until you complete a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Monstrous",
					"entries": [
						"Your creature type is monstrosity, rather than humanoid."
					],
					"type": "entries"
				},
				{
					"name": "Deadly Leap",
					"entries": [
						"Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start. If you jump at least 15 feet as part of your movement, you can use an attack action to slam on the ground in a space that contains one or more other creatures. Each of those creatures must succeed on a Strength or Dexterity saving throw equal to 8 + your proficiency bonus + your Strength modifier. On a failed save, those creatures are knocked {@condition prone} and take {@dice 1d6} bludgeoning damage. This damage increases to {@dice 2d6} at 5th level, {@dice 3d6} at 10th level, {@dice 4d6} at 15th level, and {@dice 5d6} at 20th level. Once you use this feature, you cannot use it again until you finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Terran."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Toran",
			"source": "WMRaces",
			"size": [
				"S"
			],
			"speed": {
				"walk": 25,
				"fly": 40
			},
			"ability": [
				{
					"dex": 1,
					"cha": 2
					}
			],
			"traitTags": [
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"primordial": true,
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Toran grow up very fast, and live very long lives. Torans reach adulthood at age 13. On average, they live about 300 years."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Toran are between 2 to 3 feet tall and average about 30 pounds. Your size is Small."
					]
				},
				{
					"name": "Picking Claws",
					"entries": [
						"Torans don't have hands, but their claws are dextrous enough to handle small complex tasks. Toran can pick up weapons but can't use them in combat."
					],
					"type": "entries"
				},
				{
					"name": "Attuned Flight",
					"entries": [
						"You have a flying speed of 40 feet. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item."
					],
					"type": "entries"
				},
				{
					"name": "Song and Dance",
					"entries": [
						"You have proficiency with your claws, which are a finesse weapon that deal {@dice 1d8} slashing damage."
					],
					"type": "entries"
				},
				{
					"name": "Dazzling Plummage",
					"entries": [
						"As a bonus action you can double your proficiency bonus on any Charisma skill check. After using this ability you cannot use it again until you finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Ancient Melody",
					"entries": [
						"You gain proficiency with your voice, which you can use to sing a variety of melodies that instill a magical effect by manifesting the nature of Arvandor.",
						"As an action, you sing a peaceful and enchanting haiku to a creature within 30 feet of you. That creature must make a Wisdom saving throw with a DC equal to your melody save DC (8 + your Charisma modifier + your proficiency bonus). On a failed save, that creature must use an action on their next turn to give you the final verse. After they do so, their turn immediately ends, and they cannot take reactions until the end of their next turn.",
						"Once you use this ability, you cannot do so again until you finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common, Toran, and Auran."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Vespidan (Drone)",
			"source": "WMRaces",
			"size": [
				"S"
			],
			"speed": {
				"walk": 30,
				"climb": 20,
				"fly": 30
			},
			"ability": [
				{
					"cha": 1,
					"choose": {
						"from": [
							"wis",
							"int"
						],
						"amount": 2
					}
				}
			],
			"traitTags": [
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"All Vespids reach maturity at 12, beyond this workers live about as long as 75 years, drones as long as 350 years, and workers that become queens can live as long as 750 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Vespidan societies are invariably highly structured and caste-based. They are almost always strongly lawful and usually lawful neutral as the good of the hive supersedes all other concerns. The exception are the hive- broken who are still often lawful by upbringing, but can easily stray into any form of thinking from there."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Workers and Drones are small sized, while Queens are medium sized."
					]
				},
				{
					"name": "Multiarmed",
					"entries": [
						"All Vespids are born with 4 arms. Your two additional arms allow you to interact with an additional object or feature of the environment for free on your turn. You may not carry and use shields for defense with these additional arms. Nor do they grant you additional attacks, or allow you to wield weapons with them for combat."
					],
					"type": "entries"
				},
				{
					"name": "Flight",
					"entries": [
						"As part of a move action, a Vespidan can instead fly 30 feet, but must end their movement on the ground or a solid surface. A Vespidan who ends its turn in the air immediately plummets to the ground. To use this speed you can't be wearing heavy armor or be encumbered."
					],
					"type": "entries"
				},
				{
					"name": "Carapace",
					"entries": [
						"Your Carapace provides limited protection, and makes you accustomed to wearing armor. You can calculate your base AC as 11 + your Dexterity modifier while not wearing armor, and a shield’s benefits apply as normal while you use this AC. While wearing medium armor, your maximum Dexterity modifier bonus is increased by 1."
					],
					"type": "entries"
				},
				{
					"name": "Magic Savant",
					"entries": [
						"After finishing a short or long rest you may choose one of the following spells: {@spell animal friendship}, {@spell misty step}, or {@spell shield}. You may cast this chosen spell once without expending a spell slot. You regain the ability to choose and cast a spell in this manner after finishing a short or long rest. Charisma is your spellcasting ability for these spells."
					],
					"type": "entries"
				},
				{
					"name": "Sting",
					"entries": [
						"Your sting is a natural weapon, which you can use to make a unarmed strike with. If you hit with it, you deal piercing damage equal to {@dice 1d4} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. On a hit, you may choose to inject the target with your venom, after which you must spend a long rest before you can use your venom again.",
						"This venom causes the target to take {@dice 2d6} poison damage, and it must make a Constitution saving throw (DC: 10 + your Proficiency bonus + your Strength modifier). On a failed save, it is also {@condition Poisoned} until the start of your next turn. The poison damage increases to {@dice 3d6}} at 5th level. {@dice 4d6}} at 10th level, {@dice 5d6}} at 15th level, and {@dice 6d6}} at 20th level."
					],
					"type": "entries"
				},
				{
					"name": "Harmonic Casting",
					"entries": [
						"When you cast a non-cantrip spell you may channel some of the magic into yourself or a creature you can see within 60 feet. The chosen creature gains temporary hit points equal to the spell's level plus your proficiency bonus. Creatures may only be affected by this trait once, after which they may be affected again after they finish a short or long rest."
					],
					"type": "entries"
				},
				{
					"name": "Gregarious",
					"entries": [
						"You have proficiency in the Persuasion skill. Giant Wasps that are {@condition Charmed} by you will actively protect and fight for you."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Vespidan (Queen)",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": 20,
				"fly": 30
			},
			"ability": [
				{
					"con": 1,
					"cha": 1,
					"choose": {
						"from": [
							"wis",
							"cha"
						],
						"amount": 1
					}
				}
			],
			"traitTags": [
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"All Vespids reach maturity at 12, beyond this workers live about as long as 75 years, drones as long as 350 years, and workers that become queens can live as long as 750 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Vespidan societies are invariably highly structured and caste-based. They are almost always strongly lawful and usually lawful neutral as the good of the hive supersedes all other concerns. The exception are the hive- broken who are still often lawful by upbringing, but can easily stray into any form of thinking from there."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Workers and Drones are small sized, while Queens are medium sized."
					]
				},
				{
					"name": "Multiarmed",
					"entries": [
						"All Vespids are born with 4 arms. Your two additional arms allow you to interact with an additional object or feature of the environment for free on your turn. You may not carry and use shields for defense with these additional arms. Nor do they grant you additional attacks, or allow you to wield weapons with them for combat."
					],
					"type": "entries"
				},
				{
					"name": "Flight",
					"entries": [
						"As part of a move action, a Vespidan can instead fly 30 feet, but must end their movement on the ground or a solid surface. A Vespidan who ends its turn in the air immediately plummets to the ground. To use this speed you can't be wearing heavy armor or be encumbered."
					],
					"type": "entries"
				},
				{
					"name": "Carapace",
					"entries": [
						"Your Carapace provides limited protection, and makes you accustomed to wearing armor. You can calculate your base AC as 11 + your Dexterity modifier while not wearing armor, and a shield’s benefits apply as normal while you use this AC. While wearing medium armor, your maximum Dexterity modifier bonus is increased by 1."
					],
					"type": "entries"
				},
				{
					"name": "Inspiring Queen",
					"entries": [
						"You may use the Help action as a bonus action, for a number of times equal to your Proficiency bonus. You regain the ability to use the Help action this way after finishing a short or long rest. At level 3, when you use the Help action to aid an ally in attacking a creature, the target of that attack can be within 30 feet of you, rather than within 5 feet of you. Should the ally already have advantage, then it may add half your proficiency bonus (rounded up) to the attack's hit and damage roll instead."
					],
					"type": "entries"
				},
				{
					"name": "Sting",
					"entries": [
						"Your sting is a natural weapon, which you can use to make a unarmed strike with. If you hit with it, you deal piercing damage equal to {@dice 1d4} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. On a hit, you may choose to inject the target with your venom, after which you must spend a long rest before you can use your venom again.",
						"This venom causes the target to take {@dice 2d6} poison damage, and it must make a Constitution saving throw (DC: 10 + your Proficiency bonus + your Strength modifier). On a failed save, it is also {@condition Poisoned} until the start of your next turn. The poison damage increases to {@dice 3d6}} at 5th level. {@dice 4d6}} at 10th level, {@dice 5d6}} at 15th level, and {@dice 6d6}} at 20th level."
					],
					"type": "entries"
				},
				{
					"name": "Insightful Monarch",
					"entries": [
						"You have proficiency in the Insight skill, and advantage on saving throws to avoid being charmed."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Vespidan (Worker)",
			"source": "WMRaces",
			"size": [
				"S"
			],
			"speed": {
				"walk": 30,
				"climb": 20,
				"fly": 30
			},
			"ability": [
				{
					"con": 1,
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"amount": 2
					}
				}
			],
			"traitTags": [
				"Tool Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"All Vespids reach maturity at 12, beyond this workers live about as long as 75 years, drones as long as 350 years, and workers that become queens can live as long as 750 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Vespidan societies are invariably highly structured and caste-based. They are almost always strongly lawful and usually lawful neutral as the good of the hive supersedes all other concerns. The exception are the hive- broken who are still often lawful by upbringing, but can easily stray into any form of thinking from there."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Workers and Drones are small sized, while Queens are medium sized."
					]
				},
				{
					"name": "Multiarmed",
					"entries": [
						"All Vespids are born with 4 arms. Your two additional arms allow you to interact with an additional object or feature of the environment for free on your turn. You may not carry and use shields for defense with these additional arms. Nor do they grant you additional attacks, or allow you to wield weapons with them for combat."
					],
					"type": "entries"
				},
				{
					"name": "Flight",
					"entries": [
						"As part of a move action, a Vespidan can instead fly 30 feet, but must end their movement on the ground or a solid surface. A Vespidan who ends its turn in the air immediately plummets to the ground. To use this speed you can't be wearing heavy armor or be encumbered."
					],
					"type": "entries"
				},
				{
					"name": "Carapace",
					"entries": [
						"Your Carapace provides limited protection, and makes you accustomed to wearing armor. You can calculate your base AC as 11 + your Dexterity modifier while not wearing armor, and a shield’s benefits apply as normal while you use this AC. While wearing medium armor, your maximum Dexterity modifier bonus is increased by 1."
					],
					"type": "entries"
				},
				{
					"name": "Swarm Tactics",
					"entries": [
						"You have advantage on an attack roll against a creature if at least one of your allies is within 5 feet of the creature and the ally isn’t incapacitated. You may only benefit from this trait once per turn."
					],
					"type": "entries"
				},
				{
					"name": "Sting",
					"entries": [
						"Your sting is a natural weapon, which you can use to make a unarmed strike with. If you hit with it, you deal piercing damage equal to {@dice 1d4} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. On a hit, you may choose to inject the target with your venom, after which you must spend a long rest before you can use your venom again.",
						"This venom causes the target to take {@dice 2d6} poison damage, and it must make a Constitution saving throw (DC: 10 + your Proficiency bonus + your Strength modifier). On a failed save, it is also {@condition Poisoned} until the start of your next turn. The poison damage increases to {@dice 3d6}} at 5th level. {@dice 4d6}} at 10th level, {@dice 5d6}} at 15th level, and {@dice 6d6}} at 20th level."
					],
					"type": "entries"
				},
				{
					"name": "Talented Builder",
					"entries": [
						"You have proficiency in one Tool of your choice. In addition, you learn new Tool proficiencies in half the normal amount of downtime weeks, rounded down. This reduction is applied last, after any reduction you may receive from your Intelligence modifier."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish."
					],
					"type": "entries"
				}
			]
		},
		{
	"name": "Warforged",
	"source": "WMRaces",
	"size": [
		"M"
	],
	"speed": 30,
	"ability": [
		{
			"con": 2,
			"choose": {
				"from": [
					"str",
					"dex",
					"int",
					"wis",
					"cha"
				],
				"count": 1
			}
		}
	],
	"heightAndWeight": {
		"baseHeight": 70,
		"heightMod": "2d6",
		"baseWeight": 270,
		"weightMod": "4"
	},
	"age": {
		"mature": 2,
		"max": 30
	},
	"traitTags": [
		"Improved Resting",
		"Natural Armor"
	],
	"skillProficiencies": [
		{
			"any": 1
		}
	],
	"languageProficiencies": [
		{
			"common": true,
			"anyStandard": 1
		}
	],
	"toolProficiencies": [
		{
			"any": 1
		}
	],
	"resist": [
		"poison"
	],
	"conditionImmune": [
		"disease"
	],
	"entries": [
		{
			"name": "Age",
			"entries": [
				"A typical warforged is between two and thirty years old. The maximum warforged lifespan remains a mystery; so far, warforged have shown no signs of deterioration due to age. You are immune to magical aging effects."
			],
			"type": "entries"
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Most warforged take comfort in order and discipline, tending toward law and neutrality. But some have absorbed the morality, or lack thereof, of the beings with which they served."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Constructed Resilience",
			"entries": [
				"You were created to have remarkable fortitude, represented by the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on saving throws against being {@condition poisoned}, and you have resistance to poison damage.",
						"You don't need to eat, drink, or breathe.",
						"You are immune to disease.",
						"You don't need to sleep, and magic can't put you to sleep."
					]
				}
			]
		},
		{
			"type": "entries",
			"name": "Sentry's Rest",
			"entries": [
				"When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you {@condition unconscious}, and you can see and hear as normal."
			]
		},
		{
			"type": "entries",
			"name": "Integrated Protection",
			"entries": [
				"Your body has built-in defensive layers, which can be enhanced with armor:",
				{
					"type": "list",
					"items": [
						"You become proficient with light and medium armor.",
						"You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.",
						"While you live, the armor incorporated into your body can't be removed against your will."
					]
				}
			]
		},
		{
			"type": "entries",
			"name": "Specialized Design",
			"entries": [
				"You gain one skill proficiency and one tool proficiency of your choice."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You can speak, read, and write Common and one other language of your choice."
					]
				}
			]
		},
		{
			"name": "Revenant",
			"source": "WMRaces",
			"size": "V",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1,
					"choose": {
						"from": [
							"str",
							"cha"
						],
						"count": 1,
						"amount": 2
					}
				}
			],
			"traitTags": [
				"Uncommon Race",
				"Monstrous Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Revenant do not age. Given time, the necromantic energies that sustain you will heal most wounds you take at approximately the same rate as a mortal, and your hit die function as normal. A Revenant escapes the Rift due to one emotion they hold dear to their hearts. Emotions such as &quot;Hope&quot;, &quot;Anger&quot;, and &quot;Desire&quot; are common emotions among Revenants. Once the emotion that ties their existence dissipates (like the desire to see one's family, or the anger to see an enemy dead), the necromantic energies evaporate, and the Revenant dies."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Many Revenants cling to the alignment they held in their life, even if that life is but a distant memory in their minds. For others, the act of being swallowed by the Rift changes them drastically, and they adopt a new world view in light of what Shao has taught them."
					],
					"type": "entries"
				},
				{
					"name": "Past Life",
					"entries": [
						"Choose another race besides this one; the race you select must be humanoid and lack the Living Construct trait (or similar). Even after being swallowed by the Rift, you maintain vague memories of this past life as this race. Your size, height, and movement speed are the same as this race. You do not retain special movement speeds from this race (such as flying, climbing, or swimming), and you do not carry over any racial features. If your past race had subraces, select one, but you do not carry over any racial features from that either."
					],
					"type": "entries"
				},
				{
					"name": "Living Dead",
					"entries": [
						"You have been brought back from the Rift, but your form has changed drastically. You are immune to disease. You do not need to eat or breathe, but you can ingest food and drink if you wish. Additionally, you have two creature types: humanoid and undead. You can be affected by a spell or ability that works on either of your creature types."
					],
					"type": "entries"
				},
				{
					"name": "Onward to Salvation",
					"entries": [
						"Escaping the Rift was no easy feat, and your new undead body assisted you in this endeavor. As an undead, you rarely tire. You treat exhaustion as if it was one level less. In addition, instead of sleeping, you enter an inactive state for 4 hours each day. You do not dream in this state; you are fully aware of your surroundings and notice approaching enemies and other events as normal."
					],
					"type": "entries"
				},
				{
					"name": "Unholy Gospel",
					"entries": [
						"After breaking out of the Rift, you received a blessing known colloquially as a gospel. Unlike other undead, you can be restored through healing magic, but it has a significantly dampened effect on you. When you regain hit points from a source that specifies it does not function on undead, you instead receive half as many hit points as the source would provide, rounded down, instead of none."
					],
					"type": "entries"
				},
				{
					"name": "Eternal Vengeance",
					"entries": [
						"The presence of those who defy the life cycle registers on the senses like a noxious odor. As an action, you can open your awareness to detect such creatures. Until the end of your next turn, you know the location of any undead creatures within 60 feet of you that are not behind total cover. You can use this feature a number of times equal to 1 + your Constitution modifier. When you finish a long rest, you regain all expended uses."
					],
					"type": "entries"
				},
				{
					"name": "Driven",
					"entries": [
						"You have advantage on saving throws that would turn undead or would cause you to be {@condition Frightened}."
					],
					"type": "entries"
				},
				{
					"name": "Resurrection Beyond Death",
					"entries": [
						"When you drop to 0 hit points, you can choose to stay conscious instead of falling unconscious. If you do, gain temporary hit points equal to your total character level + your Constitution modifier (minimum 1), which lasts for up to 1 minute.",
						"In this state, you can take an action or a bonus action on your turn, but not both, and can move up to only half your movement speed. You remain in this state until you regain hit points, or until you no longer have temporary hit points. If you lose all temporary hit points in this state while you are at 0 hit points, you fall unconscious and begin making death saving throws as normal. Once you use this trait, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and two other languages of your choice."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Marked Human (Mark of Making)",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"int": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"wis",
							"cha"
						],
						"count": 1
					}
				}
			],
			"traitTags": [
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"skillProficiencies": [
				{
					"tool": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Humans reach adulthood in their late teens and live less than a century."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"After receiving a Mark of Making, humans tend to manifest a lawful nature, even under less than ideal nuturing conditions."
					],
					"type": "entries"
				},
				{
					"name": "Artisan's Intuition",
					"entries": [
						"When you make an {@skill Arcana} check or an ability check involving artisan's tools, you can roll a {@dice 1d4} and add the number rolled to the ability check."
					],
					"type": "entries"
				},
				{
					"name": "Forge's Gift",
					"entries": [
						"You gain proficiency with one type of artisan's tools of your choice."
					],
					"type": "entries"
				},
				{
					"name": "Spellsmith",
					"entries": [
						"You know the {@spell mending} cantrip. You can also cast the magic weapon spell with this trait. When you do so, the spell lasts for 1 hour and doesn't require concentration. Once you cast the spell with this trait, you can't do so again until you finish a long rest. Intelligence is your spellcasting ability for these spells."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Marked Human (Mark of the Sentinel)",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"int",
							"wis",
							"cha"
						],
						"count": 1
					}
				}
			],
			"traitTags": [
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Humans reach adulthood in their late teens and live less than a century."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"After receiving a Mark of the Sentinel, humans tend to manifest a good nature, even under less than ideal nuturing conditions."
					],
					"type": "entries"
				},
				{
					"name": "Sentinel's Intuition",
					"entries": [
						"When you make an {@skill Insight} or {@skill Perception} check, you can roll a {@dice 1d4} and add the number rolled to the ability check."
					],
					"type": "entries"
				},
				{
					"name": "Guardian's Shield",
					"entries": [
						"You can cast the {@spell shield} spell once with this trait, and you regain the ability to cast it after you finish a long rest. Wisdom is your spellcasting ability for this spell."
					],
					"type": "entries"
				},
				{
					"name": "Vigilant",
					"entries": [
						"When a creature you can see within 5 feet of you is hit by an attack roll, you can use your reaction to swap places with that creature, and you are hit by the attack instead. Once you use this trait, you can't do so again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Bound by the Duel",
					"entries": [
						"You can cast the {@spell compelled duel} spell with this trait. Once you cast the spell with this trait, you can't do so again until you finish a long rest. Wisdom is your spellcasting ability for this spell."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Marked Human (Mark of Finding)",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1,
					"wis": 2
				}
			],
			"traitTags": [
				"Spellcasting",
				"Darkvision"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Humans reach adulthood in their late teens and live less than a century."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"After receiving a Mark of Finding, humans tend bend towards being chaotic. They also tend to manifest a good nature, even under less than ideal nuturing conditions."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Hunter's Intuition",
					"entries": [
						"When you make a {@skill Perception} or {@skill Survival} check, you can roll a {@dice 1d4} and add the number rolled to the ability check."
					],
					"type": "entries"
				},
				{
					"name": "Finder's Magic",
					"entries": [
						"You can cast the {@spell hunter's mark} spell with this trait. Starting at 3rd level, you can also cast the {@spell locate object} spell with it. Once you cast either spell with this trait, you can't cast that spell with it again until you finish a long rest. Wisdom is your spellcasting ability for these spells."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Marked Human (Mark of Handling)",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"wis": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"cha"
						],
						"count": 1
					}
				}
			],
			"traitTags": [
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Humans reach adulthood in their late teens and live less than a century."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"After receiving a Mark of Handling, humans tend bend towards a feeling of neutrality. They also tend to have a greater respect for wildlife."
					],
					"type": "entries"
				},
				{
					"name": "Wild Intuition",
					"entries": [
						"When you make a {@skill Animal Handling} or {@skill Nature} check, you can roll a {@dice 1d4} and add the number rolled to the ability check."
					],
					"type": "entries"
				},
				{
					"name": "Primal Connection",
					"entries": [
						"You can cast the {@spell animal friendship} and {@spell speak with animals} spells with this trait, requiring no material component. Once you cast either spell with this trait, you can't cast that spell with it again until you finish a short or long rest. Wisdom is your spellcasting ability for these spells."
					],
					"type": "entries"
				},
				{
					"name": "The Bigger They Are",
					"entries": [
						"Starting at 3rd level, you can target a beast or monstrosity when you cast {@spell animal friendship} or {@spell speak with animals}, provided the creature's Intelligence score is 3 or lower."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Marked Human (Mark of Passage)",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 35
			},
			"ability": [
				{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
					}
				}
			],
			"traitTags": [
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Humans reach adulthood in their late teens and live less than a century."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"After receiving a Mark of Passage, humans tend towards a feeling of neutrality. They also tend to be more punctual and pertinent when receiving orders."
					],
					"type": "entries"
				},
				{
					"name": "Gait of Time",
					"entries": [
						"Your base walking speed increases to 35 feet."
					],
					"type": "entries"
				},
				{
					"name": "Intuitive Motion",
					"entries": [
						"When you make an {@skill Acrobatics} check or any ability check to operate or maintain a land vehicle, you can roll a {@dice 1d4} and add the number rolled to the ability check."
					],
					"type": "entries"
				},
				{
					"name": "Magical Passage",
					"entries": [
						"You can cast the {@spell misty step} spell once with this trait, and you regain the ability to cast it when you finish a long rest. Dexterity is your spellcasting ability for this spell."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Human (Base)",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"str": 1,
					"dex": 1,
					"con": 1,
					"int": 1,
					"wis": 1,
					"cha": 1
				}
			],
			"traitTags": [],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Humans reach adulthood in their late teens and live less than a century."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Humans tend toward no particular alignment. The best and the worst are found among them."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
					],
					"type": "entries"
				},
				{
					"name": "Speed Step",
					"entries": [
						"In combat, you can use a bonus action to immediately gain the benefits of the Dash action. You can only use this trait once per long rest."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Nasod",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1
				}
			],
			"traitTags": [
				"Improved Resting"
			],
			"languageProficiencies": [
				{
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"With the proper replacement parts and activities to occupy yourself, you can conceivably exist indefinitely. Nasods are known to degrade and lose their sanity, however, if they live too long without an explicit purpose. It is not known if this insanity visits all Nasods at old age, or just those whose resolve wavers."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Nasods possess mechanical minds, which find logic comforting. Generally, Nasods are lawful."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"As constructs modified by self-aware machines, Nasods could conceivably be perfectly uniform, like the Warforged that preceded them. However, the Foundries are either inherently flawed, or otherwise have a fondness for making diverse units, for each created Nasod is in some way unique. Nasod units stand between 5 and 7 feet tall and average about 150 to 300 pounds. Your size is Medium."
					]
				},
				{
					"type": "entries",
					"name": "Created by Code",
					"entries": [
						"Even though you were constructed, you are a living creature, represented by the following benefits:",
						{
							"type": "list",
							"items": [
								"You have advantage on saving throws against being {@condition poisoned}, and you have resistance to poison damage.",
								"You are immune to disease.",
								"You don't need to eat, drink, or breathe.",
								"Instead of sleeping, you enter an inactive state for 4 hours each day. You do not dream in this state; you are fully aware of your surroundings and notice approaching enemies and other events as normal.",
								"You can still be placed into a torpor by sleep-inducing magic."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Thermal Vision",
					"entries": [
						"Equipped with a heat-detecting thermal vision system beneath your eyelids, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades representative of thermal vision."
					]
				},
				{
					"type": "entries",
					"name": "Mind Over Matter",
					"entries": [
						"Your mechanical mind is inherently logical, and is not easily swayed. You have advantage on saving throws against being {@condition charmed}."
					]
				}
			],
			"subraces": [
				{
					"name": "Production",
					"traitTags": [
						"Spellcasting",
						"Skill Proficiency",
						"Tool Proficiency"
					],
					"languageProficiencies": [
						{
							"other": true
						}
					],
					"ability": [
						{
							"choose": {
								"from": [
									"int",
									"dex"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Made to Assemble",
							"entries": [
								"You gain two skill proficiencies of your choice and one {@book tool|phb|5|tools} proficiency of your choice."
							]
						},
						{
							"type": "entries",
							"name": "On the Line",
							"entries": [
								"You know the {@spell mending} cantrip, and your casting time for this spell is an action. Intelligence is your spellcasting ability for it. You can cast {@spell mending} as an action a number of times equal to your Intelligence modifier, and regain all expended uses on a short or long rest. While you have no remaining uses, the casting time of {@spell mending} becomes a minute."
							]
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and Neural."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Soldier",
					"traitTags": [
						"Spellcasting"
					],
					"ability": [
						{
							"choose": {
								"from": [
									"str",
									"dex"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"name": "It's Just Anti-Freeze",
							"entries": [
								"You do not suffer any ill effects from extreme cold or heat."
							],
							"type": "entries"
						},
						{
							"name": "Autonomous Blaster Device",
							"entries": [
								"You can cast the {@spell magic missile} spell with a 2nd-level spell slot once with this trait, and regain the ability to do so when you finish a short or long rest. Intelligence is your spellcasting ability for this spell."
							],
							"type": "entries"
						},
						{
							"name": "Born in the Future",
							"entries": [
								"You gain one exotic weapon or firearm proficiency."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and Neural."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Magi",
					"traitTags": [
						"Spellcasting"
					],
					"ability": [
						{
							"choose": {
								"from": [
									"int",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"name": "Modern Magic",
							"entries": [
								"You know the {@spell on/off} cantrip. When you reach 3rd level, you can cast the {@spell expeditious retreat} spell once per day. At 5th level, you can cast the {@spell levitate} spell once per day. Intelligence or Wisdom (your choice) is your spellcasting ability for these spells."
							],
							"type": "entries"
						},
						{
							"name": "Lightning Magnet",
							"entries": [
								"As an action at the beginning of your turn, you can assume the form of lightning by breaking your physical form apart into all its components. Until the beginning of your next turn, you can take no actions, bonus actions, or reactions. In addition, you have resistance to bludgeoning, piercing, slashing, lightning, and thunder damage. You also ignore difficult terrain. After using this ability, you can use it again after you take a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and Neural."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Undercity Operative",
					"speed": {
						"walk": 30,
						"swim": 30
					},
					"traitTags": [
						"Skill Proficiency"
					],
					"ability": [
						{
							"con": 2,
							"wis": 1
						}
					],
					"entries": [
						{
							"name": "From the Oceans",
							"entries": [
								"You gain a swimming speed of 30 feet, and gain one skill or weapon proficiency of your choice."
							],
							"type": "entries"
						},
						{
							"name": "Neural Synapses",
							"entries": [
								"Using gestures and sounds, you can communicate simple ideas with Small or smaller beasts that have an inborn swimming speed."
							],
							"type": "entries"
						},
						{
							"name": "Rough Plating",
							"entries": [
								"Your plating digs into the skin of those who attempt to grab you, forcing them to exchange the position of their hands constantly to avoid stabbing themselves. You have advantage on all checks to resist or escape a grapple."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Neural, and Aquan."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Aftuan",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1,
					"cha": 2
				}
			],
			"traitTags": [
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"deep": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Aftuan are theoretically immortal, but subsist off their legends in ancient folktales and stories. In order to continue their furrowed existence, they must continue to spread their creeping fear. A fear that can only be described as the fear of the unknown."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Aftuan are connected directly to Chaos, but this does not mean they're chaotic. Instead, their ability to view things from all aspects as Chaos guides them allows the Aftuan to take a uniquely true neutral approach to the world."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Aftuan are between 5 feet to 8 feet tall. Your size is Medium."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"Your eyes give you superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, you only see in shades of blue."
					],
					"type": "entries"
				},
				{
					"type": "entries",
					"name": "Alien Mind",
					"entries": [
						"Unnatural. Unconventional. As an aftuan, your existence is beyond this world's boundaries. Your creature type is aberrant, rather than humanoid. In addition, you gain access to the following benefits as per your aberrant nature:",
						{
							"type": "list",
							"items": [
								"You have resistance to psychic damage.",
								"You have advantage on saving throws against the {@condition frightened} and {@condition charmed} conditions.",
								"You cannot suffer from the effects of madness.",
								"You don't need to eat, drink, or breathe.",
								"You don't need to sleep and don't suffer the effects of {@condition exhaustion} due to lack of rest, and magic can't put you to sleep."
							]
						}
					]
				},
				{
					"name": "Whispers in the Beyond",
					"entries": [
						"You learn the {@spell vicious mockery} cantrip. When you reach 3rd level, you can cast the {@spell dissonant whispers} spell once per day. At 5th level, you can also cast the {@spell crown of madness} spell once per day. Charisma is your spellcasting modifier for these spells."
					],
					"type": "entries"
				},
				{
					"name": "Limited Telepathy",
					"entries": [
						"You can speak telepathically to other creatures within 60 feet. However, you can only speak Deep Speech this way, and creatures who don't speak Deep Speech can only make out distant, haunting whispers. The exception are creatures under the effects of Long-Term or Indefinite Madness, who can make out your words clearly, regardless of their known languages."
					],
					"type": "entries"
				},
				{
					"name": "Otherworldly Appendages",
					"entries": [
						"Aftuan are birthed with four illithid tentactles that can manifest from any part of their body. Your additional appendages allow you to interact with an additional object or feature of the environment for free on your turn. You may not carry and use shields for defense with these additional appendages. Nor do they grant you additional attacks, or allow you to wield weapons with them for combat."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common and Deep Speech. In addition, you learn how to read Qualith."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Ghost",
			"source": "WMRaces",
			"size": "V",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Improved Resting",
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Ghosts do not age. Given time, the necromantic energies that sustain you will heal most wounds you take at approximately the same rate as a mortal, and your hit die function as normal."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Many Ghosts cling to the alignment they held in their life, even if that life is but a distant memory in their minds. For others, the act of being reborn as a ghastly entity on the mortal coil changes them significantly, and they adopt a new worldview in light of what their transformation has taught them."
					]
				},
				{
					"type": "entries",
					"name": "Past Life",
					"entries": [
						"Choose another race besides this one; the race you select must be humanoid and lack the Living Construct trait (or similar). Even after being transformed in the Ethereal Plane, you maintain vague memories of this past life as this race. Your size, height, and movement speed are the same as this race. You do not retain special movement speeds from this race (such as flying, climbing, or swimming), and you do not carry over any racial features. If your past race had subraces, select one, but you do not carry over any racial features from that either."
					]
				},
				{
					"type": "entries",
					"name": "Living Dead",
					"entries": [
						"You have been brought back to the mortal coil, but your form has changed drastically. You are immune to disease. You do not need to eat or breathe, but you can ingest food and drink if you wish. Additionally, you have two creature types: humanoid and undead. You can be affected by a spell or ability that works on either of your creature types."
					]
				},
				{
					"type": "entries",
					"name": "Holy Gospel",
					"entries": [
						"After reviving in the Material Plane, you received a blessing through a deitic force. This force is not any specific deity or person, but rather a force of nature similar to a tornado or hurricane. Unlike other undead, you can be restored through healing magic, but it has a significantly dampened effect on you. When you regain hit points from a source that specifies it does not function on undead, you instead receive half as many hit points as the source would provide, rounded down, instead of none."
					]
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and two other languages of your choice."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Spirit",
					"speed": {
						"walk": 30,
						"fly": 20
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"wis": 1,
							"cha": 1,
							"choose": {
								"from": [
									"wis",
									"cha"
								],
								"count": 1
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Otherworldly Flight",
							"entries": [
								"You gain a flying speed of 20 feet and can hover. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item.",
								"If you do not attune to the Way of Worlds, you can still fly using this feature. However, your maximum height is 5 feet. While flying this way, you can still hover."
							]
						},
						{
							"type": "entries",
							"name": "Deitic Force",
							"entries": [
								"Your unarmed strikes deal radiant or necrotic damage (your choice) instead of bludgeoning damage."
							]
						},
						{
							"type": "entries",
							"name": "Incorporeal Stride",
							"entries": [
								"You can move through other creatures and objects other than physical barriers (such as walls, floors, or ceilings) as if they were difficult terrain. On your turn, you can pass through up to 10 feet of physical barriers (treating them as difficult terrain) as a part of your movement. If you end your turn inside an object or barrier, you take {@dice 1d10}} force damage and are immediately ejected to the closest available space. After passing through a physical barrier, you must complete a short or long rest before you are able to do so again."
							]
						},
						{
							"type": "entries",
							"name": "Intangible",
							"entries": [
								"You have advantage on all checks to resist or escape a grapple."
							]
						},
						{
							"type": "entries",
							"name": "Invoke Smite",
							"entries": [
								"You can instill power into the weapon of a nearby creature to strike with divine energy. As an action, a creature within 30 feet of you.",
								"Until the end of your next turn, the next time that creature succeeds on a melee weapon attack, it deals an additional {@dice 1d8} radiant damage or {@dice 1d8} necrotic damage (your choice). Once you use this trait, you can't use it again until you finish a long rest."
							]
						},
						{
							"type": "entries",
							"name": "Spirit Binding",
							"entries": [
								"As a Spirit, your ghastly form is not completely realized, and require an anchor to maintain your existence in the Material Plane. You must select an object or creature of your choice (it could be a heirloom, weapon, or ally) to bind to indefinitely."
							]
						},
						{
							"type": "inset",
							"name": "Spirit Binding Rules",
							"entries": [
								{
									"entries": [
										"• You must remain within 150 feet of your bound target at all times, and if the object leaves your 150 foot radius, you are dragged along with it."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• You are always aware of where your bound target is in relation to you."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• Should the object be destroyed or the creature slain, you immediately drop to 0 hit points."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• If you regain consciousness without a spirit bond, you must immediately select a new object or creature within 150 feet to bind to. If no items or creatures are present within 150 feet, you are paralyzed until one comes within 150 feet of you."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Spirit Binding Rules"
							}
						}
					]
				}
			]
		},
		{
			"name": "Sacara",
			"source": "WMRaces",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Spellcasting",
				"Monstrous Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Sacara mature at the same rate as humans and live for up to 200 years. Female Sacara shed their young tails at age 15 in order to grow into their adult tails, and all Sacara from 20 and onwards shed every 5 years, maintaining their ageless youth."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Sacara have a tendency to the neutral and evil spectrum of the alignment tree, as their society is largely built around the principle of individual strength, so concepts like good seminarianism are less prominent. Their scheming nature incline many Sacara toward a lawful alignment."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Sacara maintain the same size and build as humans, although female Sacara manifest a serpentine body from the navel down. Their snake-like tails can extend anywhere from 5 to 9 feet long. Your size is Medium."
					],
					"type": "entries"
				},
				{
					"name": "Viper's Resilience",
					"entries": [
						"You have resistance to poison damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"Due to your bestial nature, you have superior vision in dark and dim lit places. You can see in dim light within 60 feet of you as if it were bright light, and in the darkness as if it were dim light. You can't discern color in the darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Paralyzing Gaze",
					"entries": [
						"Once you reach 5th level, you learn the spell {@spell hold person}. You can cast this spell once per long rest, as your paralyzing schlera are scratched and need time to regenerate. Intelligence is your spellcasting modifier for this spell."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Amazon",
					"ability": [
						{
							"int": 1,
							"choose": {
								"from": [
									"str",
									"dex"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"speed": {
						"walk": 35
					},
					"entries": [
						{
							"name": "Serpent's Sting",
							"entries": [
								"You gain the benefits of Serpent's Sting in one of three situations:"
							],
							"type": "entries"
						},
						{
							"type": "inset",
							"entries": [
								{
									"entries": [
										"• At the start of your turn, if another creature is currently {@condition Grappled} by you."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• At the start of your turn, if another creature is currently grappling you."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• During your turn, when you successfully grapple another creature."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Serpent's Sting II"
							}
						},
						{
							"entries": [
								"If you meet either of these conditions, you may use your serpentine hair to deliver a bite attack. This is a free action, and you may only target the creature you are grappling or being grappled by. You may only use Serpent's Sting once per turn, regardless of how many creatures you are grappling or are grappled by.",
								"You are considered proficient in this bite attack, which deals piercing damage equal to {@dice 1d6} + your Strength or Dexterity modifier. This damage increases to {@dice 2d6}} at 5th level. {@dice 3d6}} at 10th level, {@dice 4d6}} at 15th level, and {@dice 5d6}} at 20th level."
							],
							"type": "entries"
						},
						{
							"name": "Acidic Lungs",
							"entries": [
								"You know the {@spell acid splash} cantrip. Your spellcasting modifier for this spell is Intelligence."
							],
							"type": "entries"
						},
						{
							"name": "Slithering Path",
							"entries": [
								"Your base walking speed increases to 35 feet."
							],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You can speak, read, and write Common, Abyssal, and Draconic."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Sculptor",
					"ability": [
						{
							"dex": 1,
							"choose": {
								"from": [
									"int",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"speed": {
						"walk": 30,
						"climb": 30
					},
					"entries": [
						{
							"name": "The Art of Intelligence",
							"entries": [
								"Choose two tools from the following list: {@item Carpenter's tools|phb}, {@item Mason's tools|phb}, {@item Cobbler's tools|phb}, {@item Painter's tools|phb}, {@item Weaver's tools|phb}, {@item Glassblower's tools|phb}, or {@item Potter's tools|phb}. You gain proficiency in those tools, and you double your proficiency bonus for any ability checks you make with them."
							],
							"type": "entries"
						},
						{
							"name": "Serpent's Ward",
							"entries": [
								"Once per long rest, one of your snakes can inject you or a creature within 5-feet of you with a special poison. Instead of harming the individual, this poison seeks to establish antibodies in the body of the individual to increase their resistances. When you use this feature, you choose one effect from the list of variations below:"
							],
							"type": "entries"
						},
						{
							"type": "inset",
							"entries": [
								{
									"entries": [
										"{@bold Acid Ward}. The creature gains resistance to acid for one minute."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@bold Poison Ward}. The creature gains resistance to poison for one minute."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@bold Antivenom}. The creature is cured of the {@condition poisoned} condition and gains advantage on saving throws against the {@condition poisoned} condition for one minute."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Serpent's Ward II"
							}
						},
						{
							"name": "Master of High Places",
							"entries": [
								"You gain a climb speed of 30 feet."
							],
							"type": "entries"
						},
						{
							"entries": [],
							"type": "entries"
						},
						{
							"name": "Language",
							"entries": [
								"You can speak, read, and write Common, Abyssal, and Draconic."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Fey",
			"source": "WMRaces",
			"size": "V",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"traitTags": [],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Fey mature at the same rate as humans, but are considered young until they reach the age of 100. On average, they live about 700 years. Archefaeries are unique in this regard—so long as their blessing is continually maintained by their guardian contractor, they live indefinitely. However, true immortality is rare, as extended time spent in human civilizations generally will erode an archfaerie's mind, disconnecting them from the wild and their guardian contractor forever. An archfaerie with a weak will needs to regularly return to the Feywild; otherwise, they generally survive for a maximum of 200 years in a human settlement."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Fey delight in living a life free of the mantle of law. They gravitate toward being good, but some have devious streaks and enjoy causing dismay."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Fey range from just under 5 feet to about 6 feet in height, with generally slender builds. Your size is Medium, unless you are a Pixie. If you are a Pixie, your size is Tiny."
					],
					"type": "entries"
				},
				{
					"name": "The Great Summer Court",
					"entries": [
						"Your creature type is fey, rather than humanoid."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Archfaerie",
					"ability": [
						{
							"cha": 2,
							"choose": {
								"from": [
									"dex",
									"int",
									"wis"
								],
								"count": 1,
								"amount": 1
							}
						}
					],
					"speed": {
						"walk": 30,
						"fly": 35
					},
					"entries": [
						{
							"name": "Attuned Flight",
							"entries": [
								"You have a flying speed of 35 feet. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item."
							],
							"type": "entries"
						},
						{
							"name": "Nimble Trickster",
							"entries": [
								"Your base walking speed increases to 35 feet."
							],
							"type": "entries"
						},
						{
							"name": "Tricker's Mirage",
							"entries": [
								"One of the Summer Queen's many gifts was a blessing reminiscent of the playful pixies—a skill which allows you to immerse your body in the nature of world and become impossible to detect by mortal eyes. As an action, you become {@condition invisible} until the end of your next turn, or until you attack or cast a spell that targets another creature.",
								"You can use this ability twice, and regain all expended uses on a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Blessings of Autumn Wind",
							"entries": [
								"You have advantage on saving throws against spells."
							],
							"type": "entries"
						},
						{
							"name": "Gift of the Summer Queen",
							"entries": [
								"You learn the {@spell druidcraft} cantrip."
							],
							"type": "entries"
						},
						{
							"name": "Fey Ancestry",
							"entries": [
								"Magic can't put you to sleep."
							],
							"type": "entries"
						},
						{
							"name": "Heart Sight",
							"entries": [
								"Your connection to the Feywild has allowed you to retrieve the hearts of mortals and distill their personalities onto a matrix, to which you can uncover their true sense of being. As a bonus action, you can target one creature within 60 feet of you. That creature must succeed on a Wisdom saving throw equal to your save DC (8 + your proficiency bonus + your Charisma modifier).",
								"On a failed save, you learn that creature's emotional state, and whether they are inflicted by any conditions or diseases. Celestials, fiends, and undead automatically fail the saving throw. You can use this ability a number of times equal to your Charisma modifier, and regain all expended uses on a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Elvish, and Sylvan."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Pixie",
					"ability": [
						{
							"cha": 2,
							"dex": 1
						}
					],
					"speed": {
						"walk": 15,
						"fly": 35
					},
					"entries": [
						{
							"name": "Attuned Flight",
							"entries": [
								"You have a flying speed of 35ft. To use this speed, you must attune to the Way of Worlds by act of sacrificing an attunement slot. Attuning to flight takes the same amount of time and follows the same restrictions as attuning to a magic item. This flight is not affected by Antimagic fields."
							],
							"type": "entries"
						},
						{
							"name": "Amongst Giants",
							"entries": [
								"Tiny creatures have advantage on Dexterity saving throws, but disadvantage on Strength saving throws. In addition, tiny creatures can move into the spaces of creatures that are small or larger, provoking opportunity attacks as normal. They have a reach of 0 feet, meaning they must be in the same space as a creature to use a weapon or touch spell. This feature does not take effect if you are not currently considered Tiny."
							],
							"type": "entries"
						},
						{
							"name": "Pixie Magic",
							"entries": [
								"You know the {@spell Druidcraft}, {@spell Mending}, and {@spell Faerie Fire} spells. You can cast {@spell Faerie Fire} without expending a spell slot, and you must finish a long rest before you can cast it this way again. You can also cast this spell using any spell slots you have. Your spellcasting ability for these spells is your choice of Intelligence, or Charisma."
							],
							"type": "entries"
						},
						{
							"name": "Wrath of the Wee fey",
							"entries": [
								"Your Pixie upbringing makes you more martial than most and as such you have some training with weapons. You have proficiency with Shortbows, Shortswords, Hand Crossbows, Sickle, Slings, Pikes, and Shields. These weapons are specially made and must be properly sized for you due to your size."
							],
							"type": "entries"
						},
						{
							"name": "Pixie Dust",
							"entries": [
								"If you are standing in an allied creatures space, you can use a bonus action to give them temporary flight. This flight lasts two rounds and grants a flying speed equal to the creatures walking speed. This ability can only be used up to your Constitution Modifier. This Ability recharges on a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Fey Ancestry",
							"entries": [
								"You have advantage on saving throws you make to avoid or end the {@condition charmed} condition on yourself and magic can't put you to sleep."
							],
							"type": "entries"
						},
						{
							"name": "Fey Passage",
							"entries": [
								"You can squeeze through a space as narrow as 1 inch wide."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"Common, Sylvan, and one other of your choice."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Mousefolk",
			"source": "WMRaces",
			"size": "S",
			"speed": {
				"walk": 25
			},
			"ability": [
				{
					"null": null
				}
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"traitTags": [],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"A Mousefolk reaches adulthood at the age of 5 and lives to be about 60 years old."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Most Mousefolk are neutral, and tend towards good. They try to keep the conflicts of the other races at arm's length, but display remarkable ferocity when their friends, families, or communities are threatened. A reverence for nature and life is close to the heart of Mousefolk, and they are loath to take a life if it can be avoided. They prefer to live quiet and unassuming lives, giving honest work for honest pay."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Mousefolk grow between 2 and 2 1/2 feet tall and weigh about 25 pounds. Your size is Small."
					],
					"type": "entries"
				},
				{
					"name": "Keen Eye",
					"entries": [
						"You have proficiency in the Wisdom ({@skill Perception}) skill."
					],
					"type": "entries"
				},
				{
					"name": "Fleet of Foot",
					"entries": [
						"You have proficiency with the rapier, shortsword, shortbow, and handaxe."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Softpaw",
					"ability": [
						{
							"dex": 2,
							"int": 1
						}
					],
					"speed": {
						"walk": 25
					},
					"entries": [
						{
							"name": "Artistry",
							"entries": [
								"You gain proficiency with one type of artisan's tools or one musical instrument."
							],
							"type": "entries"
						},
						{
							"name": "Squirm",
							"entries": [
								"You can move through tiny-sized spaces as if you were tiny."
							],
							"type": "entries"
						},
						{
							"name": "Nimble Sense",
							"entries": [
								"When targeted with an attack of opportunity, you may use your reaction to impose disadvantage on that attack."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Squeak Speak, and Halfling."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Meadowguard",
					"ability": [
						{
							"dex": 2,
							"wis": 1
						}
					],
					"speed": {
						"walk": 25
					},
					"entries": [
						{
							"name": "Brave Heart",
							"entries": [
								"You have advantage on saving throws against being {@condition frightened}."
							],
							"type": "entries"
						},
						{
							"name": "Grace of the Small",
							"entries": [
								"Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts."
							],
							"type": "entries"
						},
						{
							"name": "Invoke Gift",
							"entries": [
								"You can instill power into the weapon of a nearby creature to enhance their blow with divine energy. As an action, a creature within 30 feet of you.",
								"Until the end of your next turn, the next time that creature succeeds on a melee weapon attack, that creature heals for {@dice 1d10} hit points (if you are good or neutral) or gains {@dice 1d8} temporary hit points (if you are evil). Once you use this trait, you can't use it again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Squeak Speak, and Halfling."
							],
							"type": "entries"
						}
					]
				}
			]
		}
	]
}