{
	"_meta": {
		"sources": [
			{
				"json": "WMRaces",
				"abbreviation": "WMR",
				"full": "West March Races",
				"authors": [
					"Gebri",
					"Aizea La Win / experimentation"
				],
				"convertedBy": [
					"Gebri#6820",
					"Aizea La Win#5106 / experimentation"
				],
				"version": "1.0.0",
				"url": "https://wyth.github.io/SRP/",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1537874753,
		"dateLastModified": 1537874753
	},
	"race": [
		{
			"name": "Genasi (Star)",
			"source": "WMRaces",
			"page": 3,
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"cha": 1
				}
			],
			"fluff": {
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://raw.githubusercontent.com/TheGiddyLimit/homebrew/master/_img/ATLAS/Star_Genasi.png"
						}
					}
				],
				"entries": [
					{
						"type": "quote",
						"entries": [
							"My mother once told me a story about the stars, heavenly entities that guide us from above, constantly watching over us from the night sky. She told me she'd met one once. I had thought she was joking."
						],
						"by": "Cecelia Winnows, Astrognomer"
					},
					{
						"name": "Nebulous Origins",
						"entries": [
							"The star genasi are born from the wishes of a mortal upon a star. They are the might and mind of heavenly bodies, and draw their power from the glowing core they carry in place of a heart, a shard of their parent star. This core grants them the power to illuminate the dark."
						]
					},
					{
						"name": "Otherworldly Appearance",
						"entries": [
							"Star genasi are strange creatures, with dark-blue skin that blends with the night sky and eyes containing the light of thousands of galaxies. They have silvery hair that shimmers with starlight in the light of day, the specks of light that infuse their skin and hair becoming less pronounced during the daytime. However, their eyes still bear the light of countless stars."
						]
					},
					{
						"name": "Star Genasi Names",
						"entries": [
							"Star genasi use the naming conventions of the people among whom they were raised. They might later assume the names of constellations or stars, such as Orion, Polaris, or Vega. Some take on more vague names to reflect their origins, such as Nebula, Nova, or Starlight."
						]
					}
				]
			},
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Genasi mature at about the same rate as humans and reach adulthood in their late teens. They live somewhat longer than humans do, up to 120 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Independent and self-reliant, genasi tend toward a neutral alignment."
					]
				},
				{
					"name": "Size",
					"type": "entries",
					"entries": [
						"Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium."
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"You can speak, read, and write Common and Primordial. Primordial is a guttural language, filled with harsh syllables and hard consonants."
					]
				},
				{
					"name": "Darkvision",
					"type": "entries",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				},
				{
					"name": "From the Stars",
					"type": "entries",
					"entries": [
						"You do not need to breathe and you are able to survive in a vacuum.",
						"Additionally, you have resistance to radiant damage."
					]
				},
				{
					"name": "Reach for the Stars.",
					"type": "entries",
					"entries": [
						"You know the {@spell twinkle|WMPS} cantrip. When you reach 3rd level, you can cast the {@spell faerie fire} spell as a 1st-level spell; you must finish a long rest in order to cast the spell again using this trait. When you reach 5th level, you can also cast the {@spell moonbeam} spell; you must finish a long rest in order to cast the spell again using this trait. Constitution is your spellcasting ability for these spells."
					]
				},
				{
					"type": "inset",
					"name": "Star Genasi Variant",
					"entries": [
						"Though most star genasi are born from living stars, sometimes the situations of their birth can result in the collapse of a star into a black hole.",
						"If your DM allows it, your star genasi character can forgo Reach for the Stars and instead gain the following feature:",
						{
							"name": "Black Hole Magic",
							"entries": [
								"You know the {@spell twinkle|WMPS} cantrip. When you reach 3rd level, you can cast the {@spell shatter} spell as a 2nd-level spell; you must finish a long rest in order to cast the spell again using this trait. When you reach 5th level, you can also cast the {@spell darkness} spell; you must finish a long rest in order to cast the spell again using this trait. Constitution is your spellcasting ability for these spells."
							],
							"type": "entries"
						}
					]
				}
			],
			"languageProficiencies": [
				{
					"common": true,
					"primordial": true
				}
			],
			"additionalSpells": [
				{
					"innate": {
						"1": [
							"twinkle|WMPS"
						],
						"3": [
							"faerie fire",
							"shatter"
						],
						"5": [
							"moonbeam",
							"darkness"
						]
					},
					"ability": "con"
				}
			],
			"resist": [
				"radiant"
			],
			"age": {
				"mature": 20,
				"max": 120
			}
		},
		{
			"name": "Starforged",
			"source": "WMRaces",
			"page": 5,
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
					}
				}
			],
			"fluff": {
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://raw.githubusercontent.com/TheGiddyLimit/homebrew/master/_img/ATLAS/Starforged.png"
						}
					}
				],
				"entries": [
					{
						"type": "quote",
						"entries": [
							"I remember it so clearly, it was fleeting, but it was there, it came as soon as it arrived. My first thought, the first thing my core every thought of, a simple phrase: Why am I here?"
						],
						"by": "Hem Haywire, Starforged"
					},
					{
						"name": "Sentient Constructs",
						"entries": [
							"Constructs created from the parts of meteorite or comets, some of these mindless automatons develop sentience after a single catalyzing thought. This thought ruminates within the starforged as it continues its designated function, but slowly grows into more and more thoughts, until flowering into sentience and a concept of self. Though this process varies from between starforged, each one's first thought remains universally the single thing that it dedicates its life to unraveling."
						]
					},
					{
						"name": "Born of Space",
						"entries": [
							"Starforged are a singular bright and white core surrounded by rock and ice. The core acts as the brain for the creature as well as its mouth and eyes. The rock and ice that makes them up floats around this core, but will move to a position in a way that simulates a humanoid. They will rarely form heads, however, letting their core rest in the middle of their chest instead."
						]
					},
					{
						"name": "Driving Question",
						"entries": [
							"A starforged's life is dedicated to understanding its first thought, normally to answering its question or unveiling the meaning behind that thought. Starforged are innately curious about the world, learning by testing and observing how things work. They tend to be empathetic to other humanoids wanting to achieve humanity. They can however be resentful to humans if their master had treated them badly enough before their awakening. This makes them violent and quick to anger when humanoids are hostile towards them."
						]
					},
					{
						"name": "Starforged Names",
						"entries": [
							"Nameless before achieving sentience, a starforged chooses or is given a name after gaining a sense of self. Names given to a starforged by another creature take after that creature's language and culture.",
							"Names chosen by a starforged for itself often relate to its first thought, sometimes creating anagrams of the thought. Thoughts such as \"Who am I?\" can be rearranged into names like Whaimo, or abbreviated into names such as Ami."
						]
					}
				]
			},
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"After achieving sentience, starforged mature at the same age as humans. They can live until their core run out of energy, a process that can take up to 700 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Most starforged take comfort in order and discipline, tending toward law and neutrality, but some have absorbed the morality—or lack thereof—of the beings they served with."
					]
				},
				{
					"name": "Size",
					"type": "entries",
					"entries": [
						"Your size is Medium. Most starforged stand between 5 and 6½ feet tall."
					]
				},
				{
					"name": "Luminous Core",
					"type": "entries",
					"entries": [
						"You know the light cantrip. Constitution is your spellcasting ability for it."
					]
				},
				{
					"name": "Languages",
					"type": "entries",
					"entries": [
						"You can speak, read, and write Common and one extra language of your choice."
					]
				},
				{
					"name": "Starforged Resilience",
					"type": "entries",
					"entries": [
						"Your constructed and cosmic nature grants you the following benefits:",
						{
							"type": "list",
							"items": [
								"Your creature type is elemental, rather than humanoid.",
								"You have resistance to cold damage.",
								"You are immune to disease.",
								"You don't need to eat, drink, or breathe.",
								"You don't need to sleep and don't suffer the effects of exhaustion due to lack of rest, and magic can't put you to sleep."
							]
						}
					]
				},
				{
					"name": "Natural Armor",
					"type": "entries",
					"entries": [
						"Your body is composed of metal, stone, and strands of starlight. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
					]
				},
				{
					"name": "Lithoid Transparency",
					"type": "entries",
					"entries": [
						"While you remain motionless, you are indistinguishable from an ordinary rock formation."
					]
				},
				{
					"name": "Sentry's Rest",
					"type": "entries",
					"entries": [
						"When you take a long rest, you must spend at least six hours of it in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you {@condition unconscious}, and you can see and hear as normal."
					]
				}
			],
			"languageProficiencies": [
				{
					"common": true,
					"anyStandard": 1
				}
			],
			"resist": [
				"cold"
			],
			"conditionImmune": [
				"disease"
			]
		},
		{
			"name": "Firenewt",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"dex": 2,
					"con": 1
				}
			],
			"traitTags": [
				"Spellcasting",
				"Damage Resistance"
			],
			"languageProficiencies": [
				{
					"primordial": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"Firenewts reach adulthood at age five, but have been known to live up to 50 years."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Firenewts worship Imix, the Prince of Evil Fire. A religion which permeates their very being, causing them to revel in evil acts across the Plane of Fire. Firenewt society has few rules, although they are more regimented than a goblin horde or an orc tribe. They are thus usually more neutral rather than lawful or chaotic."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"A firenewt stands at roughly 6 feet tall (about a third of which being their necks), and maintain narrow, extremely tubular torsos. Your size is Medium."
					],
					"type": "entries"
				},
				{
					"name": "Amphibious?",
					"entries": [
						"You can breathe in smoke, air, and water. In addition, you can ingest lava and other flammable liquids."
					],
					"type": "entries"
				},
				{
					"name": "Spit Fire",
					"entries": [
						"As a bonus action, you can spit a molt of fire at a creature within 10 feet of you. That creature must make a Dexterity saving throw equal to 8 + your proficiency bonus + your Constitution modifier. On a failed save, that creature takes {@dice 1d8} fire damage, or half as much on a successful one. The fire damage increases to {@dice 2d8}} at 5th level. {@dice 3d8}} at 10th level, {@dice 4d8}} at 15th level, and {@dice 5d8}} at 20th level. Once you use this feature, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Lizard of Flames",
					"entries": [
						"You have resistance to fire damage, and do not take any damage from being immersed in lava or other hot liquids. In addition, you do not suffer any ill effects from extreme heat."
					],
					"type": "entries"
				},
				{
					"name": "Conventional Weaponry",
					"entries": [
						"You gain proficiency in scimitars."
					],
					"type": "entries"
				},
				{
					"name": "Touched by the Fire Lord",
					"entries": [
						"As an action, you immerse yourself in the rage of Imix, the Prince of Evil Fire. For the next minute, whenever you take slashing or piercing damage from a creature within 5 feet of you, that creature takes {@dice 1d6} fire damage. Once you use this feature, you cannot use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Language",
					"entries": [
						"You can speak, read, and write Common, Ignan, and Draconic."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Awakened",
			"source": "WMRaces",
			"size": [
				"T"
			],
			"speed": {
				"walk": null
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Imbued with magic, awakened age more slowly and typically live much longer than their unawakened counterparts. They reach adulthood after a year but can live for as long as 60 years."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Awakened will generally adopt the alignment of their owner, if they have any. Without an owner, an awakened upbringing can be radically different, as a result of the instinctual urges various breeds of awakened have. The best and worst exist among their ranks."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Awakened are miniscule individuals, yet their sizes vary greatly. Cats reach just under 1 foot tall and 2 feet long from head to tail, typically weighing between 7 and 10 pounds, with larger breeds weighing up to 20 pounds. Dogs, meanwhile, are about 2 to 3 feet in height and generally weigh between 40 and 90 pounds. Regardless of your breed, your size is Tiny."
					]
				},
				{
					"type": "entries",
					"name": "Beastly",
					"entries": [
						"Your creature type is beast, rather than humanoid."
					]
				},
				{
					"type": "entries",
					"name": "You Are an Animal",
					"entries": [
						"Awakened don't have hands, but their arms (depending on the breed) are dextrous enough to handle the same tasks a humanoid would be able to do, as well as allow them to use weapons."
					]
				},
				{
					"type": "entries",
					"name": "Amongst Giants",
					"entries": [
						"You have advantage on Dexterity saving throws, but disadvantage on Strength saving throws."
					]
				}
			],
			"subraces": [
				{
					"name": "Cat",
					"speed": {
						"walk": 35,
						"climb": 30
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"wis": 1,
							"choose": {
								"from": [
									"dex",
									"int"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Darkvision",
							"entries": [
								"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
							]
						},
						{
							"type": "entries",
							"name": "Animal Instinct",
							"entries": [
								"Your base walking speed increases to 35 and your base climbing speed increases to 30."
							]
						},
						{
							"type": "entries",
							"name": "Escape Artist",
							"entries": [
								"While you are conscious, fall damage cannot knock you prone. In addition, you can use your reaction to reduce fall damage by an amount equal to 5 times your level. If this would reduce the damage of a fall greater than 20 feet to zero, you can choose to move a distance equal to half of your movement speed as part of the same reaction without provoking opportunity attacks."
							]
						},
						{
							"type": "entries",
							"name": "Cat's Claws",
							"entries": [
								"Your claws are natural weapons with the finesse property, which you can use to make unarmed strikes. On a hit, you deal slashing damage equal to {@dice 1d4} + your Strength or Dexterity modifier, instead of the typical bludgeoning damage of an unarmed strike."
							]
						},
						{
							"type": "entries",
							"name": "Cat's Talents",
							"entries": [
								"You have proficiency in the {@skill Perception} and {@skill Stealth} skills."
							]
						},
						{
							"type": "entries",
							"name": "Pounce!",
							"entries": [
								"As a bonus action, you can leap to a creature you can see within 30 feet without provoking opportunity attacks. Once you use this feature, you cannot use it again until you finish a short or long rest."
							]
						},
						{
							"type": "entries",
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and one other language of your choice."
							]
						}
					]
				},
				{
					"name": "Chicken",
					"speed": {
						"walk": 25
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"dex": 1,
							"choose": {
								"from": [
									"con",
									"wis"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Peck & Claw",
							"entries": [
								"You have proficiency with your claws, which are a finesse weapon that deal {@dice 1d6} slashing damage."
							]
						},
						{
							"type": "entries",
							"name": "Into the Sunset",
							"entries": [
								"If you move at least 10 feet on foot, you can choose to gain a fly speed equal to your remaining movement. A chicken who begins to fly must end their movement on the ground or a solid surface. A chicken who ends its turn in the air immediately plummets to the ground. To use this speed you can't be wearing medium or heavy armor.",
								"In addition, while falling, you can use your reaction to slow your descent as if you were under the effects of the {@spell feather fall} spell."
							]
						},
						{
							"type": "entries",
							"name": "Bawk!",
							"entries": [
								"When you use your action to perform a melee attack, you can use the Help action against the target as a bonus action, as you begin to pester them with your flailing wings."
							]
						},
						{
							"type": "entries",
							"name": "Absurdly Paranoid",
							"entries": [
								"You are proficient in the {@condition Perception} skill and cannot have disadvantage on Wisdom {@condition Perception} checks."
							]
						},
						{
							"type": "entries",
							"name": "Tale of the Headless Chicken",
							"entries": [
								"As a bonus action on your turn, you can let out a terrified BAWK! Your movement speed increases by 25 until the end of your turn. Once you use this feature, you cannot use it again until you finish a short or long rest."
							]
						},
						{
							"type": "entries",
							"name": "Bleh",
							"entries": [
								"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. If you do so, you fall into a heap of unconscious feathers and render yourself {@condition prone}. You are considered to be under similar effects to the {@spell feign death} spell. While subject to this condition, you are unable to move or take actions other than using an action to end this effect. Once you use this trait, you are unable to use it again until you finish a long rest."
							]
						},
						{
							"type": "entries",
							"name": "Languages",
							"entries": [
								"You can read and understand Common and one language of your choice. You are are able to communicate via a series of clucks, squawks, cackles, and similar utterances to other avian creatures as well."
							]
						}
					]
				},
				{
					"name": "Dog",
					"speed": {
						"walk": 40
					},
					"ability": [
						{
							"con": 1,
							"choose": {
								"from": [
									"str",
									"dex",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Bite",
							"entries": [
								"Your carnivorous canines are a natural weapon, which you can use to make unarmed strikes. On a hit, you deal slashing damage equal to {@dice 1d6} + your Strength modifier, instead of the typical bludgeoning damage of an unarmed strike."
							]
						},
						{
							"type": "entries",
							"name": "Animal Instinct",
							"entries": [
								"Your base walking speed increases to 40."
							]
						},
						{
							"name": "Keen Nose",
							"entries": [
								"You have proficiency in the {@skill Perception} skill and gain advantage on Wisdom ({@skill Perception}) checks that rely on sight or smell."
							],
							"type": "entries"
						},
						{
							"name": "Speak!",
							"entries": [
								"You may use the Help action as a bonus action, for a number of times equal to your Proficiency bonus. You regain the ability to use the Help action this way after finishing a short or long rest. At level 3, when you use the Help action to aid an ally in attacking a creature, the target of that attack can be within 30 feet of you, rather than within 5 feet of you. Should the ally already have advantage, then it may add half your proficiency bonus (rounded up) to the attack's hit and damage roll instead."
							],
							"type": "entries"
						},
						{
							"name": "Who's a Good Boy?",
							"entries": [
								"As an action, you can comfort a friendly creature within 5 feet who isn't {@condition incapacitated}. For one minute, the affected creature cannot be {@condition frightened}, and they are no longer under the effects of the {@condition frightened} condition if they were previously. You can use this ability a number of times equal to your Charisma modifier (minimum 1), and regain all expended uses on a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Loyal & Loved",
							"entries": [
								"While attempting to convince a creature of something, you can choose to attack their hearts directly with the most adorable pair of puppy eyes they've ever seen. For the next minute, you gain advantage on Charisma ({@skill Persuasion}) checks against that creature. Once you use this feature, you cannot use it again until you finish a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and one other language of your choice."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Elf (City)",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": 30
			},
			"ability": [
				{
					"dex": 2,
					"int": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."
					]
				},
				{
					"name": "Darkvision",
					"entries": [
						"Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Keen Senses",
					"entries": [
						"You have proficiency in the Perception skill."
					],
					"type": "entries"
				},
				{
					"name": "Fey Ancestry",
					"entries": [
						"You have advantage on saving throws against being charmed, and magic can't put you to sleep."
					],
					"type": "entries"
				},
				{
					"name": "Trance",
					"entries": [
						"Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance.') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
					],
					"type": "entries"
				},
				{
					"name": "Agile Scaler",
					"entries": [
						"You gain a climb speed equal to 30 feet."
					],
					"type": "entries"
				},
				{
					"name": "Mask of the Urbane",
					"entries": [
						"You can attempt to hide even when you are only lightly obscured by crowds, smoke, structures, and other urban features."
					],
					"type": "entries"
				},
				{
					"name": "Streetwise",
					"entries": [
						"You gain proficiency with one of the following skills of your choice: Deception, Intimidation, Persuasion, Sleight of Hand, or Stealth."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Elf (Drow)",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"dex": 2,
					"cha": 1
					}
			],
			"darkvision": 120,
			"traitTags": [
				"Darkvision",
				"Skill Proficiency"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."
					]
				},
				{
					"name": "Superior Darkvision",
					"entries": [
						"Accustomed to the depths of the Underdark, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Keen Senses",
					"entries": [
						"You have proficiency in the Perception skill."
					],
					"type": "entries"
				},
				{
					"name": "Fey Ancestry",
					"entries": [
						"You have advantage on saving throws against being {@condition charmed}, and magic can't put you to sleep."
					],
					"type": "entries"
				},
				{
					"name": "Trance",
					"entries": [
						"Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance.') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
					],
					"type": "entries"
				},
				{
					"name": "Drow Magic",
					"entries": [
						"You know the {@spell dancing lights} cantrip. When you reach 3rd level, you can cast the {@spell faerie fire} spell once with this trait; you regain the ability to cast it when you finish a long rest. When you reach 5th level, you can also cast the {@spell darkness} spell once per day with this trait; you regain the ability to cast it when you finish a long rest. You may choose Intelligence, Wisdom, or Charisma to be your spellcasting ability for these spells."
					],
					"type": "entries"
				},
				{
					"name": "Drow Weapon Training",
					"entries": [
						"You have proficiency with {@item rapier|phb|rapiers}, {@item shortsword|phb|shortswords}, and {@item hand crossbow|phb|hand crossbows}."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Aasimar  (Court)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"dex": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting",
				"Improved Resting"
			],
			"languageProficiencies": [
				{
					"common": true,
					"elvish": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Age",
					"entries": [
						"You mature at the same rate as an elf, but you can live up to 1,000 years."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Fey Ancestry",
					"entries": [
						"You have advantage on saving throws against being charmed, and magic can't put you to sleep."
					],
					"type": "entries"
				},
				{
					"name": "Trance",
					"entries": [
						"You don't need to sleep. Instead, you meditate deeply, remaining semiconscious, for 4 hours a day. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
						"{@note If you meditate during a long rest, you finish the rest after only 4 hours. You otherwise obey all the rules for a long rest; only the duration is changed.}"
					],
					"type": "entries"
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Healing Hands",
					"entries": [
						"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Light Bearer",
					"entries": [
						"You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Guidance From the Past",
					"entries": [
						"Starting at 3rd level, you can use a bonus action to draw on your connection to your ancestors. Misty tendrils flow around you, whispering advice only you can hear.",
						"Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you gain advantage on all Wisdom checks and saving throws.",
						"Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common, Elvish, and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Demihuman",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"count": 1
					}
				}
			],
			"traitTags": [],
			"languageProficiencies": [
				{
					"common": true,
					"beastspeech": true
				}
			],
		"entries": [
		{
			"type": "entries",
			"name": "Age",
			"entries": [
				"Demihumans reach adulthood in their late teens and live less than a century."
			]
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Demiumans tend toward no particular alignment. The best and the worst are found among them."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Demihumans vary widely in height and build, from barely 4 feet to well over 7 feet tall. Regardless of your position in that range, your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You begin with Common and Beastspeech. Beastspeech can only be learned by Demis and, when speaking it, they can communicate with the animal they resemble as if under the effect of the spell, {@spell speak with animals}. For example, a sheep demihuman could speak with sheep."
			]
		},
		{
			"type": "entries",
			"name": "Birth From Creation",
			"entries": [
				"All Demihumans are radically different from one another, depending on the changes than manifested within them from birth. You can select one bestial enhancement now, a second bestial enhancement at 5th level, and a third bestial enhancement at 9th level.",
				"At 1st level, choose one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Born From Waves",
							"entry": "You can breathe air and water, and you have a swimming speed equal to your walking speed."
						},
						{
							"type": "item",
							"name": "Adept Climber",
							"entry": "You have a climbing speed equal to your walking speed."
						},
						{
							"type": "item",
							"name": "Darkvision",
							"entry": "Accustomed to life underground or the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
						}
					]
				},
				"At 3rd level, your body evolves further, developing new characteristics. Choose one of the options you didn't take at 1st level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Natural Armor",
							"entry": "When you aren’t wearing armor, your AC equals 12 + your Constitution or Dexterity modifier (your choice)."
						},
						{
							"type": "item",
							"name": "Echolocation",
							"entry": "As a bonus action on your turn you can emit a shriek inaudible to creatures without this trait. Until the end of your next turn you have blindsight up to 30 feet away while you are not deafened. You have a number of uses equal to your proficiency bonus, and you regain all uses of it when you finish a short or long rest. "
						},
						{
							"type": "item",
							"name": "Chameleon",
							"entry": "You have advantage on Dexterity (Stealth) checks if you have not used your movement during the current turn. In addition, you can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
						}
					]
				},
				"At 5th level, your body has reached the pinnacle of its evolution, developing a final characteristic. Choose one of the options you didn't take at 1st or 3rd level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Flight",
							"entry": "You've manifested a pair of wings, and you gain a flying speed of 30 feet. However, you must end your turn on the ground or a solid surface, or else you will slowly glide back down to the ground."
						},
						{
							"type": "item",
							"name": "Relentless",
							"entry": "When you are left with 0 hit points but not killed outright, you can use a reaction to be left with 1 hit point instead. Once you use this ability, you cannot use it again until you finish a long rest."
						},
						{
							"type": "item",
							"name": "Grappling Appendages",
							"entry": "You have two special appendages growing alongside your arms. As an action, you can use one of them to try to grapple a creature. Each one is also a natural weapon, which you can use to make an unarmed strike. If you hit with it, the target takes bludgeoning damage equal to {@dice 1d6} plus your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. Immediately after hitting, you can try to grapple the target as a bonus action. These appendages can't precisely manipulate anything and can't wield weapons, magic items, or other specialized equipment."
								}
							]
						}
					]
				}
			]
		},
		{
			"name": "Half-Nasod",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"dex": 2,
					"choose": {
						"from": [
							"con",
							"int"
						],
						"count": 1
					}
				}
			],
			"traitTags": [],
			"languageProficiencies": [
				{
					"common": true,
					"neural": true
				}
			],
		"entries": [
		{
			"type": "entries",
			"name": "Age",
			"entries": [
				"Half-Nasods age at virtually the same rate as Humans, although they live a bit longer, with the oldest of them being around one-hundred and thirty years old."
			]
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Half-Nasods tend toward no particular alignment. The best and the worst are found among them."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Half-Nasods vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You can speak, read, and write Common and Neural."
			]
		},
		{
			"type": "entries",
			"name": "Cybernetic Implants",
			"entries": [
				"All Half-Nasods have been modified from their original race in some way, with these cybernetics varying immensely. You can select one cybernetic enhancement now, a second cybernetic enhancement at 3rd level, and a third cybernetic enhancement at 5th level.",
				"At 1st level, choose one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Implanted Weapon",
							"entry": "You have a one-handed ranged or melee weapon that you are proficient with hidden under your skin. This weapon has the properties it would normally have, and the Concealed property if it didn’t have it already. Drawing this weapon is an item interaction. You may swap out the weapon implanted in this way whenever you gain a level. You may choose this implant a second time."
						},
						{
							"type": "item",
							"name": "Optical Implants",
							"entry": "In conditions of clear visibility, you can make out details of even extremely distant creatures and objects as small as 2 feet across. You can also see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades representative of thermal vision."
						},
						{
							"type": "item",
							"name": "Burst Joint",
							"entry": "Your movement speed is raised from 30 to 35. You may also {@action Dash} as a bonus action once per short or long rest."
						}
					]
				},
				"At 3rd level, you manage to acquire a new cybernetic implant, allowing you access to new abilities. Choose one of the options you didn't take at 1st level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Propulsion Systems",
							"entry": "As a bonus action, you may manifest your propulsion systems. You gain a flight speed equal to your walking speed, though you must end your turn on a solid surface. Otherwise, your propulsion systems will sputter out, and you fall to the ground at the end of your turn. You may activate your propulsion systems a number of times equal to your proficiency bonus. You regain all expended uses on a long rest."
						},
						{
							"type": "item",
							"name": "Reinforced Bones",
							"entry": "As a reaction to when you are hit by an attack, you may increase your AC by 2 until the start of your next turn as you attempt to block incoming attacks. You may do this an amount of times equal to your proficiency bonus. You regain all expended uses on a long rest."
						},
						{
							"type": "item",
							"name": "Microgenerator",
							"entry": "You’ve implanted a small, high-voltage generator within your circulatory system that packs a shocking punch. When you’re reduced to a quarter of your hit points (rounded down), you may use a reaction to unleash an electroshock in a ten foot radius. All creatures within that radius must make a Strength saving throw equal to 8 + proficiency bonus + Constitution modifier or be pushed back ten feet and knocked prone. Once you’ve used this implant, you must complete a long rest before using it again."
						}
					]
				},
				"At 5th level, you've managed to acquire one last cybernetic enhancement, as modifying yourself any further would strain your body too much for the time being. Choose one of the options you didn't take at 1st or 3rd level, or one of the following options:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Internal Defibrillator",
							"entry": "When you would die from failing three death saving throws, an electric jolt is sent into your heart, stabilizing you on the spot and saving you from certain death. Once activated, you must complete a long rest before this implant recharges."
						},
						{
							"type": "item",
							"name": "High Intelligence Chip",
							"entry": "You gain access to 1 extra language or 1 extra skill proficiency of your choice and the ability to gain proficiency in one weapon of your choice. While this chip is in your head, you gain the ability to gain advantage on a skill check you have proficiency in. You may do this a number of times equal to your Proficiency bonus. You regain all expended uses on a long rest."
						},
						{
							"type": "item",
							"name": "Cybernetic Reflexes",
							"entry": "You may take the {@action Dodge} action as a bonus action twice. You regain all expended uses on a long rest."
								}
							]
						}
					]
				}
			]
		},
		{
			"name": "Aasimar  (Mabaran)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"con": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"common": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Consuming Touch",
					"entries": [
						"As an action, you can make a melee spell attack against a creature within your reach. On a hit, the target takes necrotic damage equal to a number of d4s equal to your proficiency bonus, and you regain hit points equal to half the damage dealt (round up). Once you use this trait, you can't use it again until you finish a long rest. Charisma is your spellcasting ability for this trait."
					],
					"type": "entries"
				},
				{
					"name": "Herald of Doom",
					"entries": [
						"You know the {@spell toll the dead|xge} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Necrotic Shroud",
					"entries": [
						"Your eyes briefly become pools of darkness, and ghostly, flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you that can see you must succeed on a Charisma saving throw (DC 8 + your proficiency bonus + your Charisma modifier) or become frightened of you until the end of your next turn. Until the transformation ends, once on each of your turns, you can deal extra necrotic damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Aasimar  (Seeker)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"con": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"common": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Celestial Resistance",
					"entries": [
						"You have resistance to necrotic damage and radiant damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Healing Hands",
					"entries": [
						"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Light Bearer",
					"entries": [
						"You know the {@spell light} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Shroud of Life and Death",
					"entries": [
						"Starting at 3rd level, you can use your bonus action to awaken the power in your blood, causing a nimbus of crimson energy to flow out from you.",
						"Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you shed dim light in a 10-foot radius, and at the end of each of your turns, one creature within 30 feet of you takes necrotic damage equal to your proficiency bonus. In addition, if you or an ally within 30 feet drops to 0 hit points without being killed outright, you can use your reaction to preserve them, causing them to drop to 1 hit point instead. When you use this reaction, it ends your transformation early.",
						"Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
			"name": "Aasimar  (Fernian)",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"cha": 2,
					"con": 1
					}
			],
			"darkvision": 60,
			"traitTags": [
				"Darkvision",
				"Spellcasting"
			],
			"languageProficiencies": [
				{
					"common": true
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Fernian Resistance",
					"entries": [
						"You have resistance to necrotic damage and fire damage."
					],
					"type": "entries"
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Healing Hands",
					"entries": [
						"As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Spirit of Flame",
					"entries": [
						"You know the {@spell produce flame} cantrip. Charisma is your spellcasting ability for it."
					],
					"type": "entries"
				},
				{
					"name": "Shroud of Flame",
					"entries": [
						"Starting at 3rd level, you can use your bonus action to unleash the unending flames within yourself, causing a roaring fire to spring from you, pour out of your eyes and mouth, and threaten to char you.",
						"Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes fire damage equal to your proficiency bonus. In addition, once on each of your turns, you can deal extra fire damage to one target when you deal damage to it with an attack or a spell. The extra fire damage equals your proficiency bonus.",
						"Once you use this trait, you can't use it again until you finish a long rest."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language."
					],
					"type": "entries"
				}
			]
		},
		{
	"name": "Warforged",
	"source": "WMRaces",
	"size": [
		"M"
	],
	"speed": 30,
	"ability": [
		{
			"con": 2,
			"choose": {
				"from": [
					"str",
					"dex",
					"int",
					"wis",
					"cha"
				],
				"count": 1
			}
		}
	],
	"heightAndWeight": {
		"baseHeight": 70,
		"heightMod": "2d6",
		"baseWeight": 270,
		"weightMod": "4"
	},
	"age": {
		"mature": 2,
		"max": 30
	},
	"traitTags": [
		"Improved Resting",
		"Natural Armor"
	],
	"skillProficiencies": [
		{
			"any": 1
		}
	],
	"languageProficiencies": [
		{
			"common": true,
			"anyStandard": 1
		}
	],
	"toolProficiencies": [
		{
			"any": 1
		}
	],
	"resist": [
		"poison"
	],
	"conditionImmune": [
		"disease"
	],
	"entries": [
		{
			"name": "Age",
			"entries": [
				"A typical warforged is between two and thirty years old. The maximum warforged lifespan remains a mystery; so far, warforged have shown no signs of deterioration due to age. You are immune to magical aging effects."
			],
			"type": "entries"
		},
		{
			"type": "entries",
			"name": "Alignment",
			"entries": [
				"Most warforged take comfort in order and discipline, tending toward law and neutrality. But some have absorbed the morality, or lack thereof, of the beings with which they served."
			]
		},
		{
			"type": "entries",
			"name": "Size",
			"entries": [
				"Your size is Medium."
			]
		},
		{
			"type": "entries",
			"name": "Constructed Resilience",
			"entries": [
				"You were created to have remarkable fortitude, represented by the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on saving throws against being {@condition poisoned}, and you have resistance to poison damage.",
						"You don't need to eat, drink, or breathe.",
						"You are immune to disease.",
						"You don't need to sleep, and magic can't put you to sleep."
					]
				}
			]
		},
		{
			"type": "entries",
			"name": "Sentry's Rest",
			"entries": [
				"When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you {@condition unconscious}, and you can see and hear as normal."
			]
		},
		{
			"type": "entries",
			"name": "Integrated Protection",
			"entries": [
				"Your body has built-in defensive layers, which can be enhanced with armor:",
				{
					"type": "list",
					"items": [
						"You become proficient with light and medium armor.",
						"You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.",
						"While you live, the armor incorporated into your body can't be removed against your will."
					]
				}
			]
		},
		{
			"type": "entries",
			"name": "Specialized Design",
			"entries": [
				"You gain one skill proficiency and one tool proficiency of your choice."
			]
		},
		{
			"type": "entries",
			"name": "Languages",
			"entries": [
				"You can speak, read, and write Common and one other language of your choice."
					]
				}
			]
		},
		{
			"name": "Nasod",
			"source": "WMRaces",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 1
				}
			],
			"traitTags": [
				"Improved Resting"
			],
			"languageProficiencies": [
				{
					"other": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"With the proper replacement parts and activities to occupy yourself, you can conceivably exist indefinitely. Nasods are known to degrade and lose their sanity, however, if they live too long without an explicit purpose. It is not known if this insanity visits all Nasods at old age, or just those whose resolve wavers."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Nasods possess mechanical minds, which find logic comforting. Generally, Nasods are lawful."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"As constructs modified by self-aware machines, Nasods could conceivably be perfectly uniform, like the Warforged that preceded them. However, the Foundries are either inherently flawed, or otherwise have a fondness for making diverse units, for each created Nasod is in some way unique. Nasod units stand between 5 and 7 feet tall and average about 150 to 300 pounds. Your size is Medium."
					]
				},
				{
					"type": "entries",
					"name": "Created by Code",
					"entries": [
						"Even though you were constructed, you are a living creature, represented by the following benefits:",
						{
							"type": "list",
							"items": [
								"You have advantage on saving throws against being {@condition poisoned}, and you have resistance to poison damage.",
								"You are immune to disease.",
								"You don't need to eat, drink, or breathe."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Thermal Vision",
					"entries": [
						"Equipped with a heat-detecting thermal vision system beneath your eyelids, you have enhanced vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades representative of thermal vision."
					]
				}
			],
			"subraces": [
				{
					"name": "Production",
					"traitTags": [
						"Spellcasting",
						"Skill Proficiency",
						"Tool Proficiency"
					],
					"languageProficiencies": [
						{
							"other": true
						}
					],
					"ability": [
						{
							"choose": {
								"from": [
									"int",
									"dex"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Made to Assemble",
							"entries": [
								"You gain two skill proficiencies of your choice and one {@book tool|phb|5|tools} proficiency of your choice."
							]
						},
						{
							"type": "entries",
							"name": "On the Line",
							"entries": [
								"You know the {@spell mending} cantrip, and your casting time for this spell is an action. Intelligence is your spellcasting ability for it. You can cast {@spell mending} as an action a number of times equal to your proficiency bonus, and regain all expended uses on a long rest. While you have no remaining uses, the casting time of {@spell mending} becomes a minute."
							]
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and Neural."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Soldier",
					"traitTags": [
						"Spellcasting"
					],
					"ability": [
						{
							"choose": {
								"from": [
									"str",
									"dex"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"name": "It's Just Anti-Freeze",
							"entries": [
								"You do not suffer any ill effects from extreme cold or heat."
							],
							"type": "entries"
						},
						{
							"name": "Designed to Endure",
							"entries": [
								"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Born in the Future",
							"entries": [
								"You gain one simple, martial, or exotic weapon proficiency of your choice."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and Neural."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Magi",
					"traitTags": [
						"Spellcasting"
					],
					"ability": [
						{
							"choose": {
								"from": [
									"int",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"name": "Modern Magic",
							"entries": [
								"You know the {@spell on/off|WMPS} cantrip. When you reach 3rd level, you can cast the {@spell expeditious retreat} spell once per day. At 5th level, you can cast the {@spell levitate} spell once per day. Intelligence or Wisdom (your choice) is your spellcasting ability for these spells."
							],
							"type": "entries"
						},
						{
							"name": "Lightning Magnet",
							"entries": [
								"As an action, you can assume the form of lightning by breaking your physical form apart into all its components. You gain a fly speed of 15 feet. In addition, you have resistance to lightning and and thunder damage. You also ignore difficult terrain. This transformation lasts for a number of turns equal to your proficiency bonus before you revert back to normal at the start of your turn. After using this ability, you can use it again after you take a short or long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common and Neural."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Mousefolk",
			"source": "WMRaces",
			"size": [
				"S"
			],
			"speed": {
				"walk": 25
			},
			"ability": [
				{
					"null": null
				}
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"traitTags": [],
			"entries": [
				{
					"name": "Age",
					"entries": [
						"A Mousefolk reaches adulthood at the age of 5 and lives to be about 60 years old."
					],
					"type": "entries"
				},
				{
					"name": "Alignment",
					"entries": [
						"Most Mousefolk are neutral, and tend towards good. They try to keep the conflicts of the other races at arm's length, but display remarkable ferocity when their friends, families, or communities are threatened. A reverence for nature and life is close to the heart of Mousefolk, and they are loath to take a life if it can be avoided. They prefer to live quiet and unassuming lives, giving honest work for honest pay."
					],
					"type": "entries"
				},
				{
					"name": "Size",
					"entries": [
						"Mousefolk grow between 2 and 2 1/2 feet tall and weigh about 25 pounds. Your size is Small."
					],
					"type": "entries"
				},
				{
					"name": "Keen Eye",
					"entries": [
						"You have proficiency in the Wisdom ({@skill Perception}) skill."
					],
					"type": "entries"
				},
				{
					"name": "Fleet of Foot",
					"entries": [
						"You have proficiency with the rapier, shortsword, shortbow, and handaxe."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Softpaw",
					"ability": [
						{
							"dex": 2,
							"int": 1
						}
					],
					"speed": {
						"walk": 25
					},
					"entries": [
						{
							"name": "Artistry",
							"entries": [
								"You gain proficiency with one type of artisan's tools or one musical instrument."
							],
							"type": "entries"
						},
						{
							"name": "Squirm",
							"entries": [
								"You can move through tiny-sized spaces as if you were tiny."
							],
							"type": "entries"
						},
						{
							"name": "Nimble Sense",
							"entries": [
								"When targeted with an attack of opportunity, you may use your reaction to impose disadvantage on that attack."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Squeak Speak, and Halfling."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Meadowguard",
					"ability": [
						{
							"dex": 2,
							"wis": 1
						}
					],
					"speed": {
						"walk": 25
					},
					"entries": [
						{
							"name": "Brave Heart",
							"entries": [
								"You have advantage on saving throws against being {@condition frightened}."
							],
							"type": "entries"
						},
						{
							"name": "Grace of the Small",
							"entries": [
								"Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts."
							],
							"type": "entries"
						},
						{
							"name": "Invoke Gift",
							"entries": [
								"You can instill power into the weapon of a nearby creature to enhance their blow with divine energy. As an action, a creature within 30 feet of you.",
								"Until the end of your next turn, the next time that creature succeeds on a melee weapon attack, that creature heals for {@dice 1d10} hit points (if you are good or neutral) or gains {@dice 1d8} temporary hit points (if you are evil). Once you use this trait, you can't use it again until you finish a long rest."
							],
							"type": "entries"
						},
						{
							"name": "Languages",
							"entries": [
								"You can speak, read, and write Common, Squeak Speak, and Halfling."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Tiefling",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Uncommon Race",
				"Spellcasting",
				"Darkvision"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Tieflings live for about one hundred years on average."
					]
				},
				{
					"type": "entries",
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				},
				{
					"type": "entries",
					"name": "Fiendish Legacy",
					"entries": [
						"You are the recipient of a fiendish legacy that grants you supernatural abilities. Choose a legacy from the Fiendish Legacies table: Abyssal, associated with Chaotic Evil planes; Chthonic, associated with Neutral Evil planes; or Infernal, associated with Lawful Evil planes. You gain the 1st-level benefit of the chosen legacy.",
						"Starting at 3rd level and again at 5th level, you gain the ability to cast a higher-level Spell with this trait, as shown on the table. Once you cast the Spell with this trait, you can’t cast that Spell with it again until you finish a Long Rest; however, you can cast the Spell using any Spell Slots you have of the appropriate level.",
						"Intelligence, Wisdom, or Charisma is your spellcasting ability for the Spells you cast with this trait (choose the ability when you select the lineage)."
					]
				},
				{
					"type": "entries",
					"name": "Otherworldy Presence",
					"entries": [
						"You know the {@spell Thaumaturgy} cantrip. When you cast it with this trait, the Spell uses the same spellcasting ability you use for your Fiendish Legacy trait."
					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language of your choice."
					]
				}
			],
			"subraces": [
				{
					"name": "Abyssal",
					"speed": {
						"walk": 30
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"dex": 2,
							"cha": 1
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Abyssal Legacy",
							"entries": [
								"You have resistance to poison damage. You also know the {@spell poison spray} cantrip. At 3rd level, you gain the spell {@spell ray of sickness}, and at 5th level, you gain the spell {@spell hold person}."
							]
						}
					]
				},
				{
					"name": "Chthonic",
					"speed": {
						"walk": 30
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"dex": 2,
							"cha": 1
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Chthonic Legacy",
							"entries": [
								"You have resistance to necrotic damage. You also know the {@spell chill touch} cantrip. At 3rd level, you gain the spell {@spell false life}, and at 5th level, you gain the spell {@spell ray of enfeeblement}."
							]
						}
					]
				},
				{
					"name": "Infernal",
					"speed": {
						"walk": 30
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"dex": 2,
							"cha": 1
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Infernal Legacy",
							"entries": [
								"You have resistance to fire damage. You also know the {@spell fire bolt} cantrip. At 3rd level, you gain the spell {@spell hellish rebuke}, and at 5th level, you gain the spell {@spell darkness}."
							]
						}
					]
				}
			]
		},
		{
			"name": "Undead",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Undead do not age. Given time, the necromantic energies that sustain you will heal most wounds you take at approximately the same rate as a mortal, and your hit die function as normal."
					]
				},
				{
					"type": "entries",
					"name": "Past Life",
					"entries": [
						"Choose another race besides this one; the race you select must be humanoid and lack the Living Construct trait (or similar). Even after becoming undead, you maintain vague memories of this past life as this race. Your size, height, and movement speed are the same as this race. You do not retain special movement speeds from this race (such as flying, climbing, or swimming), and you do not carry over any racial features. If your past race had subraces, select one, but you do not carry over any racial features from that either."
					]
				},
				{
					"type": "entries",
					"name": "Living Dead",
					"entries": [
						"You have been brought back to the mortal coil, but your form has changed drastically. You are immune to disease. You do not need to eat or breathe. Your creature type is Undead."
					]
				},
				{
					"name": "Bloodless",
					"entries": [
						"You are immune to poison damage and the {@condition Poisoned} condition."
					]
				},
				{
					"type": "entries",
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language of your choice, typically one you knew before undeath."
					]
				}
			],
			"subraces": [
				{
					"name": "Ghost",
					"speed": {
						"walk": 30,
						"fly": 10
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"wis": 1,
							"cha": 1,
							"choose": {
								"from": [
									"wis",
									"cha"
								],
								"count": 1,
								"amount": 1
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Incorporeal Stride",
							"entries": [
								"You can move through other creatures and objects other than physical barriers (such as walls, floors, or ceilings) as if they were difficult terrain. On your turn, you can pass through up to 10 feet of physical barriers (treating them as difficult terrain) as a part of your movement. If you end your turn inside an object or barrier, you take {@dice 1d10} force damage and are immediately ejected to the closest available space. You may use this ability an amount of times equal to your proficiency bonus, regaining any expended uses upon the completion of a short or long rest.",
								"Additionally, you have a flight speed of 10 feet but must land on solid ground at the end of your turn."
							]
						},
						{
							"type": "entries",
							"name": "Intangible",
							"entries": [
								"You have advantage on all checks to resist or escape a grapple."
							]
						}
					]
				},
				{
					"name": "Revenant",
					"speed": {
						"walk": 30
					},
					"traitTags": [],
					"languageProficiencies": [],
					"ability": [
						{
							"con": 1,
							"choose": {
								"from": [
									"str",
									"cha"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Deathless",
							"entries": [
								"Rising again was no easy feat, and your new undead body assisted you in this endeavor. As an undead, you rarely tire. You treat exhaustion as if it was one level less.",
								"In addition, you don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in an inactive, motionless state, during which you retain consciousness."
							]
						},
						{
							"type": "entries",
							"name": "Driven",
							"entries": [
								"You have advantage on death saving throws."
							]
						},
						{
							"type": "entries",
							"name": "Resurrection Beyond Death",
							"entries": [
								"When you drop to 0 hit points, you can choose to stay conscious instead of falling unconscious. If you do, gain temporary hit points equal to your total character level + your Constitution modifier (minimum 1), which lasts for up to 1 minute.",
								"In this state, you can take an action or a bonus action on your turn, but not both, and can move up to only half your movement speed. You remain in this state until you regain hit points, or until you no longer have temporary hit points. If you lose all temporary hit points in this state while you are at 0 hit points, you fall unconscious and begin making death saving throws as normal. Once you use this trait, you cannot use it again until you finish a long rest."
							]
						}
					]
				},
				{
					"name": "Skeleton",
					"speed": {
						"walk": 30
					},
					"ability": [
						{
							"con": 1,
							"choose": {
								"from": [
									"dex",
									"int"
								],
								"count": 1,
								"amount": 2
							}
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Collapse",
							"entries": [
								"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. If you do, reduce yourself to a pile of bones and render yourself {@condition prone}. You are considered to be under similar effects to the {@spell feign death} spell. While subject to this condition, you are unable to move or take actions other than using an action to end this effect. Once you use this trait, you are unable to use it again until you finish a long rest."
							]
						},
						{
							"name": "Them Bones",
							"entries": [
								"If both your hands are unoccupied, you can use a bonus action to rearrange your skeletal structure, or return your body to its original configuration. When you rearrange your bones, choose one of the following options, any of which are considered to occupy both of your hands:"
							],
							"type": "entries"
						},
						{
							"type": "inset",
							"name": "Options",
							"entries": [
								{
									"entries": [
										"• You remove an arm and use it as a bone club. While used as a weapon, you have proficiency with your removed arm, which is a melee weapon with the finesse property that deals {@dice 1d6} bludgeoning damage on it. This weapon also has the light property, but for all intents and purposes, that fact is of little use."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• You remove a hand and hold it in your other as if it were a set of thieves' tools. This hand is capable of manipulating locks through picking, cutting glass, and any other function a normal set of thieves' tools could achieve."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• You remove two of your ribs and use the rest of them as a musical instrument. This instrument is referred to as the Bone Xylophone, and while playing you gain advantage on Performance checks meant to entertain children."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• You gain pull out several of your bones in an attempt to juggle them."
									],
									"type": "entries"
								},
								{
									"entries": [
										"• You can remove your skull from its socket and use your arm to look around walls."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Them Bones"
							}
						},
						{
							"entries": [
								"Your bones lose their animation if they are further than 5-feet away from your main body. If your skull loses animation, you are blinded and deafened until a skull is reaffixed to your body."
							],
							"type": "entries"
						}
					]
				}
			]
		},
		{
			"name": "Marked Humanoids",
			"source": "WMRaces",
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"null": null
				}
			],
			"traitTags": [
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"choose": true
				}
			],
			"entries": [
				{
					"name": "Origin",
					"type": "entries",
					"entries": [
						"Choose another race besides this one; the race you select must be humanoid. Your size, height, and movement speed are the same as this race. You do not retain special movement speeds from this race (such as flying, climbing, or swimming), and you do not carry over any racial features. If your Origin race had subraces, select one, but you do not carry over any racial features from that either."
					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language of your choice."
					]
				}
			],
			"subraces": [
				{
					"name": "Mark of Almeric",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"int": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"skillProficiencies": [
						{
					"tool": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Artisan's Intuition",
							"entries": [
								"When you make an {@skill Arcana} check or an ability check involving artisan's tools, you can roll a {@dice 1d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Forge's Gift",
							"entries": [
								"You gain proficiency with one type of artisan's tools of your choice."
							]
						},
						{
							"type": "entries",
							"name": "Spellsmith",
							"entries": [
								"You know the {@spell mending} cantrip. You can also cast the {@spell magic weapon} spell with this trait. When you do so, the spell lasts for 1 hour and doesn't require concentration. Once you cast the spell with this trait, you can't do so again until you finish a long rest. Intelligence is your spellcasting ability for these spells."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Almeric",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Almeric Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Almeric Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell identify}, {@spell Tenser's floating disk}"
						],
						[
							"2nd",
							"{@spell continual flame}, {@spell enhance ability}"
						],
						[
							"3rd",
							"{@spell conjure barrage}, {@spell elemental weapon}"
						],
						[
							"4th",
							"{@spell fabricate}, {@spell stone shape}"
						],
						[
							"5th",
							"{@spell creation}"
								]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Elegad",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Sentinel's Intuition",
							"entries": [
								"When you make an {@skill Insight} or {@skill Perception} check, you can roll a {@dice 1d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Guardian's Shield",
							"entries": [
								"You can cast the {@spell shield} spell once with this trait, and you regain the ability to cast it after you finish a long rest. Wisdom is your spellcasting ability for this spell."
							]
						},
						{
							"type": "entries",
							"name": "Vigillant",
							"entries": [
								"When a creature you can see within 5 feet of you is hit by an attack roll, you can use your reaction to swap places with that creature, and you are hit by the attack instead. Once you use this trait, you can't do so again until you finish a long rest."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Elegad",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Elegad Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Elegad Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell compelled duel}, {@spell shield of faith}"
						],
						[
							"2nd",
							"{@spell warding bond}, {@spell zone of truth}"
						],
						[
							"3rd",
							"{@spell counterspell}, {@spell protection from energy}"
						],
						[
							"4th",
							"{@spell death ward}, {@spell guardian of faith}"
						],
						[
							"5th",
							"{@spell bigby's hand}"
								]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Nagaroth",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"con": 2,
					"choose": {
						"from": [
							"str",
							"dex",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting",
				"Darkvision"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Hunter's Intuition",
							"entries": [
								"When you make a {@skill Perception} or {@skill Survival} check, you can roll a {@dice 1d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Warrior's Magic",
							"entries": [
								"You can cast the {@spell hunter's mark} spell with this trait. Starting at 3rd level, you can also cast the {@spell locate object} spell with it. Once you cast either spell with this trait, you can't cast that spell with it again until you finish a long rest. Wisdom is your spellcasting ability for these spells."
							]
						},
						{
							"type": "entries",
							"name": "Darkvision",
							"entries": [
								"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Nagaroth",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Nagaroth Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Nagaroth Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell faerie fire}, {@spell longstrider}"
						],
						[
							"2nd",
							"{@spell branding smite}, {@spell scorching ray}"
						],
						[
							"3rd",
							"{@spell erupting earth|xge}, {@spell flame arrows|xge}"
						],
						[
							"4th",
							"{@spell staggering smite}, {@spell locate creature}"
						],
						[
							"5th",
							"{@spell immolation|xge}"
								]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Rokmir",
					"speed": {
						"walk": 35
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Courier's Speed",
							"entries": [
								"Your base walking speed increases to 35 feet."
							]
						},
						{
							"type": "entries",
							"name": "Intuitive Motion",
							"entries": [
								"When you make an {@skill Acrobatics} check or any ability check to operate or maintain a land vehicle, you can roll a {@dice 1d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Magical Passage",
							"entries": [
								"You can cast the {@spell misty step} spell once with this trait, and you regain the ability to cast it when you finish a long rest. Dexterity is your spellcasting ability for this spell."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Rokmir",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Rokmir Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Rokmir Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell expeditious retreat}, {@spell jump}"
						],
						[
							"2nd",
							"{@spell misty step}, {@spell pass without trace}"
						],
						[
							"3rd",
							"{@spell blink}, {@spell phantom steed}"
						],
						[
							"4th",
							"{@spell dimension door}, {@spell freedom of movement}"
						],
						[
							"5th",
							"{@spell teleportation circle}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Amatus",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Liquid Luck",
							"entries": [
								"You have advantage on saving throws against being {@condition frightened}."
							]
						},
						{
							"type": "entries",
							"name": "Ever Hospitable",
							"entries": [
								"When you make a Charisma ({@skill Persuasion}) check or an ability check involving {@item brewer's supplies|PHB} or {@item cook's utensils|PHB}, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Innkeeper's Magic",
							"entries": [
								"You know the {@spell prestidigitation} cantrip. You can also cast the {@spell purify food and drink} and {@spell unseen servant} spells with this trait. Once you cast either spell with this trait, you can't cast that spell with it again until you finish long rest. Charisma is your spellcasting ability for these spells."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Amatus",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Amatus Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Amatus Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell goodberry}, {@spell sleep}"
						],
						[
							"2nd",
							"{@spell aid}, {@spell calm emotions}"
						],
						[
							"3rd",
							"{@spell create food and water}, {@spell Leomund's tiny hut}"
						],
						[
							"4th",
							"{@spell aura of purity}, {@spell Mordenkainen's private sanctum}"
						],
						[
							"5th",
							"{@spell hallow}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Satar",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Medical Intuition",
							"entries": [
								"When you make a Wisdom ({@skill Medicine}) check or an ability check using an {@item herbalism kit|phb}, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Healing Touch",
							"entries": [
								"You can cast the {@spell cure wounds} spell with this trait. Starting at 3rd level, you can also cast {@spell lesser restoration} with it. Once you cast either spell with this trait, you can't cast that spell with it again until you finish a long rest. Wisdom is your spellcasting ability for these spells."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Satar",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Satar Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Satar Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell guiding bolt}, {@spell sanctuary}"
						],
						[
							"2nd",
							"{@spell gentle repose}, {@spell flaming sphere}"
						],
						[
							"3rd",
							"{@spell aura of vitality}, {@spell daylight}"
						],
						[
							"4th",
							"{@spell aura of purity}, {@spell aura of life}"
						],
						[
							"5th",
							"{@spell greater restoration}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Armaros",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Windwright's Intuition",
							"entries": [
								"When you make a Dexterity ({@skill Acrobatics}) check or any ability check involving {@item navigator's tools|PHB}, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Storm's Boon",
							"entries": [
								"You have resistance to lightning damage."
							]
						},
						{
							"type": "entries",
							"name": "Headwinds",
							"entries": [
								"You know the {@spell gust|XGE} cantrip. Starting at 3rd level, you can cast the {@spell gust of wind} spell once with this trait, and you regain the ability to cast it when you finish a long rest. Charisma is your spellcasting ability for these spells."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Armaros",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Armaros Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Armaros Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell feather fall}, {@spell fog cloud}"
						],
						[
							"2nd",
							"{@spell gust of wind}, {@spell levitate}"
						],
						[
							"3rd",
							"{@spell sleet storm}, {@spell wind wall}"
						],
						[
							"4th",
							"{@spell conjure minor elementals}, {@spell control water}"
						],
						[
							"5th",
							"{@spell conjure elemental}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Asmodeus",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "The Fine Print",
							"entries": [
								"When you make an Intelligence ({@skill History}) check or an ability check using {@item calligrapher's supplies|PHB}, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Devil's Contractor",
							"entries": [
								"You know the {@spell message} cantrip. You can also cast {@spell comprehend languages}, {@spell disguise self} or {@spell alter self} once each with this trait, and you regain the ability to cast them when you finish a short or long rest. Starting at 3rd level, you can cast the {@spell magic mouth} spell with this trait, and you regain the ability to cast it when you finish a long rest. Intelligence is your spellcasting ability for these spells."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Asmodeus",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Asmodeus Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Asmodeus Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell tasha's hideous laughter}, {@spell illusory script}"
						],
						[
							"2nd",
							"{@spell gift of gab|AI}, {@spell silence}"
						],
						[
							"3rd",
							"{@spell fast friends|AI}, {@spell incite greed|AI}"
						],
						[
							"4th",
							"{@spell charm monster|xge}, {@spell confusion}"
						],
						[
							"5th",
							"{@spell dream}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Cid",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Deductive Intuition",
							"entries": [
								"When you make an Intelligence ({@skill Investigation}) or a Wisdom ({@skill Insight}) check, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Gifted Scribe",
							"entries": [
								"You know the {@spell encode thoughts|WMPS} cantrip. You can also cast the {@spell detect magic} and {@spell detect poison and disease} spells with this trait. Starting at 3rd level, you can also cast the {@spell see invisibility} spell with it. Once you cast any of these spells with this trait, you can't cast that spell with it again until you finish a long rest. Wisdom is your spellcasting ability for these spells, and you don't require material components for them."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Cid",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Cid Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Cid Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell comprehend languages}, {@spell illusory script}"
						],
						[
							"2nd",
							"{@spell animal messenger}, {@spell silence}"
						],
						[
							"3rd",
							"{@spell sending}, {@spell tongues}"
						],
						[
							"4th",
							"{@spell arcane eye}, {@spell confusion}"
						],
						[
							"5th",
							"{@spell dream}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Tenebrae and Mortus",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Cunning Intuition",
							"entries": [
								"When you make a Intelligence ({@skill Religion}) or Dexterity ({@skill Stealth}) check, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Darkvision",
							"entries": [
								"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
							]
						},
						{
							"type": "entries",
							"name": "Shape Shadows",
							"entries": [
								"You know the {@spell minor illusion} cantrip. Starting at 3rd level, you can cast the {@spell invisibility} spell once with this trait, and you regain the ability to cast it when you finish a long rest. Wisdom is your spellcasting ability for these spells."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Tenebrae and Mortus",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Tenebrae and Mortus Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Tenebrae and Mortus Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell disguise self}, {@spell inflict wounds}"
						],
						[
							"2nd",
							"{@spell gentle repose}, {@spell memory of ash|WMPS}"
						],
						[
							"3rd",
							"{@spell clairvoyance}, {@spell scythe of the reaper|WMPS}"
						],
						[
							"4th",
							"{@spell greater invisibility}, {@spell death ward}"
						],
						[
							"5th",
							"{@spell hallow}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Darron",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Tools of the Stratagem",
							"entries": [
								"You are considered proficient with {@item thieves' tools|PHB}, one artisan's tool of your choice, and one gaming set of your choice."
							]
						},
						{
							"type": "entries",
							"name": "Tactician's Intuition",
							"entries": [
								"When you make an Intelligence ({@skill Investigation}) check or an ability check using {@item thieves' tools|PHB}, you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Wards and Seals",
							"entries": [
								"You can cast the {@spell alarm} and {@spell mage armor} spells with this trait. Starting at 3rd level, you can also cast the {@spell arcane lock} spell with it. Once you cast any of these spells with this trait, you can't cast that spell with it again until you finish a long rest. Intelligence is your spellcasting ability for these spells, and you don't need material components for them when you cast them with this trait."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Darron",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Darron Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Darron Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell entangle}, {@spell armor of agathys}"
						],
						[
							"2nd",
							"{@spell arcane lock}, {@spell knock}"
						],
						[
							"3rd",
							"{@spell glyph of warding}, {@spell magic circle}"
						],
						[
							"4th",
							"{@spell leomund's secret chest}, {@spell mordenkainen's faithful hound}"
						],
						[
							"5th",
							"{@spell circle of power}"
						]
							]
						}
					]
				}
			]
		},
		{
					"name": "Mark of Kiya Kuba",
					"speed": {
						"walk": 30
					},
					"ability": [
					{
					"dex": 2,
					"choose": {
						"from": [
							"str",
							"con",
							"int",
							"wis",
							"cha"
						],
						"count": 1
							}
						}
					],
					"traitTags": [
				"Spellcasting"
					],
				"languageProficiencies": [
						{
					"choose": true
						}
					],
					"entries": [
						{
							"type": "entries",
							"name": "Mirthful Spirit",
							"entries": [
								"You've lived your life in the streets of bustling cities and major trade routes, you fit in these environments with extreme ease. You can find a place to hide, rest, or recuperate among large inns and within cities, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you. If you spend along rest within their care they pay you {@dice 1d6} gold if you performed for them in some way."
							]
						},
						{
							"type": "entries",
							"name": "Performer's Charm",
							"entries": [
								"When you make an Charisma ({@skill Performance}) check or Charisma ({@skill Persuasion}), you can roll a {@dice d4} and add the number rolled to the ability check."
							]
						},
						{
							"type": "entries",
							"name": "Entertainer's Repertoire",
							"entries": [
								"You know the {@spell Friends} cantrip, but the target is not hostile to you when the spell ends. Starting at 3rd level, you can also cast the {@spell charm person} spell with it, but they aren't aware of you charming them when you cast it in this way. Once you cast any of these spells with this trait, you can't cast that spell with it again until you finish a long rest. Charisma is your spellcasting ability for these spells, and you don't need material components for them when you cast them with this trait."
							]
						},
						{
						"type": "entries",
						"name": "Spells of Kiya Kuba",
						"entries": [
						"If you have the Spellcasting or the Pact Magic class feature, the spells on the Mark of Kiya Kuba Spells table are added to the spell list of your spellcasting class.",
						{
					"type": "table",
					"caption": "Mark of Kiya Kuba Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1st",
							"{@spell animal friendship}, {@spell longstrider}"
						],
						[
							"2nd",
							"{@spell calm emotions}, {@spell nathair's mischief|FTD}"
						],
						[
							"3rd",
							"{@spell motivational speech|AI}, {@spell tongues}"
						],
						[
							"4th",
							"{@spell charm monster|xge}, {@spell freedom of movement}"
						],
						[
							"5th",
							"{@spell seeming}"
						]
							]
						}
					]
				}
			]
		}
	]
}
]
}