{
	"_meta": {
		"sources": [
			{
				"json": "WMZAM",
				"abbreviation": "WMZAM",
				"full": "Way of the Zen Archer",
				"authors": [
					"Wyth"
				],
				"convertedBy": [
					"Wyth#8882"
				],
				"version": "1.0.0",
				"url": "kagrea.github.io/SRP/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"subclass": [
		{
			"name": "Way of the Zen Archer",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"shortName": "Zen Archer",
			"subclassFeatures": [
				"Way of the Zen Archer|Monk||Zen Archer|WMZAM|3",
				"Bonus Proficiencies|Monk||Zen Archer|WMZAM|3",
				"Spiritual Archery|Monk||Zen Archer|WMZAM|3",
				"Balanced Bow|Monk||Zen Archer|WMZAM|6",
				"Immaculate Lance|Monk||Zen Archer|WMZAM|11",
				"Exquisite Accuracy|Monk||Zen Archer|WMZAM|17"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Way of the Zen Archer",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Zen Archer",
			"subclassSource": "WMZAM",
			"level": 3,
			"header": 1,
			"entries": [
				"In the hands of most, a bow is simply a weapon, designed for firing arrows to strike targets far away. To a master Zen Archer, however, a bow is a conduit for spiritual energy, an implement that allows them to be both near and far at the same time, to exists in a multitude of places and forms. A Zen Archer knows that the act of loosing an arrow creates a moment of change in the world, determined ever after throughout the arrow's flight and even beyond when it reaches its destination. It is up to the archer, then, to manipulate that moment, to create the best possible outcome for all involved.",
				"Zen Archers, even more so than most monks, are given to intense concentration and keeping their minds within the moment. Knowing that a single shot can change the world, they think about their actions carefully."
			]
		},
		{
			"name": "Bonus Proficiencies",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Zen Archer",
			"subclassSource": "WMZAM",
			"level": 3,
			"header": 1,
			"entries": [
				"Starting when you choose this tradition at 3rd level, you learn how to let your ki flow through ranged weaponry, striking further than you could with fists or melee weapons. You gain proficiency in two of the following weapons: light crossbows, hand crossbows, shortbows, or longbows. These weapons are not monk weapons for you and thus do not qualify for use with the Martial Arts feature. At 11th level, the damage die of these weapons increases to {@dice 1d8} (if it is not already), and at 17th level it increases again to {@dice 1d10}."
			]
		},
		{
			"name": "Spiritual Archery",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Zen Archer",
			"subclassSource": "WMZAM",
			"level": 3,
			"header": 1,
			"entries": [
				"Also at 3rd level, you are able to concentrate and instill your ki into the arrows or bolts that you fire. Before you make an attack on your turn, you may use a bonus action to focus your ki into one of the ranged weapons you chose with your Bonus Proficiencies, causing the first attack you make with that ranged weapon this turn to deal extra damage on a hit equal to your Martial Arts die + your Wisdom modifier.",
				"In addition, you gain knowledge of the cantrip {@spell true strike} if you don't already know it, and its range increases to the furthest long range of any ranged weapon you are holding.",
				"Starting at 5th level, you gain the ability to spend 1 ki point to cause the extra damage from Spiritual Archery to apply instead to the first two such ranged weapon attacks you make on your turn.",
				"Alternatively at 5th level, you can also spend 1 ki point to cast your true strike cantrip as a free action. When you cast true strike as a free action this way, the effects of true strike occur immediately, rather than taking a turn to activate."
			]
		},
		{
			"name": "Balanced Bow",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Zen Archer",
			"subclassSource": "WMZAM",
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, your control over the ki that flows through your ranged weapons becomes more nuanced, and you are able to alter the path of an arrow in flight. Your attacks made with the ranged weapons you chose in your Bonus Proficiencies feature count as magical for the purpose of overcoming resistance and immunity to non-magical attacks and damage. You may also use your Stunning Strike feature with ranged weapon attacks.",
				"Additionally, you may choose to make ranged weapon attacks with these chosen weapons as if you were standing in any location that you can see within 30 feet of you, enabling you to curve arrows around walls and cover. The target must still be at least partially visible from your actual location or the attack suffers disadvantage, as normal."
			]
		},
		{
			"name": "Immaculate Lance",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Zen Archer",
			"subclassSource": "WMZAM",
			"level": 11,
			"header": 2,
			"entries": [
				"Beginning at 11th level, you can unleash a devastating strike of pure ki energy from your bow. As an action on your turn, you can spend 0-3 ki to produce a line of radiant light 120 feet long and 5 feet wide, which leads away from you in a direction you choose until it strikes a wall at least 1 foot thick or a solid, non-living object of similar thickness. Each creature in the line must make a Dexterity saving throw. On a failed save, a creature takes {@dice 4d4} radiant damage plus an additional {@dice 3d4} for every point of ki you spent."
			]
		},
		{
			"name": "Exquisite Accuracy",
			"source": "WMZAM",
			"className": "Monk",
			"classSource": "PHB",
			"subclassShortName": "Zen Archer",
			"subclassSource": "WMZAM",
			"level": 17,
			"header": 2,
			"entries": [
				"At 17th level, your ranged weapon becomes a true extension of yourself. Once on each of your turns when you miss with an attack, you may reroll that attack, negating any disadvantage it may have had. You must use the new result of this roll."
			]
		}
	]
}